{"id": "2512.09259", "pdf": "https://arxiv.org/pdf/2512.09259", "abs": "https://arxiv.org/abs/2512.09259", "authors": ["Yang Cao", "Zongming Ma"], "title": "MoDaH achieves rate optimal batch correction", "categories": ["stat.ME", "math.ST", "q-bio.GN"], "comment": null, "summary": "Batch effects pose a significant challenge in the analysis of single-cell omics data, introducing technical artifacts that confound biological signals. While various computational methods have achieved empirical success in correcting these effects, they lack the formal theoretical guarantees required to assess their reliability and generalization. To bridge this gap, we introduce Mixture-Model-based Data Harmonization (MoDaH), a principled batch correction algorithm grounded in a rigorous statistical framework.\n  Under a new Gaussian-mixture-model with explicit parametrization of batch effects, we establish the minimax optimal error rates for batch correction and prove that MoDaH achieves this rate by leveraging the recent theoretical advances in clustering data from anisotropic Gaussian mixtures. This constitutes, to the best of our knowledge, the first theoretical guarantee for batch correction. Extensive experiments on diverse single-cell RNA-seq and spatial proteomics datasets demonstrate that MoDaH not only attains theoretical optimality but also achieves empirical performance comparable to or even surpassing those of state-of-the-art heuristics (e.g., Harmony, Seurat-V5, and LIGER), effectively balancing the removal of technical noise with the conservation of biological signal."}
{"id": "2512.09003", "pdf": "https://arxiv.org/pdf/2512.09003", "abs": "https://arxiv.org/abs/2512.09003", "authors": ["Ling Liao", "Changhuei Yang", "Maxim Artyomov", "Mark Watson", "Adam Kepecs", "Haowen Zhou", "Alexey Sergushichev", "Richard Cote"], "title": "Digital Modeling of Spatial Pathway Activity from Histology Reveals Tumor Microenvironment Heterogeneity", "categories": ["q-bio.QM", "cs.AI"], "comment": null, "summary": "Spatial transcriptomics (ST) enables simultaneous mapping of tissue morphology and spatially resolved gene expression, offering unique opportunities to study tumor microenvironment heterogeneity. Here, we introduce a computational framework that predicts spatial pathway activity directly from hematoxylin-and-eosin-stained histology images at microscale resolution 55 and 100 um. Using image features derived from a computational pathology foundation model, we found that TGFb signaling was the most accurately predicted pathway across three independent breast and lung cancer ST datasets. In 87-88% of reliably predicted cases, the resulting spatial TGFb activity maps reflected the expected contrast between tumor and adjacent non-tumor regions, consistent with the known role of TGFb in regulating interactions within the tumor microenvironment. Notably, linear and nonlinear predictive models performed similarly, suggesting that image features may relate to pathway activity in a predominantly linear fashion or that nonlinear structure is small relative to measurement noise. These findings demonstrate that features extracted from routine histopathology may recover spatially coherent and biologically interpretable pathway patterns, offering a scalable strategy for integrating image-based inference with ST information in tumor microenvironment studies."}
{"id": "2512.09152", "pdf": "https://arxiv.org/pdf/2512.09152", "abs": "https://arxiv.org/abs/2512.09152", "authors": ["Peter W Fields", "Vudtiwat Ngampruetikorn", "David J Schwab", "Stephanie E Palmer"], "title": "Understanding temperature tuning in energy-based models", "categories": ["q-bio.QM", "cs.LG"], "comment": "18 pages, 7 figures", "summary": "Generative models of complex systems often require post-hoc parameter adjustments to produce useful outputs. For example, energy-based models for protein design are sampled at an artificially low ''temperature'' to generate novel, functional sequences. This temperature tuning is a common yet poorly understood heuristic used across machine learning contexts to control the trade-off between generative fidelity and diversity. Here, we develop an interpretable, physically motivated framework to explain this phenomenon. We demonstrate that in systems with a large ''energy gap'' - separating a small fraction of meaningful states from a vast space of unrealistic states - learning from sparse data causes models to systematically overestimate high-energy state probabilities, a bias that lowering the sampling temperature corrects. More generally, we characterize how the optimal sampling temperature depends on the interplay between data size and the system's underlying energy landscape. Crucially, our results show that lowering the sampling temperature is not always desirable; we identify the conditions where \\emph{raising} it results in better generative performance. Our framework thus casts post-hoc temperature tuning as a diagnostic tool that reveals properties of the true data distribution and the limits of the learned model."}
{"id": "2512.09158", "pdf": "https://arxiv.org/pdf/2512.09158", "abs": "https://arxiv.org/abs/2512.09158", "authors": ["Tomáš Bůžek"], "title": "Riemannian vs. Euclidean Representation of Gait Kinematics: A Comparative Analysis", "categories": ["q-bio.QM"], "comment": null, "summary": "Accurate quantification of complex human movements, such as gait, is essential for clinical diagnosis and rehabilitation but is often limited by traditional linear models rooted in Euclidean geometry. These frameworks frequently fail to capture the intrinsic non-linear dynamics and posture-dependent dependencies of biological systems. To address this, we present a computational framework that maps kinematic data onto a Riemannian manifold of Symmetric Positive Definite (SPD) matrices. Using the Log-Euclidean metric, we transformed raw skeletal pose sequences into geometric feature vectors to quantify gait variability and smoothness across three velocity profiles: slow, medium, and fast. Our comparative analysis reveals a critical divergence between geometric approaches. While Euclidean metrics exhibit a strictly linear increase in variability with speed (Slow < Medium < Fast), implying instability, the proposed Riemannian metrics reveal a non-linear \"inverted-U'' pattern with varying speeds. Specifically, we observed a stabilization of variance at high speeds (sprinting), suggesting that the motor system optimizes efficiency by adhering to geodesic trajectories of minimum effort. These findings demonstrate that manifold-based representations offer superior sensitivity to biomechanical efficiency compared to standard linear methods, providing a robust foundation for future diagnostic algorithms and explainable machine learning models in clinical biomechanics."}
