{"id": "2506.15728", "pdf": "https://arxiv.org/pdf/2506.15728", "abs": "https://arxiv.org/abs/2506.15728", "authors": ["Jiangnan Zhao", "Hanbo Xu", "Cifu Xu", "Wenlong Yin", "Laixin Luo", "Gang Liu", "Yan Wang"], "title": "Smartphone-integrated RPA-CRISPR-Cas12a Detection System with Microneedle Sampling for Point-of-Care Diagnosis of Potato Late Blight in Early Stage", "categories": ["q-bio.QM", "cs.CV", "q-bio.BM"], "comment": "32 pages,7 figures,1 table", "summary": "Potato late blight, caused by the oomycete pathogen Phytophthora infestans,\nis one of the most devastating diseases affecting potato crops in the history.\nAlthough conventional detection methods of plant diseases such as PCR and LAMP\nare highly sensitive and specific, they rely on bulky and expensive laboratory\nequipment and involve complex operations, making them impracticable for\npoint-of care diagnosis in the field. Here in this study, we report a portable\nRPA-CRISPR based diagnosis system for plant disease, integrating smartphone for\nacquisition and analysis of fluorescent images. A polyvinyl alcohol (PVA)\nmicroneedle patch was employed for sample extraction on the plant leaves within\none minute, the DNA extraction efficiency achieved 56 ug/mg, which is\napproximately 3 times to the traditional CTAB methods (18 ug/mg). The system of\nRPA-CRISPR-Cas12a isothermal assay was established to specifically target P.\ninfestans with no cross-reactivity observed against closely-related species (P.\nsojae, P. capsici). The system demonstrated a detection limit of 2 pg/uL for P.\ninfestans genomic DNA, offering sensitivity comparable to that of benchtop\nlaboratory equipment. The system demonstrates the early-stage diagnosis\ncapability by achieving a approximately 80% and 100% detection rate on the\nthird and fourth day post-inoculation respectively, before visible symptoms\nobserved on the leaves. The smartphone-based \"sample-to-result\" system\ndecouples the limitations of traditional methods that rely heavily on\nspecialized equipment, offering a promising way for early-stage plant disease\ndetection and control in the field."}
{"id": "2506.15855", "pdf": "https://arxiv.org/pdf/2506.15855", "abs": "https://arxiv.org/abs/2506.15855", "authors": ["Iris Lang", "Jenna Landy", "Giovanni Parmigiani"], "title": "Bayesian Non-Negative Matrix Factorization with Correlated Mutation Type Probabilities for Mutational Signatures", "categories": ["q-bio.QM", "stat.ME"], "comment": "23 pages, 10 figures, (+ references and supplement)", "summary": "Somatic mutations, or alterations in DNA of a somatic cell, are key markers\nof cancer. In recent years, mutational signature analysis has become a\nprominent field of study within cancer research, commonly with Nonnegative\nMatrix Factorization (NMF) and Bayesian NMF. However, current methods assume\nindependence across mutation types in the signatures matrix. This paper expands\nupon current Bayesian NMF methodologies by proposing novel methods that account\nfor the dependencies between the mutation types. First, we implement the\nBayesian NMF specification with a Multivariate Truncated Normal prior on the\nsignatures matrix in order to model the covariance structure using external\ninformation, in our case estimated from the COSMIC signatures database. This\nmodel converges in fewer iterations, using MCMC, when compared to a model with\nindependent Truncated Normal priors on elements of the signatures matrix and\nresults in improvements in accuracy, especially on small sample sizes. In\naddition, we develop a hierarchical model that allows the covariance structure\nof the signatures matrix to be discovered rather than specified upfront, giving\nthe algorithm more flexibility. This flexibility for the algorithm to learn the\ndependence structure of the signatures allows a better understanding of\nbiological interactions and how these change across different types of cancer.\nThe code for this project is contributed to an open-source R software package.\nOur work lays the groundwork for future research to incorporate dependency\nstructure across mutation types in the signatures matrix and is also applicable\nto any use of NMF beyond just single-base substitution (SBS) mutational\nsignatures."}
{"id": "2506.15957", "pdf": "https://arxiv.org/pdf/2506.15957", "abs": "https://arxiv.org/abs/2506.15957", "authors": ["Kento Nakamura", "Hajime Fukuoka", "Akihiko Ishijima", "Tetsuya J. Kobayashi"], "title": "Quantification of Information Flow by Dual Reporter System and Its Application to Bacterial Chemotaxis", "categories": ["q-bio.QM", "q-bio.CB"], "comment": "6 pages, 2 figures", "summary": "Mutual information is a theoretically grounded metric for quantifying\ncellular signaling pathways. However, its measurement demands characterization\nof both input and output distributions, limiting practical applications. Here,\nwe present alternative method that alleviates this requirement using dual\nreporter systems. By extending extrinsic-intrinsic noise analysis, we derive a\nmutual information estimator that eliminates the need to measure input\ndistribution. We demonstrate our method by analyzing the bacterial chemotactic\npathway, regarding multiple flagellar motors as natural dual reporters. We show\nthe biological relevance of the measured information flow by comparing it with\ntheoretical bounds on sensory information. This framework opens new\npossibilities for quantifying information flow in cellular signaling pathways."}
{"id": "2506.16091", "pdf": "https://arxiv.org/pdf/2506.16091", "abs": "https://arxiv.org/abs/2506.16091", "authors": ["Julián García-Vinuesa", "Jorge Rojas", "Nicole Soto-García", "Nicolás Martínez", "Diego Alvarez-Saravia", "Roberto Uribe-Paredes", "Mehdi D. Davari", "Carlos Conca", "Juan A. Asenjo", "David Medina-Ortiz"], "title": "Geometric deep learning assists protein engineering. Opportunities and Challenges", "categories": ["q-bio.QM"], "comment": null, "summary": "Protein engineering is experiencing a paradigmatic shift through the\nintegration of geometric deep learning into computational design workflows.\nWhile traditional strategies, such as rational design and directed evolution,\nhave enabled relevant advances, they remain limited by the complexity of\nsequence space and the cost of experimental validation. Geometric deep learning\naddresses these limitations by operating on non-Euclidean domains, capturing\nspatial, topological, and physicochemical features essential to protein\nfunction. This perspective outlines the current applications of GDL across\nstability prediction, functional annotation, molecular interaction modeling,\nand de novo protein design. We highlight recent methodological advances in\nmodel generalization, interpretability, and robustness, particularly under\ndata-scarce conditions. A unified framework is proposed that integrates GDL\nwith explainable AI and structure-based validation to support transparent,\nautonomous design. As GDL converges with generative modeling and\nhigh-throughput experimentation, it is emerging as a central technology in\nnext-generation protein engineering and synthetic biology."}
{"id": "2506.16374", "pdf": "https://arxiv.org/pdf/2506.16374", "abs": "https://arxiv.org/abs/2506.16374", "authors": ["Martin R. Schiller"], "title": "Central Dogma Cycle and Network: A Model for Cell Memory", "categories": ["q-bio.MN"], "comment": null, "summary": "This paper proposes an extension of the traditional Central Dogma of\nmolecular biology to a more dynamic model termed the Central Dogma Cycle (CDC)\nand a broader network called the Central Dogma Cyclic Network (CDCN). While the\nCentral Dogma is necessary for genetic information flow, it is not sufficient\nto fully explain cellular memory and information management. The CDC\nincorporates additional well-established steps, including protein folding and\nprotein networking, highlighting the cyclical nature of information flow in\ncells. This cyclic architecture is proposed as a key mechanism for cellular\nmemory, drawing analogies to memory functions in computers, such as input,\nread, write, execute, and erase. The interconnected cycles within the CDCN,\nincluding metabolic cycles and signaling pathways, are suggested to function\nakin to latches in computer memory, contributing to the storage and processing\nof cellular information beyond nucleic acid sequences. Understanding cellular\nmemory through this cyclic network model offers a new perspective on heredity,\ncell processes, and the potential disruptions in disease pathology."}
{"id": "2506.16359", "pdf": "https://arxiv.org/pdf/2506.16359", "abs": "https://arxiv.org/abs/2506.16359", "authors": ["Sarah Pungitore", "Shashank Yadav", "Molly Douglas", "Jarrod Mosier", "Vignesh Subbian"], "title": "SHREC and PHEONA: Using Large Language Models to Advance Next-Generation Computational Phenotyping", "categories": ["q-bio.QM"], "comment": "Submitted to Journal of the American Medical Informatics Association", "summary": "Objective: Computational phenotyping is a central informatics activity with\nresulting cohorts supporting a wide variety of applications. However, it is\ntime-intensive because of manual data review, limited automation, and\ndifficulties in adapting algorithms across sources. Since LLMs have\ndemonstrated promising capabilities for text classification, comprehension, and\ngeneration, we posit they will perform well at repetitive manual review tasks\ntraditionally performed by human experts. To support next-generation\ncomputational phenotyping methods, we developed SHREC, a framework for\ncomprehensive integration of LLMs into end-to-end phenotyping pipelines.\nMaterials and Methods: We applied and tested the ability of three lightweight\nLLMs (Gemma2 27 billion, Mistral Small 24 billion, and Phi-4 14 billion) to\nclassify concepts and phenotype patients using previously developed phenotypes\nfor ARF respiratory support therapies. Results: All models performed well on\nconcept classification, with the best model (Mistral) achieving an AUROC of\n0.896 across all relevant concepts. For phenotyping, models demonstrated\nnear-perfect specificity for all phenotypes, and the top-performing model\n(Mistral) reached an average AUROC of 0.853 for single-therapy phenotypes,\ndespite lower performance on multi-therapy phenotypes. Discussion: There are\nseveral advantages of LLMs that support their application to computational\nphenotyping, such as their ability to adapt to new tasks with prompt\nengineering alone and their ability to incorporate raw EHR data. Future steps\nto advance next-generation phenotyping methods include determining optimal\nstrategies for integrating biomedical data, exploring how LLMs reason, and\nadvancing generative model methods. Conclusion: Current lightweight LLMs can\nfeasibly assist researchers with resource-intensive phenotyping tasks such as\nmanual data review."}
{"id": "2506.16921", "pdf": "https://arxiv.org/pdf/2506.16921", "abs": "https://arxiv.org/abs/2506.16921", "authors": ["Muhammad Daud", "Philippe Charton", "Cedric Damour", "Jingbo Wang", "Frederic Cadet"], "title": "EHCube4P: Learning Epistatic Patterns Through Hypercube Graph Convolution Neural Network for Protein Fitness Function Estimation", "categories": ["q-bio.QM"], "comment": "12 pages, 4 figures, 1 table", "summary": "Understanding the relationship between protein sequences and their functions\nis fundamental to protein engineering, but this task is hindered by the\ncombinatorially vast sequence space and the experimental noise inherent in\nfitness measurements. In this study, we present a novel framework that models\nthe sequence landscape as a hypercube $H(k,2)$ and integrates wavelet-based\nsignal denoising with a graph convolutional neural network (GCN) to predict\nprotein fitness across rugged fitness landscapes. Using a dataset of 419\nexperimentally measured mutant sequences of the Tobacco 5-Epi-Aristolochene\nSynthase (TEAS) enzyme, we preprocess the fitness signals using a 1-D discrete\nwavelet transform with a Daubechies-3 basis to suppress experimental noise\nwhile preserving local epistatic patterns. Our model comprises two GCN layers,\nallowing for beyond pairwise aggregation, followed by a multi-layer perceptron\n(MLP). We show that our approach, EHCube4P, generalizes well across different\nenzyme activity datasets and effectively captures higher-order mutational\ninteractions. Performance varies with the ruggedness of the fitness landscape,\nwith smoother signals yielding higher test set $r^2$ scores. These results\ndemonstrate that combining wavelet preprocessing with graph-based deep learning\nenhances the robustness and generalization of fitness prediction, particularly\nfor sparse and noisy biological datasets. The approach provides a scalable and\ninterpretable framework for protein fitness estimation applicable to a broad\nrange of combinatorial biological systems."}
{"id": "2506.16629", "pdf": "https://arxiv.org/pdf/2506.16629", "abs": "https://arxiv.org/abs/2506.16629", "authors": ["Eric V. Strobl"], "title": "Learning Causally Predictable Outcomes from Psychiatric Longitudinal Data", "categories": ["cs.LG", "q-bio.QM", "stat.ML"], "comment": "R code is available at github.com/ericstrobl/DEBIAS", "summary": "Causal inference in longitudinal biomedical data remains a central challenge,\nespecially in psychiatry, where symptom heterogeneity and latent confounding\nfrequently undermine classical estimators. Most existing methods for treatment\neffect estimation presuppose a fixed outcome variable and address confounding\nthrough observed covariate adjustment. However, the assumption of\nunconfoundedness may not hold for a fixed outcome in practice. To address this\nfoundational limitation, we directly optimize the outcome definition to\nmaximize causal identifiability. Our DEBIAS (Durable Effects with\nBackdoor-Invariant Aggregated Symptoms) algorithm learns non-negative,\nclinically interpretable weights for outcome aggregation, maximizing durable\ntreatment effects and empirically minimizing both observed and latent\nconfounding by leveraging the time-limited direct effects of prior treatments\nin psychiatric longitudinal data. The algorithm also furnishes an empirically\nverifiable test for outcome unconfoundedness. DEBIAS consistently outperforms\nstate-of-the-art methods in recovering causal effects for clinically\ninterpretable composite outcomes across comprehensive experiments in depression\nand schizophrenia."}
