{"id": "2509.08013", "pdf": "https://arxiv.org/pdf/2509.08013", "abs": "https://arxiv.org/abs/2509.08013", "authors": ["Mahya Aghaee", "Victoria Cicchirillo+", "Kyle Adams", "Alberto Riva", "Rebecca Nance-Richey", "William Hager", "Ashley N. Brown", "Elias Sayour", "Domenico Santoro", "Rowan Milner", "Bently Doonan", "Helen Moore"], "title": "Mathematical Discovery of Potential Therapeutic Targets: Application to Rare Melanomas", "categories": ["q-bio.QM"], "comment": null, "summary": "Patients with rare types of melanoma such as acral, mucosal, or uveal\nmelanoma, have lower survival rates than patients with cutaneous melanoma;\nthese lower survival rates reflect the lower objective response rates to\nimmunotherapy compared to cutaneous melanoma. Understanding tumor-immune\ndynamics in rare melanomas is critical for the development of new therapies and\nfor improving response rates to current cancer therapies. Progress has been\nhindered by the lack of clinical data and the need for better preclinical\nmodels of rare melanomas. Canine melanoma provides a valuable comparative\noncology model for rare types of human melanomas. We analyzed RNA sequencing\ndata from canine melanoma patients and combined this with literature\ninformation to create a novel mechanistic mathematical model of melanoma-immune\ndynamics. Sensitivity analysis of the mathematical model indicated influential\npathways in the dynamics, providing support for potential new therapeutic\ntargets and future combinations of therapies. We share our learnings from this\nwork, to help enable the application of this proof-of-concept workflow to other\nrare disease settings with sparse available data."}
{"id": "2509.08020", "pdf": "https://arxiv.org/pdf/2509.08020", "abs": "https://arxiv.org/abs/2509.08020", "authors": ["Matthew Carter", "Lee Devlin", "Alexander Philips", "Edward Pyzer-Knapp", "Paul Spirakis", "Simon Maskell"], "title": "Towards Scalable Proteomics: Opportunistic SMC Samplers on HTCondor", "categories": ["q-bio.QM", "cs.DC", "stat.CO"], "comment": null, "summary": "Quantitative proteomics plays a central role in uncovering regulatory\nmechanisms, identifying disease biomarkers, and guiding the development of\nprecision therapies. These insights are often obtained through complex Bayesian\nmodels, whose inference procedures are computationally intensive, especially\nwhen applied at scale to biological datasets. This limits the accessibility of\nadvanced modelling techniques needed to fully exploit proteomics data. Although\nSequential Monte Carlo (SMC) methods offer a parallelisable alternative to\ntraditional Markov Chain Monte Carlo, their high-performance implementations\noften rely on specialised hardware, increasing both financial and energy costs.\nWe address these challenges by introducing an opportunistic computing framework\nfor SMC samplers, tailored to the demands of large-scale proteomics inference.\nOur approach leverages idle compute resources at the University of Liverpool\nvia HTCondor, enabling scalable Bayesian inference without dedicated\nhigh-performance computing infrastructure. Central to this framework is a novel\nCoordinator-Manager-Follower architecture that reduces synchronisation overhead\nand supports robust operation in heterogeneous, unreliable environments. We\nevaluate the framework on a realistic proteomics model and show that\nopportunistic SMC delivers accurate inference with weak scaling, increasing\nsamples generated under a fixed time budget as more resources join. To support\nadoption, we release CondorSMC, an open-source package for deploying SMC\nsamplers in opportunistic computing environments."}
{"id": "2509.08578", "pdf": "https://arxiv.org/pdf/2509.08578", "abs": "https://arxiv.org/abs/2509.08578", "authors": ["Hong Liu"], "title": "MAESTRO: Multi-modal Adaptive Ensemble for Spectro-Temporal Robust Optimization", "categories": ["cs.LG", "q-bio.PE", "q-bio.QM"], "comment": null, "summary": "Timely and robust influenza incidence forecasting is critical for public\nhealth decision-making. To address this, we present MAESTRO, a Multi-modal\nAdaptive Ensemble for Spectro-Temporal Robust Optimization. MAESTRO achieves\nrobustness by adaptively fusing multi-modal inputs-including surveillance, web\nsearch trends, and meteorological data-and leveraging a comprehensive\nspectro-temporal architecture. The model first decomposes time series into\nseasonal and trend components. These are then processed through a hybrid\nfeature enhancement pipeline combining Transformer-based encoders, a Mamba\nstate-space model for long-range dependencies, multi-scale temporal\nconvolutions, and a frequency-domain analysis module. A cross-channel attention\nmechanism further integrates information across the different data modalities.\nFinally, a temporal projection head performs sequence-to-sequence forecasting,\nwith an optional estimator to quantify prediction uncertainty. Evaluated on\nover 11 years of Hong Kong influenza data (excluding the COVID-19 period),\nMAESTRO shows strong competitive performance, demonstrating a superior model\nfit and relative accuracy, achieving a state-of-the-art R-square of 0.956.\nExtensive ablations confirm the significant contributions of both multi-modal\nfusion and the spectro-temporal components. Our modular and reproducible\npipeline is made publicly available to facilitate deployment and extension to\nother regions and pathogens.Our publicly available pipeline presents a\npowerful, unified framework, demonstrating the critical synergy of advanced\nspectro-temporal modeling and multi-modal data fusion for robust\nepidemiological forecasting."}
