{"id": "2508.15273", "pdf": "https://arxiv.org/pdf/2508.15273", "abs": "https://arxiv.org/abs/2508.15273", "authors": ["Alexander Blokhuis", "Peter F. Stadler", "Nicola Vassena"], "title": "Stoichiometric recipes for periodic oscillations in reaction networks", "categories": ["q-bio.MN", "math.DS", "05C92, 37G10, 37N25, 92C40, 92C42, 92E10"], "comment": "20 pages (Main) + 63 pages (Supplementary Information)", "summary": "Oscillatory chemical reactions are functional components in a variety of\nbiological contexts. In chemistry, the construction and identification of even\nrudimentary oscillators remain elusive and lack a general framework. Using\nparameter-rich kinetics - a methodology enabling the disentanglement of\nparametric dependencies from structural analysis - we investigate the\nstoichiometry of chemical oscillators. We introduce the concept of oscillatory\ncores - minimal subnetworks that guarantee the potential for oscillations in\nany reaction network containing them. These cores fall into two classes,\ndepending on whether they involve positive or negative feedback. In particular,\nthe latter class unveils a family of oscillators - yet to be synthesized - that\nrequire a minimum number of reaction steps to exhibit oscillations, a\nphenomenon we refer to as the principle of length. We identify several\nmechanisms through which catalysis promotes oscillations: (I) furnishing\ninstability (e.g. autocatalysis), (II) lifting dependencies, (III) lowering\nlength thresholds. Notwithstanding this mechanistic ubiquity, we show that\noscillators can also be realized without employing any catalysis. Our results\nhighlight branches of chemistry where oscillators are likely to arise by\nchance, suggest new strategies for their design, and point to novel classes of\noscillators yet to be realized experimentally."}
{"id": "2508.14902", "pdf": "https://arxiv.org/pdf/2508.14902", "abs": "https://arxiv.org/abs/2508.14902", "authors": ["Lennart H. Bosch", "Pernille R. Jensen", "Nico Striegler", "Thomas Unden", "Jochen Scharpf", "Usman Qureshi", "Philipp Neumann", "Martin Gierse", "John W. Blanchard", "Stephan Knecht", "Jochen Scheuer", "Ilai Schwart", "Martin B. Plenio"], "title": "Hierarchical Maximum Likelihood Estimation for Time-Resolved NMR Data", "categories": ["q-bio.QM", "physics.data-an"], "comment": "15 pages, 4 figures", "summary": "Metabolic monitoring and reaction rate estimation using hyperpolarized NMR\ntechnology requires accurate quantitative analysis of multidimensional data\nscenarios. Currently, this analysis is often performed in a two-stage\nprocedure, which is prone to errors in uncertainty propagation and estimation.\nWe propose an approach derived from a Bayesian hierarchical model that\nintrinsically propagates uncertainties and operates on the full data to\nmaximize the precision at minimal uncertainty. In an analytic treatment, we\nreduce the estimation procedure to a least-squares optimization problem which\ncan be understood as an extension of the Variable Projection (VarPro) approach\nfor data scenarios with two predictors. We investigate the method's efficacy in\ntwo experiments with hyperpolarized metabolites recorded with conventional\nhigh-field NMR devices and a micronscale NMR setup using Nitrogen-Vacancy\ncenters in diamond for detection, respectively. In both examples, the new\napproach improves estimates compared to Fourier methods and proves operational\nadvantages over a two-stage procedure employing VarPro. While the approach\npresented is motivated by NMR analysis, it is straightforwardly applicable to\nfurther estimation scenarios with similar data structure, such as time-resolved\nphotospectroscopy."}
{"id": "2508.14922", "pdf": "https://arxiv.org/pdf/2508.14922", "abs": "https://arxiv.org/abs/2508.14922", "authors": ["Swati Sharma", "Thanadet Chuangsuwanich", "Royston K. Y. Tan", "Shimna C. Prasad", "Tin A. Tun", "Shamira A. Perera", "Martin L. Buist", "Tin Aung", "Monisha E. Nongpiur", "Michaël J. A. Girard"], "title": "Fusing Structural Phenotypes with Functional Data for Early Prediction of Primary Angle Closure Glaucoma Progression", "categories": ["q-bio.QM", "cs.AI", "cs.CV", "eess.IV"], "comment": "23 pages, 5 figures, 3 tables", "summary": "Purpose: To classify eyes as slow or fast glaucoma progressors in patients\nwith primary angle closure glaucoma (PACG) using an integrated approach\ncombining optic nerve head (ONH) structural features and sector-based visual\nfield (VF) functional parameters. Methods: PACG patients with >5 reliable VF\ntests over >5 years were included. Progression was assessed in Zeiss Forum,\nwith baseline VF within six months of OCT. Fast progression was VFI decline\n<-2.0% per year; slow progression >-2.0% per year. OCT volumes were\nAI-segmented to extract 31 ONH parameters. The Glaucoma Hemifield Test defined\nfive regions per hemifield, aligned with RNFL distribution. Mean sensitivity\nper region was combined with structural parameters to train ML classifiers.\nMultiple models were tested, and SHAP identified key predictors. Main outcome\nmeasures: Classification of slow versus fast progressors using combined\nstructural and functional data. Results: We analyzed 451 eyes from 299\npatients. Mean VFI progression was -0.92% per year; 369 eyes progressed slowly\nand 82 rapidly. The Random Forest model combining structural and functional\nfeatures achieved the best performance (AUC = 0.87, 2000 Monte Carlo\niterations). SHAP identified six key predictors: inferior MRW, inferior and\ninferior-temporal RNFL thickness, nasal-temporal LC curvature, superior nasal\nVF sensitivity, and inferior RNFL and GCL+IPL thickness. Models using only\nstructural or functional features performed worse with AUC of 0.82 and 0.78,\nrespectively. Conclusions: Combining ONH structural and VF functional\nparameters significantly improves classification of progression risk in PACG.\nInferior ONH features, MRW and RNFL thickness, were the most predictive,\nhighlighting the critical role of ONH morphology in monitoring disease\nprogression."}
{"id": "2508.14936", "pdf": "https://arxiv.org/pdf/2508.14936", "abs": "https://arxiv.org/abs/2508.14936", "authors": ["Jan Kapar", "Kathrin Günther", "Lori Ann Vallis", "Klaus Berger", "Nadine Binder", "Hermann Brenner", "Stefanie Castell", "Beate Fischer", "Volker Harth", "Bernd Holleczek", "Timm Intemann", "Till Ittermann", "André Karch", "Thomas Keil", "Lilian Krist", "Berit Lange", "Michael F. Leitzmann", "Katharina Nimptsch", "Nadia Obi", "Iris Pigeot", "Tobias Pischon", "Tamara Schikowski", "Börge Schmidt", "Carsten Oliver Schmidt", "Anja M. Sedlmair", "Justine Tanoey", "Harm Wienbergen", "Andreas Wienke", "Claudia Wigmann", "Marvin N. Wright"], "title": "Can synthetic data reproduce real-world findings in epidemiology? A replication study using tree-based generative AI", "categories": ["q-bio.QM", "cs.AI", "cs.LG", "stat.AP", "stat.ML"], "comment": null, "summary": "Generative artificial intelligence for synthetic data generation holds\nsubstantial potential to address practical challenges in epidemiology. However,\nmany current methods suffer from limited quality, high computational demands,\nand complexity for non-experts. Furthermore, common evaluation strategies for\nsynthetic data often fail to directly reflect statistical utility. Against this\nbackground, a critical underexplored question is whether synthetic data can\nreliably reproduce key findings from epidemiological research. We propose the\nuse of adversarial random forests (ARF) as an efficient and convenient method\nfor synthesizing tabular epidemiological data. To evaluate its performance, we\nreplicated statistical analyses from six epidemiological publications and\ncompared original with synthetic results. These publications cover blood\npressure, anthropometry, myocardial infarction, accelerometry, loneliness, and\ndiabetes, based on data from the German National Cohort (NAKO\nGesundheitsstudie), the Bremen STEMI Registry U45 Study, and the Guelph Family\nHealth Study. Additionally, we assessed the impact of dimensionality and\nvariable complexity on synthesis quality by limiting datasets to variables\nrelevant for individual analyses, including necessary derivations. Across all\nreplicated original studies, results from multiple synthetic data replications\nconsistently aligned with original findings. Even for datasets with relatively\nlow sample size-to-dimensionality ratios, the replication outcomes closely\nmatched the original results across various descriptive and inferential\nanalyses. Reducing dimensionality and pre-deriving variables further enhanced\nboth quality and stability of the results."}
{"id": "2508.15034", "pdf": "https://arxiv.org/pdf/2508.15034", "abs": "https://arxiv.org/abs/2508.15034", "authors": ["Mahdi Bagheri", "Clemente Velasco-Annis", "Jian Wang", "Razieh Faghihpirayesh", "Shadab Khan", "Camilo Calixto", "Camilo Jaimes", "Lana Vasung", "Abdelhakim Ouaalam", "Onur Afacan", "Simon K. Warfield", "Caitlin K. Rollins", "Ali Gholipour"], "title": "An MRI Atlas of the Human Fetal Brain: Reference and Segmentation Tools for Fetal Brain MRI Analysis", "categories": ["q-bio.QM"], "comment": null, "summary": "Accurate characterization of in-utero brain development is essential for\nunderstanding typical and atypical neurodevelopment. Building upon previous\nefforts to construct spatiotemporal fetal brain MRI atlases, we present the\nCRL-2025 fetal brain atlas, which is a spatiotemporal (4D) atlas of the\ndeveloping fetal brain between 21 and 37 gestational weeks. This atlas is\nconstructed from carefully processed MRI scans of 160 fetuses with\ntypically-developing brains using a diffeomorphic deformable registration\nframework integrated with kernel regression on age. CRL-2025 uniquely includes\ndetailed tissue segmentations, transient white matter compartments, and\nparcellation into 126 anatomical regions. This atlas offers significantly\nenhanced anatomical details over the CRL-2017 atlas, and is released along with\nthe CRL diffusion MRI atlas with its newly created tissue segmentation and\nlabels as well as deep learning-based multiclass segmentation models for\nfine-grained fetal brain MRI segmentation. The CRL-2025 atlas and its\nassociated tools provide a robust and scalable platform for fetal brain MRI\nsegmentation, groupwise analysis, and early neurodevelopmental research, and\nthese materials are publicly released to support the broader research\ncommunity."}
{"id": "2508.15046", "pdf": "https://arxiv.org/pdf/2508.15046", "abs": "https://arxiv.org/abs/2508.15046", "authors": ["Shih-Huan Huang", "Matthew W. Cotton", "Tuomas P. J. Knowles", "David Klenerman", "Georg Meisl"], "title": "A cell-level model to predict the spatiotemporal dynamics of neurodegenerative disease", "categories": ["q-bio.QM", "cond-mat.soft"], "comment": null, "summary": "A central challenge in modeling neurodegenerative diseases is connecting\ncellular-level mechanisms to tissue-level pathology, in particular to determine\nwhether pathology is driven primarily by cell-autonomous triggers or by\npropagation from cells that are already in a pathological, runaway aggregation\nstate. To bridge this gap, we here develop a bottom-up physical model that\nexplicitly incorporates these two fundamental cell-level drivers of protein\naggregation dynamics. We show that our model naturally explains the\ncharacteristic long, slow development of pathology followed by a rapid\nacceleration, a hallmark of many neurodegenerative diseases. Furthermore, the\nmodel reveals the existence of a critical switch point at which the system's\ndynamics transition from being dominated by slow, spontaneous formation of\ndiseased cells to being driven by fast propagation. This framework provides a\nrobust physical foundation for interpreting pathological data and offers a\nmethod to predict which class of therapeutic strategies is best matched to the\nunderlying drivers of a specific disease."}
{"id": "2508.15103", "pdf": "https://arxiv.org/pdf/2508.15103", "abs": "https://arxiv.org/abs/2508.15103", "authors": ["Mehdi Yazdani-Jahromi", "Ali Khodabandeh Yalabadi", "Ozlem Ozmen Garibay"], "title": "Equi-mRNA: Protein Translation Equivariant Encoding for mRNA Language Models", "categories": ["q-bio.QM", "cs.AI"], "comment": null, "summary": "The growing importance of mRNA therapeutics and synthetic biology highlights\nthe need for models that capture the latent structure of synonymous codon\n(different triplets encoding the same amino acid) usage, which subtly modulates\ntranslation efficiency and gene expression. While recent efforts incorporate\ncodon-level inductive biases through auxiliary objectives, they often fall\nshort of explicitly modeling the structured relationships that arise from the\ngenetic code's inherent symmetries. We introduce Equi-mRNA, the first\ncodon-level equivariant mRNA language model that explicitly encodes synonymous\ncodon symmetries as cyclic subgroups of 2D Special Orthogonal matrix (SO(2)).\nBy combining group-theoretic priors with an auxiliary equivariance loss and\nsymmetry-aware pooling, Equi-mRNA learns biologically grounded representations\nthat outperform vanilla baselines across multiple axes. On downstream\nproperty-prediction tasks including expression, stability, and riboswitch\nswitching Equi-mRNA delivers up to approximately 10% improvements in accuracy.\nIn sequence generation, it produces mRNA constructs that are up to\napproximately 4x more realistic under Frechet BioDistance metrics and\napproximately 28% better preserve functional properties compared to vanilla\nbaseline. Interpretability analyses further reveal that learned codon-rotation\ndistributions recapitulate known GC-content biases and tRNA abundance patterns,\noffering novel insights into codon usage. Equi-mRNA establishes a new\nbiologically principled paradigm for mRNA modeling, with significant\nimplications for the design of next-generation therapeutics."}
{"id": "2508.14932", "pdf": "https://arxiv.org/pdf/2508.14932", "abs": "https://arxiv.org/abs/2508.14932", "authors": ["Jiacheng Xie", "Ziyang Zhang", "Biplab Poudel", "Congyu Guo", "Yang Yu", "Guanghui An", "Xiaoting Tang", "Lening Zhao", "Chunhui Xu", "Dong Xu"], "title": "TOM: An Open-Source Tongue Segmentation Method with Multi-Teacher Distillation and Task-Specific Data Augmentation", "categories": ["eess.IV", "cs.AI", "q-bio.QM"], "comment": "Tongue segmentation, data augmentation, synthetic data for AI\n  training, prompt engineering, Segment Anything Model, knowledge distillation,\n  tongue classification", "summary": "Tongue imaging serves as a valuable diagnostic tool, particularly in\nTraditional Chinese Medicine (TCM). The quality of tongue surface segmentation\nsignificantly affects the accuracy of tongue image classification and\nsubsequent diagnosis in intelligent tongue diagnosis systems. However, existing\nresearch on tongue image segmentation faces notable limitations, and there is a\nlack of robust and user-friendly segmentation tools. This paper proposes a\ntongue image segmentation model (TOM) based on multi-teacher knowledge\ndistillation. By incorporating a novel diffusion-based data augmentation\nmethod, we enhanced the generalization ability of the segmentation model while\nreducing its parameter size. Notably, after reducing the parameter count by\n96.6% compared to the teacher models, the student model still achieves an\nimpressive segmentation performance of 95.22% mIoU. Furthermore, we packaged\nand deployed the trained model as both an online and offline segmentation tool\n(available at https://itongue.cn/), allowing TCM practitioners and researchers\nto use it without any programming experience. We also present a case study on\nTCM constitution classification using segmented tongue patches. Experimental\nresults demonstrate that training with tongue patches yields higher\nclassification performance and better interpretability than original tongue\nimages. To our knowledge, this is the first open-source and freely available\ntongue image segmentation tool."}
