{"id": "2506.11311", "pdf": "https://arxiv.org/pdf/2506.11311", "abs": "https://arxiv.org/abs/2506.11311", "authors": ["Yue Liu", "Philip K. Maini", "Ruth E. Baker"], "title": "Optimal experiment design for practical parameter identifiability and model discrimination", "categories": ["q-bio.QM", "92B05, 49N90, 62F99"], "comment": "Submitted to Mathematical Biosciences", "summary": "Mechanistic mathematical models of biological systems usually contain a\nnumber of unknown parameters whose values need to be estimated from available\nexperimental data in order for the models to be validated and used to make\nquantitative predictions. This requires that the models are practically\nidentifiable, that is, the values of the parameters can be confidently\ndetermined, given available data. A well-designed experiment can produce data\nthat are much more informative for the purpose of inferring parameter values\nthan a poorly designed experiment. It is, therefore, of great interest to\noptimally design experiments such that the resulting data maximise the\npractical identifiability of a chosen model. Experimental design is also useful\nfor model discrimination, where we seek to distinguish between multiple\ndistinct, competing models of the same biological system in order to determine\nwhich model better reveals insight into the underlying biological mechanisms.\nIn many cases, an external stimulus can be used as a control input to probe the\nbehaviour of the system. In this paper, we will explore techniques for\noptimally designing such a control for a given experiment, in order to maximise\nparameter identifiability and model discrimination, and demonstrate these\ntechniques in the context of commonly applied ordinary differential equation\nmodels. We use a profile likelihood-based approach to assess parameter\nidentifiability. We then show how the problem of optimal experimental design\nfor model discrimination can be formulated as an optimal control problem, which\ncan be solved efficiently by applying Pontryagin's Maximum Principle."}
{"id": "2506.10186", "pdf": "https://arxiv.org/pdf/2506.10186", "abs": "https://arxiv.org/abs/2506.10186", "authors": ["Yuhui Ding", "Thomas Hofmann"], "title": "Scalable Non-Equivariant 3D Molecule Generation via Rotational Alignment", "categories": ["cs.LG", "cs.AI", "q-bio.QM"], "comment": "ICML 2025", "summary": "Equivariant diffusion models have achieved impressive performance in 3D\nmolecule generation. These models incorporate Euclidean symmetries of 3D\nmolecules by utilizing an SE(3)-equivariant denoising network. However,\nspecialized equivariant architectures limit the scalability and efficiency of\ndiffusion models. In this paper, we propose an approach that relaxes such\nequivariance constraints. Specifically, our approach learns a sample-dependent\nSO(3) transformation for each molecule to construct an aligned latent space. A\nnon-equivariant diffusion model is then trained over the aligned\nrepresentations. Experimental results demonstrate that our approach performs\nsignificantly better than previously reported non-equivariant models. It yields\nsample quality comparable to state-of-the-art equivariant diffusion models and\noffers improved training and sampling efficiency. Our code is available at\nhttps://github.com/skeletondyh/RADM"}
{"id": "2506.11161", "pdf": "https://arxiv.org/pdf/2506.11161", "abs": "https://arxiv.org/abs/2506.11161", "authors": ["Ali R. Taheriyoun", "Allen Ross", "Abolfazl Safikhani", "Damoon Soudbakhsh", "Ali Rahnavard"], "title": "Longitudinal Omics Data Analysis: A Review on Models, Algorithms, and Tools", "categories": ["stat.ME", "q-bio.QM"], "comment": null, "summary": "Longitudinal omics data (LOD) analysis is essential for understanding the\ndynamics of biological processes and disease progression over time. This review\nexplores various statistical and computational approaches for analyzing such\ndata, emphasizing their applications and limitations. The main characteristics\nof longitudinal data, such as imbalancedness, high-dimensionality, and\nnon-Gaussianity are discussed for modeling and hypothesis testing. We discuss\nthe properties of linear mixed models (LMM) and generalized linear mixed models\n(GLMM) as foundation stones in LOD analyses and highlight their extensions to\nhandle the obstacles in the frequentist and Bayesian frameworks. We\ndifferentiate in dynamic data analysis between time-course and longitudinal\nanalyses, covering functional data analysis (FDA) and replication constraints.\nWe explore classification techniques, single-cell as exemplary omics\nlongitudinal studies, survival modeling, and multivariate methods for\nclinical/biomarker-based applications. Emerging topics, including data\nintegration, clustering, and network-based modeling, are also discussed. We\ncategorized the state-of-the-art approaches applicable to omics data,\nhighlighting how they address the data features. This review serves as a\nguideline for researchers seeking robust strategies to analyze longitudinal\nomics data effectively, which is usually complex."}
{"id": "2506.11272", "pdf": "https://arxiv.org/pdf/2506.11272", "abs": "https://arxiv.org/abs/2506.11272", "authors": ["Julian Sutaria", "Cristian Staii"], "title": "Entropy-Constrained Noise Yields Superdiffusive Dynamics in Axonal Growth", "categories": ["physics.bio-ph", "cond-mat.soft", "nlin.AO", "q-bio.CB", "q-bio.QM"], "comment": "11 pages, 3 figures", "summary": "We present a coarse-grained stochastic model for axonal extension on periodic\narrays of parallel micropatterns that integrates three key biophysical\nmechanisms: (i) the molecular clutch that couples actin retrograde flow to\nsubstrate adhesions, (ii) an active biopolymer-based mechanism generating\ntraction-force fluctuations, and (iii) the mechanical interaction of the growth\ncone with the micropatterned substrate. Using the Shannon-Jaynes maximum\nentropy principle with constraints derived from experimental observations, we\nderive a unique probability distribution for the colored acceleration noise\nthat enters the Langevin equation. The resulting stationary process exhibits\npower-law temporal correlations with negative exponent, which accounts for the\nobserved superdiffusive dynamics of axons. For biologically relevant parameters\nthe model predicts this exponent to be -1/2, in close quantitative agreement\nwith measurements of cortical neurons cultured on patterned substrates."}
{"id": "2506.11152", "pdf": "https://arxiv.org/pdf/2506.11152", "abs": "https://arxiv.org/abs/2506.11152", "authors": ["Hiren Madhu", "João Felipe Rocha", "Tinglin Huang", "Siddharth Viswanath", "Smita Krishnaswamy", "Rex Ying"], "title": "HEIST: A Graph Foundation Model for Spatial Transcriptomics and Proteomics Data", "categories": ["q-bio.GN", "cs.LG", "q-bio.CB"], "comment": null, "summary": "Single-cell transcriptomics has become a great source for data-driven\ninsights into biology, enabling the use of advanced deep learning methods to\nunderstand cellular heterogeneity and transcriptional regulation at the\nsingle-cell level. With the advent of spatial transcriptomics data we have the\npromise of learning about cells within a tissue context as it provides both\nspatial coordinates and transcriptomic readouts. However, existing models\neither ignore spatial resolution or the gene regulatory information. Gene\nregulation in cells can change depending on microenvironmental cues from\nneighboring cells, but existing models neglect gene regulatory patterns with\nhierarchical dependencies across levels of abstraction. In order to create\ncontextualized representations of cells and genes from spatial transcriptomics\ndata, we introduce HEIST, a hierarchical graph transformer-based foundation\nmodel for spatial transcriptomics and proteomics data. HEIST models tissue as\nspatial cellular neighborhood graphs, and each cell is, in turn, modeled as a\ngene regulatory network graph. The framework includes a hierarchical graph\ntransformer that performs cross-level message passing and message passing\nwithin levels. HEIST is pre-trained on 22.3M cells from 124 tissues across 15\norgans using spatially-aware contrastive learning and masked auto-encoding\nobjectives. Unsupervised analysis of HEIST representations of cells, shows that\nit effectively encodes the microenvironmental influences in cell embeddings,\nenabling the discovery of spatially-informed subpopulations that prior models\nfail to differentiate. Further, HEIST achieves state-of-the-art results on four\ndownstream task such as clinical outcome prediction, cell type annotation, gene\nimputation, and spatially-informed cell clustering across multiple\ntechnologies, highlighting the importance of hierarchical modeling and\nGRN-based representations."}
{"id": "2506.11683", "pdf": "https://arxiv.org/pdf/2506.11683", "abs": "https://arxiv.org/abs/2506.11683", "authors": ["Chloe H. Choi", "Andrea Zanoni", "Daniele E. Schiavazzi", "Alison L. Marsden"], "title": "On the performance of multi-fidelity and reduced-dimensional neural emulators for inference of physiologic boundary conditions", "categories": ["stat.ML", "cs.CE", "cs.LG", "math.ST", "q-bio.QM", "stat.TH"], "comment": null, "summary": "Solving inverse problems in cardiovascular modeling is particularly\nchallenging due to the high computational cost of running high-fidelity\nsimulations. In this work, we focus on Bayesian parameter estimation and\nexplore different methods to reduce the computational cost of sampling from the\nposterior distribution by leveraging low-fidelity approximations. A common\napproach is to construct a surrogate model for the high-fidelity simulation\nitself. Another is to build a surrogate for the discrepancy between high- and\nlow-fidelity models. This discrepancy, which is often easier to approximate, is\nmodeled with either a fully connected neural network or a nonlinear\ndimensionality reduction technique that enables surrogate construction in a\nlower-dimensional space. A third possible approach is to treat the discrepancy\nbetween the high-fidelity and surrogate models as random noise and estimate its\ndistribution using normalizing flows. This allows us to incorporate the\napproximation error into the Bayesian inverse problem by modifying the\nlikelihood function. We validate five different methods which are variations of\nthe above on analytical test cases by comparing them to posterior distributions\nderived solely from high-fidelity models, assessing both accuracy and\ncomputational cost. Finally, we demonstrate our approaches on two\ncardiovascular examples of increasing complexity: a lumped-parameter Windkessel\nmodel and a patient-specific three-dimensional anatomy."}
{"id": "2506.11158", "pdf": "https://arxiv.org/pdf/2506.11158", "abs": "https://arxiv.org/abs/2506.11158", "authors": ["Xizheng Yu", "Justin Torok", "Sneha Pandya", "Sourav Pal", "Vikas Singh", "Ashish Raj"], "title": "Brain-wide interpolation and conditioning of gene expression in the human brain using Implicit Neural Representations", "categories": ["q-bio.GN", "cs.LG"], "comment": null, "summary": "In this paper, we study the efficacy and utility of recent advances in\nnon-local, non-linear image interpolation and extrapolation algorithms,\nspecifically, ideas based on Implicit Neural Representations (INR), as a tool\nfor analysis of spatial transcriptomics data. We seek to utilize the microarray\ngene expression data sparsely sampled in the healthy human brain, and produce\nfully resolved spatial maps of any given gene across the whole brain at a\nvoxel-level resolution. To do so, we first obtained the 100 top AD risk genes,\nwhose baseline spatial transcriptional profiles were obtained from the Allen\nHuman Brain Atlas (AHBA). We adapted Implicit Neural Representation models so\nthat the pipeline can produce robust voxel-resolution quantitative maps of all\ngenes. We present a variety of experiments using interpolations obtained from\nAbagen as a baseline/reference."}
{"id": "2506.11942", "pdf": "https://arxiv.org/pdf/2506.11942", "abs": "https://arxiv.org/abs/2506.11942", "authors": ["James C. Kosmopoulos", "Karthik Anantharaman"], "title": "Viral Dark Matter: Illuminating Protein Function, Ecology, and Biotechnological Promises", "categories": ["q-bio.GN", "q-bio.QM"], "comment": null, "summary": "Viruses are the most abundant biological entities on Earth and play central\nroles in shaping microbiomes and influencing ecosystem functions. Yet, most\nviral genes remain uncharacterized, comprising what is commonly referred to as\n\"viral dark matter.\" Metagenomic studies across diverse environments\nconsistently show that 40-90% of viral genes lack known homologs or annotated\nfunctions. This persistent knowledge gap limits our ability to interpret viral\nsequence data, understand virus-host interactions, and assess the ecological or\napplied significance of viral genes. Among the most intriguing components of\nviral dark matter are auxiliary viral genes (AVGs), including auxiliary\nmetabolic genes (AMGs), regulatory genes (AReGs), and host physiology-modifying\ngenes (APGs), which may alter host function during infection and contribute to\nmicrobial metabolism, stress tolerance, or resistance. In this review, we\nexplore recent advances in the discovery and functional characterization of\nviral dark matter. We highlight representative examples of novel viral proteins\nacross diverse ecosystems including human microbiomes, soil, oceans, and\nextreme environments, and discuss what is known, and still unknown, about their\nroles. We then examine the bioinformatic and experimental challenges that\nhinder functional characterization, and present emerging strategies to overcome\nthese barriers. Finally, we highlight both the fundamental and applied benefits\nthat multidisciplinary efforts to characterize viral proteins can bring. By\nintegrating computational predictions with experimental validation, and\nfostering collaboration across disciplines, we emphasize that illuminating\nviral dark matter is both feasible and essential for advancing microbial\necology and unlocking new tools for biotechnology."}
{"id": "2506.11182", "pdf": "https://arxiv.org/pdf/2506.11182", "abs": "https://arxiv.org/abs/2506.11182", "authors": ["Azim Dehghani Amirabad", "Yanfei Zhang", "Artem Moskalev", "Sowmya Rajesh", "Tommaso Mansi", "Shuwei Li", "Mangal Prakash", "Rui Liao"], "title": "Multimodal Modeling of CRISPR-Cas12 Activity Using Foundation Models and Chromatin Accessibility Data", "categories": ["q-bio.GN", "cs.AI"], "comment": "This manuscript has been accepted by ICML workshop 2025", "summary": "Predicting guide RNA (gRNA) activity is critical for effective CRISPR-Cas12\ngenome editing but remains challenging due to limited data, variation across\nprotospacer adjacent motifs (PAMs-short sequence requirements for Cas binding),\nand reliance on large-scale training. We investigate whether pre-trained\nbiological foundation model originally trained on transcriptomic data can\nimprove gRNA activity estimation even without domain-specific pre-training.\nUsing embeddings from existing RNA foundation model as input to lightweight\nregressor, we show substantial gains over traditional baselines. We also\nintegrate chromatin accessibility data to capture regulatory context, improving\nperformance further. Our results highlight the effectiveness of pre-trained\nfoundation models and chromatin accessibility data for gRNA activity\nprediction."}
{"id": "2506.11491", "pdf": "https://arxiv.org/pdf/2506.11491", "abs": "https://arxiv.org/abs/2506.11491", "authors": ["Roxana Zahedi", "Ahmadreza Argha", "Nona Farbehi", "Ivan Bakhshayeshi", "Youqiong Ye", "Nigel H. Lovell", "Hamid Alinejad-Rokny"], "title": "SemanticST: Spatially Informed Semantic Graph Learning for1 Clustering, Integration, and Scalable Analysis of Spatial2 Transcriptomics", "categories": ["q-bio.GN", "cs.LG"], "comment": "6 Figures", "summary": "Spatial transcriptomics (ST) technologies enable gene expression profiling\nwith spatial resolution, offering unprecedented insights into tissue\norganization and disease heterogeneity. However, current analysis methods often\nstruggle with noisy data, limited scalability, and inadequate modelling of\ncomplex cellular relationships. We present SemanticST, a biologically informed,\ngraph-based deep learning framework that models diverse cellular contexts\nthrough multi-semantic graph construction. SemanticST builds multiple\ncontext-specific graphs capturing spatial proximity, gene expression\nsimilarity, and tissue domain structure, and learns disentangled embeddings for\neach. These are fused using an attention-inspired strategy to yield a unified,\nbiologically meaningful representation. A community-aware min-cut loss improves\nrobustness over contrastive learning, particularly in sparse ST data.\nSemanticST supports mini-batch training, making it the first graph neural\nnetwork scalable to large-scale datasets such as Xenium (500,000 cells).\nBenchmarking across four platforms (Visium, Slide-seq, Stereo-seq, Xenium) and\nmultiple human and mouse tissues shows consistent 20 percentage gains in ARI,\nNMI, and trajectory fidelity over DeepST, GraphST, and IRIS. In re-analysis of\nbreast cancer Xenium data, SemanticST revealed rare and clinically significant\nniches, including triple receptor-positive clusters, spatially distinct\nDCIS-to-IDC transition zones, and FOXC2 tumour-associated myoepithelial cells,\nsuggesting non-canonical EMT programs with stem-like features. SemanticST thus\nprovides a scalable, interpretable, and biologically grounded framework for\nspatial transcriptomics analysis, enabling robust discovery across tissue types\nand diseases, and paving the way for spatially resolved tissue atlases and\nnext-generation precision medicine."}
{"id": "2506.11896", "pdf": "https://arxiv.org/pdf/2506.11896", "abs": "https://arxiv.org/abs/2506.11896", "authors": ["Daan R. Speth", "Nick Pullen", "Samuel T. N. Aroney", "Benjamin L. Coltman", "Jay T. Osvatic", "Ben J. Woodcroft", "Thomas Rattei", "Michael Wagner"], "title": "GlobDB: A comprehensive species-dereplicated microbial genome resource", "categories": ["q-bio.GN"], "comment": "11 pages (including references), 1 table, 0 figures", "summary": "Over the past years, substantial numbers of microbial species' genomes have\nbeen deposited outside of conventional INSDC databases. The GlobDB aggregates\n14 independent genomic catalogues to provide a comprehensive database of\nspecies-dereplicated microbial genomes, with consistent taxonomy, annotations,\nand additional analysis resources. The GlobDB is available at\nhttps://globdb.org/."}
{"id": "2506.11942", "pdf": "https://arxiv.org/pdf/2506.11942", "abs": "https://arxiv.org/abs/2506.11942", "authors": ["James C. Kosmopoulos", "Karthik Anantharaman"], "title": "Viral Dark Matter: Illuminating Protein Function, Ecology, and Biotechnological Promises", "categories": ["q-bio.GN", "q-bio.QM"], "comment": null, "summary": "Viruses are the most abundant biological entities on Earth and play central\nroles in shaping microbiomes and influencing ecosystem functions. Yet, most\nviral genes remain uncharacterized, comprising what is commonly referred to as\n\"viral dark matter.\" Metagenomic studies across diverse environments\nconsistently show that 40-90% of viral genes lack known homologs or annotated\nfunctions. This persistent knowledge gap limits our ability to interpret viral\nsequence data, understand virus-host interactions, and assess the ecological or\napplied significance of viral genes. Among the most intriguing components of\nviral dark matter are auxiliary viral genes (AVGs), including auxiliary\nmetabolic genes (AMGs), regulatory genes (AReGs), and host physiology-modifying\ngenes (APGs), which may alter host function during infection and contribute to\nmicrobial metabolism, stress tolerance, or resistance. In this review, we\nexplore recent advances in the discovery and functional characterization of\nviral dark matter. We highlight representative examples of novel viral proteins\nacross diverse ecosystems including human microbiomes, soil, oceans, and\nextreme environments, and discuss what is known, and still unknown, about their\nroles. We then examine the bioinformatic and experimental challenges that\nhinder functional characterization, and present emerging strategies to overcome\nthese barriers. Finally, we highlight both the fundamental and applied benefits\nthat multidisciplinary efforts to characterize viral proteins can bring. By\nintegrating computational predictions with experimental validation, and\nfostering collaboration across disciplines, we emphasize that illuminating\nviral dark matter is both feasible and essential for advancing microbial\necology and unlocking new tools for biotechnology."}
