{"id": "2509.02639", "pdf": "https://arxiv.org/pdf/2509.02639", "abs": "https://arxiv.org/abs/2509.02639", "authors": ["Hojjat Torabi Goudarzi", "Maziyar Baran Pouyan"], "title": "Enhanced Single-Cell RNA-seq Embedding through Gene Expression and Data-Driven Gene-Gene Interaction Integration", "categories": ["q-bio.GN", "cs.AI", "68T07, 68T05, 62H30, 92C42, 62P10, 05C85", "I.2.6; I.5.3; I.5.1; H.2.8; J.3"], "comment": "33 pages, 9 figures, article", "summary": "Single-cell RNA sequencing (scRNA-seq) provides unprecedented insights into\ncellular heterogeneity, enabling detailed analysis of complex biological\nsystems at single-cell resolution. However, the high dimensionality and\ntechnical noise inherent in scRNA-seq data pose significant analytical\nchallenges. While current embedding methods focus primarily on gene expression\nlevels, they often overlook crucial gene-gene interactions that govern cellular\nidentity and function. To address this limitation, we present a novel embedding\napproach that integrates both gene expression profiles and data-driven\ngene-gene interactions. Our method first constructs a Cell-Leaf Graph (CLG)\nusing random forest models to capture regulatory relationships between genes,\nwhile simultaneously building a K-Nearest Neighbor Graph (KNNG) to represent\nexpression similarities between cells. These graphs are then combined into an\nEnriched Cell-Leaf Graph (ECLG), which serves as input for a graph neural\nnetwork to compute cell embeddings. By incorporating both expression levels and\ngene-gene interactions, our approach provides a more comprehensive\nrepresentation of cellular states. Extensive evaluation across multiple\ndatasets demonstrates that our method enhances the detection of rare cell\npopulations and improves downstream analyses such as visualization, clustering,\nand trajectory inference. This integrated approach represents a significant\nadvance in single-cell data analysis, offering a more complete framework for\nunderstanding cellular diversity and dynamics."}
{"id": "2509.02648", "pdf": "https://arxiv.org/pdf/2509.02648", "abs": "https://arxiv.org/abs/2509.02648", "authors": ["John Zobolas", "Anne-Marie George", "Alberto López", "Sebastian Fischer", "Marc Becker", "Tero Aittokallio"], "title": "Optimizing Prognostic Biomarker Discovery in Pancreatic Cancer Through Hybrid Ensemble Feature Selection and Multi-Omics Data", "categories": ["q-bio.GN", "cs.LG", "q-bio.QM", "stat.AP"], "comment": "52 pages, 5 figures, 9 Supplementary Figures, 1 Supplementary Table", "summary": "Prediction of patient survival using high-dimensional multi-omics data\nrequires systematic feature selection methods that ensure predictive\nperformance, sparsity, and reliability for prognostic biomarker discovery. We\ndeveloped a hybrid ensemble feature selection (hEFS) approach that combines\ndata subsampling with multiple prognostic models, integrating both embedded and\nwrapper-based strategies for survival prediction. Omics features are ranked\nusing a voting-theory-inspired aggregation mechanism across models and\nsubsamples, while the optimal number of features is selected via a Pareto\nfront, balancing predictive accuracy and model sparsity without any\nuser-defined thresholds. When applied to multi-omics datasets from three\npancreatic cancer cohorts, hEFS identifies significantly fewer and more stable\nbiomarkers compared to the conventional, late-fusion CoxLasso models, while\nmaintaining comparable discrimination performance. Implemented within the\nopen-source mlr3fselect R package, hEFS offers a robust, interpretable, and\nclinically valuable tool for prognostic modelling and biomarker discovery in\nhigh-dimensional survival settings."}
{"id": "2509.03330", "pdf": "https://arxiv.org/pdf/2509.03330", "abs": "https://arxiv.org/abs/2509.03330", "authors": ["Bnaya Gross", "Joseph Ehlert", "Vadim N. Gladyshev", "Joseph Loscalzo", "Albert-László Barabási"], "title": "Network-driven discovery of repurposable drugs targeting hallmarks of aging", "categories": ["q-bio.MN", "physics.soc-ph"], "comment": null, "summary": "Despite the thousands of genes implicated in age-related phenotypes,\neffective interventions for aging remain elusive, a lack of advance rooted in\nthe multifactorial nature of longevity and the functional interconnectedness of\nthe molecular components implicated in aging. Here, we introduce a network\nmedicine framework that integrates 2,358 longevity-associated genes onto the\nhuman interactome to identify existing drugs that can modulate aging processes.\nWe find that genes associated with each hallmark of aging form a connected\nsubgraph, or hallmark module, a discovery enabling us to measure the proximity\nof 6,442 clinically approved or experimental compounds to each hallmark. We\nthen introduce a transcription-based metric, $pAGE$, which evaluates whether\nthe drug-induced expression shifts reinforce or counteract known age-related\nexpression changes. By integrating network proximity and $pAGE$, we identify\nmultiple drug repurposing candidate that not only target specific hallmarks but\nact to reverse their aging-associated transcriptional changes. Our findings are\ninterpretable, revealing for each drug the molecular mechanisms through which\nit modulates the hallmark, offering an experimentally falsifiable framework to\nleverage genomic discoveries to accelerate drug repurposing for longevity."}
{"id": "2509.02594", "pdf": "https://arxiv.org/pdf/2509.02594", "abs": "https://arxiv.org/abs/2509.02594", "authors": ["Sandhanakrishnan Ravichandran", "Shivesh Kumar", "Rogerio Corga Da Silva", "Miguel Romano", "Reinhard Berkels", "Michiel van der Heijden", "Olivier Fail", "Valentine Emmanuel Gnanapragasam"], "title": "OpenAIs HealthBench in Action: Evaluating an LLM-Based Medical Assistant on Realistic Clinical Queries", "categories": ["q-bio.QM", "cs.AI", "cs.ET", "cs.IR"], "comment": "13 pages, two graphs", "summary": "Evaluating large language models (LLMs) on their ability to generate\nhigh-quality, accurate, situationally aware answers to clinical questions\nrequires going beyond conventional benchmarks to assess how these systems\nbehave in complex, high-stake clincal scenarios. Traditional evaluations are\noften limited to multiple-choice questions that fail to capture essential\ncompetencies such as contextual reasoning, awareness and uncertainty handling\netc. To address these limitations, we evaluate our agentic, RAG-based clinical\nsupport assistant, DR.INFO, using HealthBench, a rubric-driven benchmark\ncomposed of open-ended, expert-annotated health conversations. On the Hard\nsubset of 1,000 challenging examples, DR.INFO achieves a HealthBench score of\n0.51, substantially outperforming leading frontier LLMs (GPT-5, o3, Grok 3,\nGPT-4, Gemini 2.5, etc.) across all behavioral axes (accuracy, completeness,\ninstruction following, etc.). In a separate 100-sample evaluation against\nsimilar agentic RAG assistants (OpenEvidence, Pathway.md), it maintains a\nperformance lead with a health-bench score of 0.54. These results highlight\nDR.INFOs strengths in communication, instruction following, and accuracy, while\nalso revealing areas for improvement in context awareness and completeness of a\nresponse. Overall, the findings underscore the utility of behavior-level,\nrubric-based evaluation for building a reliable and trustworthy AI-enabled\nclinical support assistant."}
{"id": "2509.03336", "pdf": "https://arxiv.org/pdf/2509.03336", "abs": "https://arxiv.org/abs/2509.03336", "authors": ["Sharanya Manoharan", "Balu Bhasuran", "Oviya Ramalakshmi Iyyappan", "Mohamed Saleem Abdul Shukkoor", "Malathi Sellapan", "Kalpana Raja"], "title": "AI-Driven Drug Repurposing through miRNA-mRNA Relation", "categories": ["q-bio.MN", "cs.IR", "q-bio.QM"], "comment": null, "summary": "miRNA mRNA relations are closely linked to several biological processes and\ndisease mechanisms In a recent study we tested the performance of large\nlanguage models LLMs on extracting miRNA mRNA relations from PubMed PubMedBERT\nachieved the best performance of 0.783 F1 score for miRNA mRNA Interaction\nCorpus MMIC Here we first applied the finetuned PubMedBERT model to extract\nmiRNA mRNA relations from PubMed for chronic obstructive pulmonary disease COPD\nAlzheimers disease AD stroke type 2 diabetes mellitus T2DM chronic liver\ndisease and cancer Next we retrieved miRNA drug relations using KinderMiner a\nliterature mining tool for relation extraction Then we constructed three\ninteraction networks 1 disease centric network 2 drug centric network and 3\nmiRNA centric network comprising 3497 nodes and 16417 edges organized as a\ndirected graph to capture complex biological relationships Finally we validated\nthe drugs using MIMIC IV Our integrative approach revealed both established and\nnovel candidate drugs for diseases under study through 595 miRNA drug relations\nextracted from PubMed To the best of our knowledge this is the first study to\nsystematically extract and visualize relationships among four distinct\nbiomedical entities miRNA mRNA drug and disease"}
{"id": "2509.02606", "pdf": "https://arxiv.org/pdf/2509.02606", "abs": "https://arxiv.org/abs/2509.02606", "authors": ["Thanh Tung Khuat", "Johnny Peng", "Robert Bassett", "Ellen Otte", "Bogdan Gabrys"], "title": "Lessons Learned from Deploying Adaptive Machine Learning Agents with Limited Data for Real-time Cell Culture Process Monitoring", "categories": ["q-bio.QM", "cs.LG", "A.1; J.3; I.2.0; I.2.6; I.2.m; I.5.4"], "comment": null, "summary": "This study explores the deployment of three machine learning (ML) approaches\nfor real-time prediction of glucose, lactate, and ammonium concentrations in\ncell culture processes, using Raman spectroscopy as input features. The\nresearch addresses challenges associated with limited data availability and\nprocess variability, providing a comparative analysis of pretrained models,\njust-in-time learning (JITL), and online learning algorithms. Two industrial\ncase studies are presented to evaluate the impact of varying bioprocess\nconditions on model performance. The findings highlight the specific conditions\nunder which pretrained models demonstrate superior predictive accuracy and\nidentify scenarios where JITL or online learning approaches are more effective\nfor adaptive process monitoring. This study also highlights the critical\nimportance of updating the deployed models/agents with the latest offline\nanalytical measurements during bioreactor operations to maintain the model\nperformance against the changes in cell growth behaviours and operating\nconditions throughout the bioreactor run. Additionally, the study confirms the\nusefulness of a simple mixture-of-experts framework in achieving enhanced\naccuracy and robustness for real-time predictions of metabolite concentrations\nbased on Raman spectral data. These insights contribute to the development of\nrobust strategies for the efficient deployment of ML models in dynamic and\nchanging biomanufacturing environments."}
{"id": "2509.02610", "pdf": "https://arxiv.org/pdf/2509.02610", "abs": "https://arxiv.org/abs/2509.02610", "authors": ["Jonathan Feldman", "Tal Feldman"], "title": "Resilient Biosecurity in the Era of AI-Enabled Bioweapons", "categories": ["q-bio.QM", "cs.AI"], "comment": null, "summary": "Recent advances in generative biology have enabled the design of novel\nproteins, creating significant opportunities for drug discovery while also\nintroducing new risks, including the potential development of synthetic\nbioweapons. Existing biosafety measures primarily rely on inference-time\nfilters such as sequence alignment and protein-protein interaction (PPI)\nprediction to detect dangerous outputs. In this study, we evaluate the\nperformance of three leading PPI prediction tools: AlphaFold 3, AF3Complex, and\nSpatialPPIv2. These models were tested on well-characterized viral-host\ninteractions, such as those involving Hepatitis B and SARS-CoV-2. Despite being\ntrained on many of the same viruses, the models fail to detect a substantial\nnumber of known interactions. Strikingly, none of the tools successfully\nidentify any of the four experimentally validated SARS-CoV-2 mutants with\nconfirmed binding. These findings suggest that current predictive filters are\ninadequate for reliably flagging even known biological threats and are even\nmore unlikely to detect novel ones. We argue for a shift toward\nresponse-oriented infrastructure, including rapid experimental validation,\nadaptable biomanufacturing, and regulatory frameworks capable of operating at\nthe speed of AI-driven developments."}
{"id": "2509.02626", "pdf": "https://arxiv.org/pdf/2509.02626", "abs": "https://arxiv.org/abs/2509.02626", "authors": ["Abhigyan Sarkar", "Boris Rubinsky"], "title": "A Wrist-Worn Multimodal Reaction Time Monitoring Device for Ecologically-Valid Cognitive Assessment", "categories": ["q-bio.QM"], "comment": null, "summary": "Reaction time (RT) is a fundamental measure in cognitive and\nneurophysiological assessment, yet most existing RT systems require active user\nengagement and controlled environments, limiting their use in real-world\nsettings. This paper introduces a low cost wrist-worn instrumentation platform\ndesigned to capture human reaction times (RT) across auditory, visual, and\nhaptic modalities with millisecond latency in real-world conditions. The device\nintegrates synchronized stimulus delivery and event detection within a compact\nmicrocontroller-based system, eliminating the need for user focus or examiner\nsupervision. Emphasizing measurement fidelity, we detail the hardware\narchitecture, timing control algorithms, and calibration methodology used to\nensure consistent latency handling across modalities. A proof-of-concept study\nwith six adult participants compares this system against a benchmark\ncomputer-based RT tool across five experimental conditions. The results confirm\nthat the device achieves statistically comparable RT measurements with strong\nmodality consistency, supporting its potential as a novel tool for\nnon-obtrusive cognitive monitoring. Contributions include a validated design\nfor time-critical behavioral measurement and a demonstration of its robustness\nin unconstrained, ambient-noise environments. It offers a powerful new tool for\ncontinuous, real-world cognitive monitoring and has significant potential for\nboth research and clinical applications."}
{"id": "2509.02648", "pdf": "https://arxiv.org/pdf/2509.02648", "abs": "https://arxiv.org/abs/2509.02648", "authors": ["John Zobolas", "Anne-Marie George", "Alberto López", "Sebastian Fischer", "Marc Becker", "Tero Aittokallio"], "title": "Optimizing Prognostic Biomarker Discovery in Pancreatic Cancer Through Hybrid Ensemble Feature Selection and Multi-Omics Data", "categories": ["q-bio.GN", "cs.LG", "q-bio.QM", "stat.AP"], "comment": "52 pages, 5 figures, 9 Supplementary Figures, 1 Supplementary Table", "summary": "Prediction of patient survival using high-dimensional multi-omics data\nrequires systematic feature selection methods that ensure predictive\nperformance, sparsity, and reliability for prognostic biomarker discovery. We\ndeveloped a hybrid ensemble feature selection (hEFS) approach that combines\ndata subsampling with multiple prognostic models, integrating both embedded and\nwrapper-based strategies for survival prediction. Omics features are ranked\nusing a voting-theory-inspired aggregation mechanism across models and\nsubsamples, while the optimal number of features is selected via a Pareto\nfront, balancing predictive accuracy and model sparsity without any\nuser-defined thresholds. When applied to multi-omics datasets from three\npancreatic cancer cohorts, hEFS identifies significantly fewer and more stable\nbiomarkers compared to the conventional, late-fusion CoxLasso models, while\nmaintaining comparable discrimination performance. Implemented within the\nopen-source mlr3fselect R package, hEFS offers a robust, interpretable, and\nclinically valuable tool for prognostic modelling and biomarker discovery in\nhigh-dimensional survival settings."}
{"id": "2509.02940", "pdf": "https://arxiv.org/pdf/2509.02940", "abs": "https://arxiv.org/abs/2509.02940", "authors": ["Brittany A. Laing", "M. Gabriela Mángano", "Luis A. Buatois", "Glenn A. Brock", "Romain Gougeon", "Zoe Vestrum", "Luke C. Strotz", "Lyndon Koens"], "title": "Remember when? Deciphering Ediacaran-Cambrian Metazoan behaviour and temporal memory using fossil movement paths", "categories": ["physics.bio-ph", "q-bio.PE", "q-bio.QM"], "comment": null, "summary": "Evaluating the timing and trajectory of sensory system innovations is crucial\nfor understanding the increase in phylogenetic, behavioural, and ecological\ndiversity during the Ediacaran-Cambrian transition. Elucidation of sensory\nadaptations has relied on either body-fossil evidence based on anatomical\nfeatures or qualitative descriptions of trace-fossil morphology, leaving a gap\nin the record of sensory system innovations between the development of basic\nsensory capacities and that of more advanced sensory organs and brains. Here,\nwe examine fossil movement trajectories of Ediacaran and Cambrian grazers for\nthe presence of autocorrelation. Our analysis reveals a lack of temporal\ncorrelation in the studied Ediacaran trajectories and its presence in both\nanalysed Cambrian trajectories, indicating time-tuned behaviours were in place\nby the early Cambrian. These results support the Cambrian Information\nRevolution hypothesis and indicates that increases in cognitive complexity and\nbehavioural strategies were yet another important evolutionary innovation that\noccurred during the Ediacaran Cambrian transition."}
{"id": "2509.03336", "pdf": "https://arxiv.org/pdf/2509.03336", "abs": "https://arxiv.org/abs/2509.03336", "authors": ["Sharanya Manoharan", "Balu Bhasuran", "Oviya Ramalakshmi Iyyappan", "Mohamed Saleem Abdul Shukkoor", "Malathi Sellapan", "Kalpana Raja"], "title": "AI-Driven Drug Repurposing through miRNA-mRNA Relation", "categories": ["q-bio.MN", "cs.IR", "q-bio.QM"], "comment": null, "summary": "miRNA mRNA relations are closely linked to several biological processes and\ndisease mechanisms In a recent study we tested the performance of large\nlanguage models LLMs on extracting miRNA mRNA relations from PubMed PubMedBERT\nachieved the best performance of 0.783 F1 score for miRNA mRNA Interaction\nCorpus MMIC Here we first applied the finetuned PubMedBERT model to extract\nmiRNA mRNA relations from PubMed for chronic obstructive pulmonary disease COPD\nAlzheimers disease AD stroke type 2 diabetes mellitus T2DM chronic liver\ndisease and cancer Next we retrieved miRNA drug relations using KinderMiner a\nliterature mining tool for relation extraction Then we constructed three\ninteraction networks 1 disease centric network 2 drug centric network and 3\nmiRNA centric network comprising 3497 nodes and 16417 edges organized as a\ndirected graph to capture complex biological relationships Finally we validated\nthe drugs using MIMIC IV Our integrative approach revealed both established and\nnovel candidate drugs for diseases under study through 595 miRNA drug relations\nextracted from PubMed To the best of our knowledge this is the first study to\nsystematically extract and visualize relationships among four distinct\nbiomedical entities miRNA mRNA drug and disease"}
{"id": "2509.03351", "pdf": "https://arxiv.org/pdf/2509.03351", "abs": "https://arxiv.org/abs/2509.03351", "authors": ["Natalia Flechas Manrique", "Alberto Martínez", "Elena López-Martínez", "Luc Andrea", "Román Orus", "Aitor Manteca", "Aitziber L. Cortajarena", "Llorenç Espinosa-Portalés"], "title": "epiGPTope: A machine learning-based epitope generator and classifier", "categories": ["cs.LG", "cs.AI", "q-bio.QM"], "comment": "11 pages, 4 figures. Supplementary Information with 5 pages, 4\n  figures", "summary": "Epitopes are short antigenic peptide sequences which are recognized by\nantibodies or immune cell receptors. These are central to the development of\nimmunotherapies, vaccines, and diagnostics. However, the rational design of\nsynthetic epitope libraries is challenging due to the large combinatorial\nsequence space, $20^n$ combinations for linear epitopes of n amino acids,\nmaking screening and testing unfeasible, even with high throughput experimental\ntechniques. In this study, we present a large language model, epiGPTope,\npre-trained on protein data and specifically fine-tuned on linear epitopes,\nwhich for the first time can directly generate novel epitope-like sequences,\nwhich are found to possess statistical properties analogous to the ones of\nknown epitopes. This generative approach can be used to prepare libraries of\nepitope candidate sequences. We further train statistical classifiers to\npredict whether an epitope sequence is of bacterial or viral origin, thus\nnarrowing the candidate library and increasing the likelihood of identifying\nspecific epitopes. We propose that such combination of generative and\npredictive models can be of assistance in epitope discovery. The approach uses\nonly primary amino acid sequences of linear epitopes, bypassing the need for a\ngeometric framework or hand-crafted features of the sequences. By developing a\nmethod to create biologically feasible sequences, we anticipate faster and more\ncost-effective generation and screening of synthetic epitopes, with relevant\napplications in the development of new biotechnologies."}
{"id": "2509.03398", "pdf": "https://arxiv.org/pdf/2509.03398", "abs": "https://arxiv.org/abs/2509.03398", "authors": ["Majid Aalizadeh", "Chinmay Raut", "Ali Tabartehfarahani", "Xudong Fan"], "title": "Machine Learning-Enhanced Colorimetric Sensing: Achieving over 5700-fold Accuracy Improvement via Full-Spectrum Modeling", "categories": ["physics.med-ph", "math-ph", "math.MP", "q-bio.QM"], "comment": "24 pages, 7 figures, 1 table", "summary": "Conventional colorimetric sensing methods typically rely on signal intensity\nat a single wavelength, often selected heuristically based on peak visual\nmodulation. This approach overlooks the structured information embedded in\nfull-spectrum transmission profiles, particularly in intensity-based systems\nwhere linear models may be highly effective. In this study, we experimentally\ndemonstrate that applying a forward feature selection strategy to normalized\ntransmission spectra, combined with linear regression and ten-fold\ncross-validation, yields significant improvements in predictive accuracy. Using\nfood dye dilutions as a model system, the mean squared error was reduced from\nover 22,000 with a single wavelength to 3.87 using twelve selected features,\ncorresponding to a more than 5,700-fold enhancement. These results validate\nthat full-spectrum modeling enables precise concentration prediction without\nrequiring changes to the sensing hardware. The approach is broadly applicable\nto colorimetric assays used in medical diagnostics, environmental monitoring,\nand industrial analysis, offering a scalable pathway to improve sensitivity and\nreliability in existing platforms."}
{"id": "2509.03425", "pdf": "https://arxiv.org/pdf/2509.03425", "abs": "https://arxiv.org/abs/2509.03425", "authors": ["Phuc Pham", "Viet Thanh Duy Nguyen", "Truong-Son Hy"], "title": "LINKER: Learning Interactions Between Functional Groups and Residues With Chemical Knowledge-Enhanced Reasoning and Explainability", "categories": ["cs.LG", "q-bio.QM"], "comment": null, "summary": "Accurate identification of interactions between protein residues and ligand\nfunctional groups is essential to understand molecular recognition and guide\nrational drug design. Existing deep learning approaches for protein-ligand\ninterpretability often rely on 3D structural input or use distance-based\ncontact labels, limiting both their applicability and biological relevance. We\nintroduce LINKER, the first sequence-based model to predict residue-functional\ngroup interactions in terms of biologically defined interaction types, using\nonly protein sequences and the ligand SMILES as input. LINKER is trained with\nstructure-supervised attention, where interaction labels are derived from 3D\nprotein-ligand complexes via functional group-based motif extraction. By\nabstracting ligand structures into functional groups, the model focuses on\nchemically meaningful substructures while predicting interaction types rather\nthan mere spatial proximity. Crucially, LINKER requires only sequence-level\ninput at inference time, enabling large-scale application in settings where\nstructural data is unavailable. Experiments on the LP-PDBBind benchmark\ndemonstrate that structure-informed supervision over functional group\nabstractions yields interaction predictions closely aligned with ground-truth\nbiochemical annotations."}
{"id": "2509.03487", "pdf": "https://arxiv.org/pdf/2509.03487", "abs": "https://arxiv.org/abs/2509.03487", "authors": ["Jigang Fan", "Zhenghong Zhou", "Ruofan Jin", "Le Cong", "Mengdi Wang", "Zaixi Zhang"], "title": "SafeProtein: Red-Teaming Framework and Benchmark for Protein Foundation Models", "categories": ["cs.LG", "cs.AI", "cs.CR", "q-bio.BM", "q-bio.QM"], "comment": null, "summary": "Proteins play crucial roles in almost all biological processes. The\nadvancement of deep learning has greatly accelerated the development of protein\nfoundation models, leading to significant successes in protein understanding\nand design. However, the lack of systematic red-teaming for these models has\nraised serious concerns about their potential misuse, such as generating\nproteins with biological safety risks. This paper introduces SafeProtein, the\nfirst red-teaming framework designed for protein foundation models to the best\nof our knowledge. SafeProtein combines multimodal prompt engineering and\nheuristic beam search to systematically design red-teaming methods and conduct\ntests on protein foundation models. We also curated SafeProtein-Bench, which\nincludes a manually constructed red-teaming benchmark dataset and a\ncomprehensive evaluation protocol. SafeProtein achieved continuous jailbreaks\non state-of-the-art protein foundation models (up to 70% attack success rate\nfor ESM3), revealing potential biological safety risks in current protein\nfoundation models and providing insights for the development of robust security\nprotection technologies for frontier models. The codes will be made publicly\navailable at https://github.com/jigang-fan/SafeProtein."}
