{"id": "2506.09053", "pdf": "https://arxiv.org/pdf/2506.09053", "abs": "https://arxiv.org/abs/2506.09053", "authors": ["Marlis Ontivero-Ortega", "Gorana Mijatovic", "Luca Faes", "Daniele Marinazzo", "Sebastiano Stramaglia"], "title": "Localizing synergies of hidden factors across complex systems: resting brain networks and HeLa gene expression profile as case studies", "categories": ["q-bio.QM", "physics.data-an"], "comment": "11 pages, 3 figures", "summary": "Factor analysis is a well-known statistical method to describe the\nvariability of observed variables in terms of a smaller number of unobserved\nlatent variables called factors. Even though latent factors are conceptually\nindependent of each other, their influence on the observed variables is often\njoint and synergistic. We propose to quantify the synergy of the joint\ninfluence of factors on the observed variables using the O-information, a\nrecently introduced metrics to assess high order dependencies in complex\nsystems, in a new framework where latent factors and observed variables are\njointly analyzed in terms of their joint informational character. Two case\nstudies are reported: analyzing resting fMRI data, we find that DMN and FP\nnetworks show the highest synergy, consistently with their crucial role in\nhigher cognitive functions; concerning HeLa cells, we find that the most\nsynergistic gene is STK-12 (AURKB), suggesting that this gene is involved in\ncontrolling the HeLa cell cycle. We believe that this approach, representing a\nbridge between factor analysis and the field of high-order interactions, will\nfind wide application across several domains."}
{"id": "2506.09063", "pdf": "https://arxiv.org/pdf/2506.09063", "abs": "https://arxiv.org/abs/2506.09063", "authors": ["Shayan Shekarforoush", "David B. Lindell", "Marcus A. Brubaker", "David J. Fleet"], "title": "Reconstructing Heterogeneous Biomolecules via Hierarchical Gaussian Mixtures and Part Discovery", "categories": ["q-bio.QM", "cs.CV", "cs.LG", "eess.IV"], "comment": "21 pages, 14 figures, Project Webpage:\n  https://shekshaa.github.io/CryoSPIRE", "summary": "Cryo-EM is a transformational paradigm in molecular biology where\ncomputational methods are used to infer 3D molecular structure at atomic\nresolution from extremely noisy 2D electron microscope images. At the forefront\nof research is how to model the structure when the imaged particles exhibit\nnon-rigid conformational flexibility and compositional variation where parts\nare sometimes missing. We introduce a novel 3D reconstruction framework with a\nhierarchical Gaussian mixture model, inspired in part by Gaussian Splatting for\n4D scene reconstruction. In particular, the structure of the model is grounded\nin an initial process that infers a part-based segmentation of the particle,\nproviding essential inductive bias in order to handle both conformational and\ncompositional variability. The framework, called CryoSPIRE, is shown to reveal\nbiologically meaningful structures on complex experimental datasets, and\nestablishes a new state-of-the-art on CryoBench, a benchmark for cryo-EM\nheterogeneity methods."}
{"id": "2506.09097", "pdf": "https://arxiv.org/pdf/2506.09097", "abs": "https://arxiv.org/abs/2506.09097", "authors": ["Rémi Vaucher", "Stéphane Chrétien"], "title": "Detecting malignant dynamics on very few blood sample using signature coefficients", "categories": ["q-bio.QM", "cs.LG", "stat.ML"], "comment": "Under review", "summary": "Recent discoveries have suggested that the promising avenue of using\ncirculating tumor DNA (ctDNA) levels in blood samples provides reasonable\naccuracy for cancer monitoring, with extremely low burden on the patient's\nside. It is known that the presence of ctDNA can result from various mechanisms\nleading to DNA release from cells, such as apoptosis, necrosis or active\nsecretion. One key idea in recent cancer monitoring studies is that monitoring\nthe dynamics of ctDNA levels might be sufficient for early multi-cancer\ndetection. This interesting idea has been turned into commercial products, e.g.\nin the company named GRAIL.\n  In the present work, we propose to explore the use of Signature theory for\ndetecting aggressive cancer tumors based on the analysis of blood samples. Our\napproach combines tools from continuous time Markov modelling for the dynamics\nof ctDNA levels in the blood, with Signature theory for building efficient\ntesting procedures. Signature theory is a topic of growing interest in the\nMachine Learning community (see Chevyrev2016 and Fermanian2021), which is now\nrecognised as a powerful feature extraction tool for irregularly sampled\nsignals. The method proposed in the present paper is shown to correctly address\nthe challenging problem of overcoming the inherent data scarsity due to the\nextremely small number of blood samples per patient. The relevance of our\napproach is illustrated with extensive numerical experiments that confirm the\nefficiency of the proposed pipeline."}
{"id": "2506.09374", "pdf": "https://arxiv.org/pdf/2506.09374", "abs": "https://arxiv.org/abs/2506.09374", "authors": ["Pedro Pessoa", "Juan Andres Martinez", "Vincent Vandenbroucke", "Frank Delvigne", "Steve Pressé"], "title": "Simulation-trained conditional normalizing flows for likelihood approximation: a case study in stress regulation kinetics in yeast", "categories": ["q-bio.QM", "physics.data-an", "stat.AP", "stat.ML"], "comment": null, "summary": "Physics-inspired inference often hinges on the ability to construct a\nlikelihood, or the probability of observing a sequence of data given a model.\nThese likelihoods can be directly maximized for parameter estimation,\nincorporated into Bayesian frameworks, or even used as loss functions in neural\nnetworks. Yet, many models, despite being conceptually simple, lack tractable\nlikelihoods. A notable example arises in estimating protein production from\nsnapshot measurements of actively dividing cells. Here, the challenge stems\nfrom cell divisions occurring at non-Exponentially distributed intervals with\neach division stochastically partitioning protein content between daughter\ncells, making protein counts in any given cell a function of its full division\nhistory. Such history dependence precludes a straightforward likelihood based\non a (standard Markovian) master equation. Instead, we employ conditional\nnormalizing flows (a class of neural network models designed to learn\nprobability distributions) to approximate otherwise intractable likelihoods\nfrom simulated data. As a case study, we examine activation of the \\emph{glc3}\ngene in yeast involved in glycogen synthesis and expressed under\nnutrient-limiting conditions. We monitor this activity using snapshot\nfluorescence measurements via flow cytometry, where GFP expression reflects\n\\emph{glc3} promoter activity. A na\\\"ive analysis of flow cytometry data\nignoring cell division suggests many cells are active with low expression.\nHowever, fluorescent proteins persist and can be inherited, so cells may appear\nactive from retaining ancestral fluorescence. Explicitly accounting for the\n(non-Markovian) effects of cell division reveals \\emph{glc3} is mostly inactive\nunder stress, showing that while cells occasionally activate it, expression is\nbrief and transient."}
{"id": "2506.09442", "pdf": "https://arxiv.org/pdf/2506.09442", "abs": "https://arxiv.org/abs/2506.09442", "authors": ["Andreas Solheim", "Geir Ringstand", "Per Kristian Eide", "Kent-Andre Mardal"], "title": "Geometry Reduced Order Modeling (GROM) with application to modeling of glymphatic function", "categories": ["q-bio.QM"], "comment": "21 pages, 8 figures", "summary": "Computational modeling of the brain has become a key part of understanding\nhow the brain clears metabolic waste, but patient-specific modeling on a\nsignificant scale is still out of reach with current methods. We introduce a\nnovel approach for leveraging model order reduction techniques in computational\nmodels of brain geometries to alleviate computational costs involved in\nnumerical simulations. Using image registration methods based on magnetic\nresonance imaging, we compute inter-brain mappings which allow previously\ncomputed solutions on other geometries to be mapped on to a new geometry. We\ninvestigate this approach on two example problems typical of modeling of\nglymphatic function, applied to a dataset of 101 MRI of human patients. We\ndiscuss the applicability of the method when applied to a patient with no known\nneurological disease, as well as a patient diagnosed with idiopathic Normal\nPressure Hydrocephalus displaying significantly enlarged ventricles"}
{"id": "2506.09604", "pdf": "https://arxiv.org/pdf/2506.09604", "abs": "https://arxiv.org/abs/2506.09604", "authors": ["M. A. Gameiro", "R. F. Pinto", "N. V. Lopes"], "title": "Image-Based Biospeckle Contrast Analysis for Rapid Antimicrobial Susceptibility Testing", "categories": ["q-bio.QM"], "comment": null, "summary": "Purpose: Antimicrobial resistance is a major global health concern, affecting\nhospital admissions and treatment success. This study aims to introduce an\nexperimental setup for monitoring bacterial activity over time using\nimage-based contrast as a key biomarker. Methods: The proposed method captures\nchanges in bacterial activity by analyzing variations in image contrast. The\napproach is evaluated for its ability to detect antimicrobial effects over\nshorter time intervals compared to conventional clinical techniques. Results:\nThe findings reveal a progressive decrease in contrast over time, suggesting\nits potential as an indicator of antimicrobial activity. The results highlight\nthe method's capability for early detection of bacterial susceptibility.\nConclusion: The study demonstrates that image-based contrast analysis can serve\nas a rapid and reliable tool for antimicrobial susceptibility testing, offering\nadvantages over traditional methods in clinical practice."}
{"id": "2506.09751", "pdf": "https://arxiv.org/pdf/2506.09751", "abs": "https://arxiv.org/abs/2506.09751", "authors": ["Ana Carmen Navas-Ortega", "José Antonio Sánchez-Martínez", "Paula García-Flores", "Concepción Morales-García", "Rene Fabregas"], "title": "Data-Driven Modeling of IRCU Patient Flow in the COVID-19 Pandemic", "categories": ["q-bio.QM", "92C50, 92D30, 92B05, 34C60, 62P10, 37N25"], "comment": "Analysis of clinical outcomes and data-driven modeling of patient\n  flow dynamics in an Intermediate Respiratory Care Unit (IRCU) during the\n  COVID-19 pandemic. Main manuscript: 20 pages, 7 figures. Supplementary\n  Material: 14 pages, 5 figures. Submitted to PLOS ONE", "summary": "Intermediate Respiratory Care Units (IRCUs) are vital during crises like\nCOVID-19. This study evaluated clinical outcomes and operational dynamics of a\nnew Spanish IRCU with specialized staffing. A prospective cohort study\n(April-August 2021) included 249 adult patients with COVID-19 respiratory\nfailure (UHVN IRCU, Granada). Data on demographics, Non-Invasive Ventilation\n(NIV), length of stay (LOS), and outcomes (ICU transfer, exitus, recovery) were\nanalyzed. Patient flow was simulated using a data-calibrated deterministic\ncompartmental model (Ordinary Differential Equations, ODEs) that represented\nstate transitions, and an empirical LOS-based stochastic convolution model that\nincorporated admission variability. The median age was 51; 31% of patients\nrequired NIV. NIV patients were older (median 61 vs 42, p<0.001). Overall, 8%\nneeded ICU transfer; 3% experienced in-IRCU exitus. Notably, no ICU transfers\nor deaths occurred among 172 non-NIV patients. Of 77 high-risk NIV patients,\n68% recovered in IRCU without ICU escalation. The ODE model, based on\ntransition rates between patient states, reflected aggregate outcomes. Both\nmodeling approaches demonstrated system strain during admission surges\n(partially mitigated by simulated care efficiency improvements via parameter\nmodulation) and yielded consistent peak occupancy estimates. This IRCU, with\nspecialized staffing, effectively managed severe COVID-19. High recovery rates,\nespecially for NIV patients, potentially eased ICU pressure. Dynamic modeling\nconfirmed surge vulnerability but highlighted the benefits of care efficiency\nfrom modulated transition parameters. Findings underscore positive outcomes in\nthis IRCU model and support such units in pandemic response."}
{"id": "2506.09007", "pdf": "https://arxiv.org/pdf/2506.09007", "abs": "https://arxiv.org/abs/2506.09007", "authors": ["Sophia Tang", "Yinuo Zhang", "Alexander Tong", "Pranam Chatterjee"], "title": "Branched Schrödinger Bridge Matching", "categories": ["cs.LG", "q-bio.QM"], "comment": null, "summary": "Predicting the intermediate trajectories between an initial and target\ndistribution is a central problem in generative modeling. Existing approaches,\nsuch as flow matching and Schr\\\"odinger Bridge Matching, effectively learn\nmappings between two distributions by modeling a single stochastic path.\nHowever, these methods are inherently limited to unimodal transitions and\ncannot capture branched or divergent evolution from a common origin to multiple\ndistinct outcomes. To address this, we introduce Branched Schr\\\"odinger Bridge\nMatching (BranchSBM), a novel framework that learns branched Schr\\\"odinger\nbridges. BranchSBM parameterizes multiple time-dependent velocity fields and\ngrowth processes, enabling the representation of population-level divergence\ninto multiple terminal distributions. We show that BranchSBM is not only more\nexpressive but also essential for tasks involving multi-path surface\nnavigation, modeling cell fate bifurcations from homogeneous progenitor states,\nand simulating diverging cellular responses to perturbations."}
{"id": "2506.09052", "pdf": "https://arxiv.org/pdf/2506.09052", "abs": "https://arxiv.org/abs/2506.09052", "authors": ["Delower Hossain", "Ehsan Saghapour", "Kevin Song", "Jake Y. Chen"], "title": "Llama-Affinity: A Predictive Antibody Antigen Binding Model Integrating Antibody Sequences with Llama3 Backbone Architecture", "categories": ["cs.LG", "cs.AI", "q-bio.QM"], "comment": "7 Pages", "summary": "Antibody-facilitated immune responses are central to the body's defense\nagainst pathogens, viruses, and other foreign invaders. The ability of\nantibodies to specifically bind and neutralize antigens is vital for\nmaintaining immunity. Over the past few decades, bioengineering advancements\nhave significantly accelerated therapeutic antibody development. These\nantibody-derived drugs have shown remarkable efficacy, particularly in treating\ncancer, SARS-CoV-2, autoimmune disorders, and infectious diseases.\nTraditionally, experimental methods for affinity measurement have been\ntime-consuming and expensive. With the advent of artificial intelligence, in\nsilico medicine has been revolutionized; recent developments in machine\nlearning, particularly the use of large language models (LLMs) for representing\nantibodies, have opened up new avenues for AI-based design and improved\naffinity prediction. Herein, we present an advanced antibody-antigen binding\naffinity prediction model (LlamaAffinity), leveraging an open-source Llama 3\nbackbone and antibody sequence data sourced from the Observed Antibody Space\n(OAS) database. The proposed approach shows significant improvement over\nexisting state-of-the-art (SOTA) methods (AntiFormer, AntiBERTa, AntiBERTy)\nacross multiple evaluation metrics. Specifically, the model achieved an\naccuracy of 0.9640, an F1-score of 0.9643, a precision of 0.9702, a recall of\n0.9586, and an AUC-ROC of 0.9936. Moreover, this strategy unveiled higher\ncomputational efficiency, with a five-fold average cumulative training time of\nonly 0.46 hours, significantly lower than in previous studies."}
{"id": "2506.09167", "pdf": "https://arxiv.org/pdf/2506.09167", "abs": "https://arxiv.org/abs/2506.09167", "authors": ["James R. Williamson", "Andrew Alini", "Brian A. Telfer", "Adam W. Potter", "Karl E. Friedl"], "title": "Estimating Visceral Adiposity from Wrist-Worn Accelerometry", "categories": ["eess.SP", "cs.AI", "q-bio.QM"], "comment": "13 pages", "summary": "Visceral adipose tissue (VAT) is a key marker of both metabolic health and\nhabitual physical activity (PA). Excess VAT is highly correlated with type 2\ndiabetes and insulin resistance. The mechanistic basis for this pathophysiology\nrelates to overloading the liver with fatty acids. VAT is also a highly labile\nfat depot, with increased turnover stimulated by catecholamines during\nexercise. VAT can be measured with sophisticated imaging technologies, but can\nalso be inferred directly from PA. We tested this relationship using National\nHealth and Nutrition Examination Survey (NHANES) data from 2011-2014, for\nindividuals aged 20-60 years with 7 days of accelerometry data (n=2,456 men;\n2,427 women) [1]. Two approaches were used for estimating VAT from activity.\nThe first used engineered features based on movements during gait and sleep,\nand then ridge regression to map summary statistics of these features into a\nVAT estimate. The second approach used deep neural networks trained on 24 hours\nof continuous accelerometry. A foundation model first mapped each 10s frame\ninto a high-dimensional feature vector. A transformer model then mapped each\nday's feature vector time series into a VAT estimate, which were averaged over\nmultiple days. For both approaches, the most accurate estimates were obtained\nwith the addition of covariate information about subject demographics and body\nmeasurements. The best performance was obtained by combining the two\napproaches, resulting in VAT estimates with correlations of r=0.86. These\nfindings demonstrate a strong relationship between PA and VAT and, by\nextension, between PA and metabolic health risks."}
