{"id": "2511.20723", "pdf": "https://arxiv.org/pdf/2511.20723", "abs": "https://arxiv.org/abs/2511.20723", "authors": ["George Ruck", "Jean-Baptiste Aubin", "Alexandre Delétang", "Didier Neuzeret", "Olivier Geffard", "Arnaud Chaumot"], "title": "Multivariate Functional Data Analysis Uncovers Behavioral Fingerprints in Invertebrate Locomotor Response to Micropollutants", "categories": ["q-bio.QM"], "comment": null, "summary": "The need for effective biomonitoring in wastewater has become clear due to the impracticality of continuously tracking all chemicals and emerging contaminants in the aquatic exposome. Effect-based biomonitoring provides a cost-effective solution. The ToxMate device, which uses videotracking of locomotor behavior in aquatic invertebrates, has proven efficient for real-time detection of micropollutant surges in effluents. To extend the approach, this proof-of-concept study evaluates the potential to formalize behavioral fingerprints from real-time videotracking data to characterize qualitative variations in effluent contamination. We present the first application of a functional data analysis (FDA) framework in ecotoxicology. Data were obtained by simultaneously tracking three sentinel organisms from distinct taxa (a crustacean, an annelid, and a gastropod) during pulse exposures to four chemicals in the laboratory (two metals, one pharmaceutical, and one insecticide). Individual and multispecies responses were analy-zed to determine whether combining species enhances the resolution of contamination fingerprints through multidimensional FDA. Applying the same data-driven approach to field data from a wastewater treatment plant (WWTP) revealed four recurring types of micropollution events. This proof of concept demonstrates the potential of behavioral fingerprints to improve wastewater monitoring and reduce pollutant transfer to the environment."}
{"id": "2511.20734", "pdf": "https://arxiv.org/pdf/2511.20734", "abs": "https://arxiv.org/abs/2511.20734", "authors": ["Youssef Megahed", "Saleh Abou-Alwan", "Anthony Fuller", "Dina El Demellawy", "Steven Hawken", "Adrian D. C. Chan"], "title": "Automated Histopathologic Assessment of Hirschsprung Disease Using a Multi-Stage Vision Transformer Framework", "categories": ["q-bio.QM", "cs.CV", "eess.IV"], "comment": "16 pages, 8 figures, 6 tables", "summary": "Hirschsprung Disease is characterized by the absence of ganglion cells in the myenteric plexus. Therefore, their correct identification is crucial for diagnosing Hirschsprung disease. We introduce a three-stage segmentation framework based on a Vision Transformer (ViT-B/16) that mimics the pathologist's diagnostic approach. The framework sequentially segments the muscularis propria, delineates the myenteric plexus, and identifies ganglion cells within anatomically valid regions. 30 whole-slide images of colon tissue were used, each containing expert manual annotations of muscularis, plexus, and ganglion cells at varying levels of certainty. A 5-fold cross-validation scheme was applied to each stage, along with resolution-specific tiling strategies and tailored postprocessing to ensure anatomical consistency. The proposed method achieved a Dice coefficient of 89.9% and a Plexus Inclusion Rate of 100% for muscularis segmentation. Plexus segmentation reached a recall of 94.8%, a precision of 84.2% and a Ganglia Inclusion Rate of 99.7%. For high-certainty ganglion cells, the model achieved 62.1% precision and 89.1% recall, while joint certainty scores yielded 67.0% precision. These results indicate that ViT-based models are effective at leveraging global tissue context and capturing cellular morphology at small scales, even within complex histological tissue structures. This multi-stage methodology has great potential to support digital pathology workflows by reducing inter-observer variability and assisting in the evaluation of Hirschsprung disease. The clinical impact will be evaluated in future work with larger multi-center datasets and additional expert annotations."}
{"id": "2511.20819", "pdf": "https://arxiv.org/pdf/2511.20819", "abs": "https://arxiv.org/abs/2511.20819", "authors": ["Cyril Geismar", "Peter J. White", "Anne Cori", "Thibaut Jombar"], "title": "A statistical framework for comparing epidemic forests", "categories": ["q-bio.QM", "stat.AP", "stat.ME"], "comment": "36 pages (19 pages main text only), 3 figures 1 Table (main text only)", "summary": "Inferring who infected whom in an outbreak is essential for characterising transmission dynamics and guiding public health interventions. However, this task is challenging due to limited surveillance data and the complexity of immunological and social interactions. Instead of a single definitive transmission tree, epidemiologists often consider multiple plausible trees forming \\textit{epidemic forests}. Various inference methods and assumptions can yield different epidemic forests, yet no formal test exists to assess whether these differences are statistically significant. We propose such a framework using a chi-square test and permutational multivariate analysis of variance (PERMANOVA). We assessed each method's ability to distinguish simulated epidemic forests generated under different offspring distributions. While both methods achieved perfect specificity for forests with 100+ trees, PERMANOVA consistently outperformed the chi-square test in sensitivity across all epidemic and forest sizes. Implemented in the R package \\textit{mixtree}, we provide the first statistical framework to robustly compare epidemic forests."}
{"id": "2511.20950", "pdf": "https://arxiv.org/pdf/2511.20950", "abs": "https://arxiv.org/abs/2511.20950", "authors": ["Yaoyue Wang", "Arian Ashourvan", "Guilherme Ramos", "Paul Bogdan", "Emily Pereira"], "title": "Stabilizing Fractional Dynamical Networks Suppresses Epileptic Seizures", "categories": ["q-bio.QM", "q-bio.NC"], "comment": "29 pages, 15 figures", "summary": "Medically uncontrolled epileptic seizures affect nearly 15 million people worldwide, resulting in enormous economic and psychological burdens. Treatment of medically refractory epilepsy is essential for patients to achieve remission, improve psychological functioning, and enhance social and vocational outcomes. Here, we show a state-of-the-art method that stabilizes fractional dynamical networks modeled from intracranial EEG data, effectively suppressing seizure activity in 34 out of 35 total spontaneous episodes from patients at the University of Pennsylvania and the Mayo Clinic. We perform a multi-scale analysis and show that the fractal behavior and stability properties of these data distinguish between four epileptic states: interictal, pre-ictal, ictal, and post-ictal. Furthermore, the simulated controlled signals exhibit substantial amplitude reduction ($49\\%$ average). These findings highlight the potential of fractional dynamics to characterize seizure-related brain states and demonstrate its capability to suppress epileptic activity."}
{"id": "2511.20727", "pdf": "https://arxiv.org/pdf/2511.20727", "abs": "https://arxiv.org/abs/2511.20727", "authors": ["Margot Celerie", "Andrew Oldfield", "William Ritchie"], "title": "SeqManager: A Web-Based Tool for Efficient Sequencing Data Storage Management and Duplicate Detection", "categories": ["q-bio.GN"], "comment": null, "summary": "Motivation: Modern genomics laboratories generate massive volumes of sequencing data, often resulting in significant storage costs. Genomics storage consists of duplicate files, temporary processing files, and redundant intermediate data. Results: We developed SeqManager, a web-based application that provides automated identification, classification, and management of sequencing data files with intelligent duplicate detection. It also detects intermediate sequencing files that can safely be removed. Evaluation across four genomics laboratory settings demonstrate that our tool is fast and has a very low memory footprint."}
{"id": "2511.21614", "pdf": "https://arxiv.org/pdf/2511.21614", "abs": "https://arxiv.org/abs/2511.21614", "authors": ["Ahmad Shamail", "Claire D. McWhite"], "title": "Automated Protein Motif Localization using Concept Activation Vectors in Protein Language Model Embedding Space", "categories": ["q-bio.QM"], "comment": null, "summary": "We present an automated approach for identifying and annotating motifs and domains in protein sequences, using pretrained Protein Language Models (PLMs) and Concept Activation Vectors (CAVs), adapted from interpretability research in computer vision. We treat motifs as conceptual entities and represent them through learned CAVs in PLM embedding space by training simple linear classifiers to distinguish motif-containing from non-motif sequences. To identify motif occurrences, we extract embeddings for overlapping sequence windows and compute their inner products with motif CAVs. This scoring mechanism quantifies how strongly each sequence region expresses the motif concept and naturally detects multiple instances of the same motif within the same protein. Using a dataset of sixty-nine well-characterized motifs with curated positive and negative examples, our method achieves over 85\\% F1 Score for segments strongly expressing the concept and accurately localizes motif positions across diverse protein families. As each motif is encoded by a single vector, motif detection requires only the pretrained PLM and a lightweight dictionary of CAVs, offering a scalable, interpretable, and computationally efficient framework for automated sequence annotation."}
{"id": "2511.21124", "pdf": "https://arxiv.org/pdf/2511.21124", "abs": "https://arxiv.org/abs/2511.21124", "authors": ["Patrick Fournier", "Fabrice Larribe"], "title": "Moonshine.jl: a Julia package for genome-scale model-based ancestral recombination graph inference", "categories": ["q-bio.GN"], "comment": null, "summary": "The ancestral recombination graph (ARG) is the model of choice in statistical genetics to model population ancestries. Software capable of simulating ARGs on a genome scale within a reasonable amount of time are now widely available for most practical use cases. While the inverse problem of inferring ancestries from a sample of haplotypes has seen major progress in the last decade, it does not enjoy the same level of advancement as its counterpart. Up until recently, even moderately sized samples could only be handled using heuristics. In recent years, the possibility of model-based inference for datasets closer to \"real world\" scenarios has become a reality, largely due to the development of threading-based samplers. This article introduces Moonshine.jl, a Julia package that has the ability, among other things, to infer ARGs for samples of thousands of human haplotypes of sizes on the order of hundreds of megabases within a reasonable amount of time. On recent hardware, our package is able to infer an ARG for samples of densely haplotyped (over one marker/kilobase) human chromosomes of sizes up to 10000 in well under a day on data simulated by msprime. Scaling up simulation on a compute cluster is straightforward thanks to a strictly single-threaded implementation. While model-based, it does not resort to threading but rather places restrictions on probability distributions typically used in simulation software in order to enforce sample consistency. In addition to being efficient, a strong emphasis is placed on ease of use and integration into the biostatistical software ecosystem."}
{"id": "2511.20890", "pdf": "https://arxiv.org/pdf/2511.20890", "abs": "https://arxiv.org/abs/2511.20890", "authors": ["Ilyas Djafer-Cherif", "Bartlomiej Waclaw"], "title": "A software-based focus system for wide-field optical microscopy", "categories": ["physics.bio-ph", "q-bio.QM"], "comment": "28 pages, 11 figures, methods paper", "summary": "Long-term time-lapse imaging of biological samples requires correcting for focal drift, which would otherwise gradually push the sample out of focus. We present a software-based method that eliminates this time-dependent blur using only a motorized Z-drive, with no additional hardware. The method relies on imaging marks made on the side of the coverslip opposite to the sample. We provide a Beanshell script implementation, evaluate its performance across multiple objectives, and benchmark it against a hardware autofocus system, finding comparable results. Finally, we demonstrate its effectiveness in live imaging of growing bacterial colonies."}
