{"id": "2510.24888", "pdf": "https://arxiv.org/pdf/2510.24888", "abs": "https://arxiv.org/abs/2510.24888", "authors": ["Sehi L'Yi", "John Conroy", "Priya Misner", "David Kouřil", "Lisa Choy", "Nezar Abdennur", "Nils Gehlenborg"], "title": "Gosling Designer: a Platform to Democratize Construction and Sharing of Genomics Data Visualization Tools", "categories": ["q-bio.GN"], "comment": null, "summary": "Analysis of genomics data is central to nearly all areas of modern biology.\nDespite significant progress in artificial intelligence (AI) and computational\nmethods, these technologies require significant human oversight to generate\nnovel and reliable biological insights. Consequently, the genomics community\nhas developed a substantial number of diverse visualization approaches and a\nproliferation of tools that biologists rely on in their data analysis\nworkflows. While there are a few commonly used visualization tools for genomics\ndata, many tools target specific use cases for genomics data interpretation and\noffer only a limited, predefined set of visualization types. Moreover, static\nvisualizations often fail to support exploratory analysis. Developing\ninteractive visualizations and tools typically requires significant time and\ntechnical expertise, even when supported by modern LLM-powered coding\nassistants, and the resulting visualizations can be difficult to share among\ncollaborators. We developed Gosling Designer, an all-in-one platform for\nediting, exploring, and sharing visualizations of genomics data. Gosling\nDesigner addresses four key challenges observed in existing genomics\nvisualization tools: (1) limited versatility, (2) difficulty of visualization\nauthoring, (3) complexity of data management, and (4) barriers to sharing and\ncollaboration."}
{"id": "2510.24736", "pdf": "https://arxiv.org/pdf/2510.24736", "abs": "https://arxiv.org/abs/2510.24736", "authors": ["Danqi Liao", "Chen Liu", "Xingzhi Sun", "Dié Tang", "Haochen Wang", "Scott Youlten", "Srikar Krishna Gopinath", "Haejeong Lee", "Ethan C. Strayer", "Antonio J. Giraldez", "Smita Krishnaswamy"], "title": "RNAGenScape: Property-guided Optimization and Interpolation of mRNA Sequences with Manifold Langevin Dynamics", "categories": ["q-bio.QM"], "comment": "ICML 2025 Generative AI and Biology (GenBio) Workshop, Oral\n  presentation (top 9.7%)", "summary": "mRNA design and optimization are important in synthetic biology and\ntherapeutic development, but remain understudied in machine learning.\nSystematic optimization of mRNAs is hindered by the scarce and imbalanced data\nas well as complex sequence-function relationships. We present RNAGenScape, a\nproperty-guided manifold Langevin dynamics framework that iteratively updates\nmRNA sequences within a learned latent manifold. RNAGenScape combines an\norganized autoencoder, which structures the latent space by target properties\nfor efficient and biologically plausible exploration, with a manifold projector\nthat contracts each step of update back to the manifold. RNAGenScape supports\nproperty-guided optimization and smooth interpolation between sequences, while\nremaining robust under scarce and undersampled data, and ensuring that\nintermediate products are close to the viable mRNA manifold. Across three real\nmRNA datasets, RNAGenScape improves the target properties with high success\nrates and efficiency, outperforming various generative or optimization methods\ndeveloped for proteins or non-biological data. By providing continuous,\ndata-aligned trajectories that reveal how edits influence function, RNAGenScape\nestablishes a scalable paradigm for controllable mRNA design and latent space\nexploration in mRNA sequence modeling."}
{"id": "2510.24805", "pdf": "https://arxiv.org/pdf/2510.24805", "abs": "https://arxiv.org/abs/2510.24805", "authors": ["Alexandre St-Georges", "Gabriel Richard", "Maxime Toussaint", "Christian Thibaudeau", "Etienne Auger", "Étienne Croteau", "Stephen Cunnane", "Roger Lecomte", "Jean-Baptiste Michaud"], "title": "CT-Less Attenuation Correction Using Multiview Ensemble Conditional Diffusion Model on High-Resolution Uncorrected PET Images", "categories": ["q-bio.QM", "cs.AI", "cs.CV"], "comment": "This is a preprint and not the final version of this paper", "summary": "Accurate quantification in positron emission tomography (PET) is essential\nfor accurate diagnostic results and effective treatment tracking. A major issue\nencountered in PET imaging is attenuation. Attenuation refers to the diminution\nof photon detected as they traverse biological tissues before reaching\ndetectors. When such corrections are absent or inadequate, this signal\ndegradation can introduce inaccurate quantification, making it difficult to\ndifferentiate benign from malignant conditions, and can potentially lead to\nmisdiagnosis. Typically, this correction is done with co-computed Computed\nTomography (CT) imaging to obtain structural data for calculating photon\nattenuation across the body. However, this methodology subjects patients to\nextra ionizing radiation exposure, suffers from potential spatial\nmisregistration between PET/CT imaging sequences, and demands costly equipment\ninfrastructure. Emerging advances in neural network architectures present an\nalternative approach via synthetic CT image synthesis. Our investigation\nreveals that Conditional Denoising Diffusion Probabilistic Models (DDPMs) can\ngenerate high quality CT images from non attenuation corrected PET images in\norder to correct attenuation. By utilizing all three orthogonal views from\nnon-attenuation-corrected PET images, the DDPM approach combined with ensemble\nvoting generates higher quality pseudo-CT images with reduced artifacts and\nimproved slice-to-slice consistency. Results from a study of 159 head scans\nacquired with the Siemens Biograph Vision PET/CT scanner demonstrate both\nqualitative and quantitative improvements in pseudo-CT generation. The method\nachieved a mean absolute error of 32 $\\pm$ 10.4 HU on the CT images and an\naverage error of (1.48 $\\pm$ 0.68)\\% across all regions of interest when\ncomparing PET images reconstructed using the attenuation map of the generated\npseudo-CT versus the true CT."}
{"id": "2510.24879", "pdf": "https://arxiv.org/pdf/2510.24879", "abs": "https://arxiv.org/abs/2510.24879", "authors": ["Lucas Z. Brito", "Ryan P. Cabeen", "David H. Laidlaw"], "title": "General Microstructure Factor Analysis of Diffusion MRI in Gray-Matter Predicts Cognitive Scores", "categories": ["q-bio.QM", "physics.med-ph"], "comment": "20 pages, 5 figures, 3 tables", "summary": "Diffusion MRI has revealed important insights into white matter\nmicrostructure, but its application to gray matter remains comparatively less\nexplored. Here, we investigate whether global patterns of gray-matter\nmicrostructure can be captured through neurite orientation dispersion and\ndensity imaging (NODDI) and whether such patterns are predictive of cognitive\nperformance. Our findings demonstrate that PCA-based global indicators of\ngray-matter microstructure provide complementary markers of structure-function\nrelationships, extending beyond region-specific analyses. Our results suggest\nthat general microstructure factors may serve as robust, interpretable\nbiomarkers for studying cognition and cortical organization at the population\nlevel. Using diffusion MRI and behavioral data from the Human Connectome\nProject Young Adult study, we derived region-averaged NODDI parameters and\napplied principal component analysis (PCA) to construct general gray-matter\nmicrostructure factors. We found that the factor derived from isotropic volume\nfraction explained substantial inter-individual variability and was\nsignificantly correlated with specific cognitive scores collected from the NIH\nToolbox. In particular, the isotropic volume fraction factor was linked to\nreading and vocabulary performance and to cognitive fluidity."}
{"id": "2510.24987", "pdf": "https://arxiv.org/pdf/2510.24987", "abs": "https://arxiv.org/abs/2510.24987", "authors": ["Jianle Sun", "Chaoqi Liang", "Ran Wei", "Peng Zheng", "Lei Bai", "Wanli Ouyang", "Hongliang Yan", "Peng Ye"], "title": "scMRDR: A scalable and flexible framework for unpaired single-cell multi-omics data integration", "categories": ["q-bio.QM", "cs.LG", "q-bio.GN"], "comment": "Accepted at NeurIPS 2025 (Spotlight)", "summary": "Advances in single-cell sequencing have enabled high-resolution profiling of\ndiverse molecular modalities, while integrating unpaired multi-omics\nsingle-cell data remains challenging. Existing approaches either rely on pair\ninformation or prior correspondences, or require computing a global pairwise\ncoupling matrix, limiting their scalability and flexibility. In this paper, we\nintroduce a scalable and flexible generative framework called single-cell\nMulti-omics Regularized Disentangled Representations (scMRDR) for unpaired\nmulti-omics integration. Specifically, we disentangle each cell's latent\nrepresentations into modality-shared and modality-specific components using a\nwell-designed $\\beta$-VAE architecture, which are augmented with isometric\nregularization to preserve intra-omics biological heterogeneity, adversarial\nobjective to encourage cross-modal alignment, and masked reconstruction loss\nstrategy to address the issue of missing features across modalities. Our method\nachieves excellent performance on benchmark datasets in terms of batch\ncorrection, modality alignment, and biological signal preservation. Crucially,\nit scales effectively to large-level datasets and supports integration of more\nthan two omics, offering a powerful and flexible solution for large-scale\nmulti-omics data integration and downstream biological discovery."}
{"id": "2510.25651", "pdf": "https://arxiv.org/pdf/2510.25651", "abs": "https://arxiv.org/abs/2510.25651", "authors": ["Yucheng Huo", "Kexin Guo", "Massimo Paradiso", "K. Jimmy Hsia"], "title": "Stress distribution in contractile cell monolayers", "categories": ["q-bio.QM"], "comment": null, "summary": "Collective behaviors in cellular systems are regulated not only by\nbiochemical signalling pathways but also by intercellular mechanical forces,\nwhose quantification in contractile monolayers remains poorly understood. Here,\nby integrating traction force microscopy and numerical simulations, we\nreconstruct the stress distribution in C2C12 myoblast monolayers to reveal the\nroles of local mechanical forces in determining the collective cellular\nstructures. We find that contractile monolayers exhibit positive maximum and\nnegative minimum principal stresses, reflecting the intrinsic anisotropy of\nactive tension. Distinct stress patterns emerge around topological defects,\ncoinciding with singularities in cell alignment, density, and morphology,\nindicating a strong coupling between mechanical forces and structural\norganization. Moreover, tensile stresses are preferentially transmitted along\nthe cell elongation axis and compressive stresses transversely, demonstrating\nthat local stress guides cell arrangement. This mechanical guidance appears to\nbe universal among contractile systems, as observed also in bone marrow-derived\nmesenchymal stem cells. Together, our work establishes a quantitative framework\nfor characterizing mechanical anisotropy in active cellular monolayers and\nreveals a general principle of force-structure coupling, providing a physical\nbasis for understanding how mechanics governs myogenesis, morphogenesis, and\ncollective organization in contractile cellular systems."}
{"id": "2510.24955", "pdf": "https://arxiv.org/pdf/2510.24955", "abs": "https://arxiv.org/abs/2510.24955", "authors": ["Aaron I. Plex Sulá", "Krishna Keshav", "Ashish Adhikari", "Romaric A. Mouafo-Tchinda", "Jacobo Robledo", "Stavan Nikhilchandra Shah", "Karen A. Garrett"], "title": "geohabnet: An R package for mapping habitat connectivity for biosecurity and conservation", "categories": ["q-bio.PE", "q-bio.QM"], "comment": null, "summary": "Mapping habitat quality, based on factors like host availability and\nenvironmental suitability, is a common approach to determining which locations\nare important for the spread of a species. Mapping habitat connectivity takes\ngeographic analyses a step further, evaluating the potential roles of locations\nin biological invasions, pandemics, or species conservation. Locations with\nhigh habitat quality may play a minor role in species spread if they are\ngeographically isolated. Yet, a location with lower habitat quality may play a\nmajor role in a species' spread if it acts as a bridge between regions that\nwould otherwise be physically fragmented.\n  Here we introduce the geohabnet R package, which evaluates the potential\nimportance of locations for the spread of species through habitat landscapes.\ngeohabnet incorporates key factors such as dispersal probabilities and habitat\navailability in a network framework, for better understanding habitat\nconnectivity for host-dependent species, such as pathogens, arthropod pests, or\npollinators.\n  geohabnet uses publicly available or user-provided datasets, six network\ncentrality metrics, and a user-selected geographic scale. We provide examples\nusing geohabnet for surveillance prioritization of emerging plant pests in\nAfrica and the Americas. These examples illustrate how users can apply\ngeohabnet for their species of interest and generate maps of the estimated\nimportance of geographic locations for species spread.\n  geohabnet provides a quick, open-source, and reproducible baseline to\nquantify a species' habitat connectivity across a wide range of geographic\nscales and evaluates potential scenarios for the expansion of a species through\nhabitat landscapes. geohabnet supports biosecurity programs, invasion science,\nand conservation biology when prioritizing management efforts for transboundary\npathogens, pests, or endangered species."}
