{"id": "2508.21006", "pdf": "https://arxiv.org/pdf/2508.21006", "abs": "https://arxiv.org/abs/2508.21006", "authors": ["Cody E. FitzGerald", "Shelley Reich", "Victor Agaba", "Arjun Mathur", "Michael S. Werner", "Niall M. Mangan"], "title": "Practical indistinguishability in a gene regulatory network inference problem, a case study", "categories": ["q-bio.MN", "q-bio.QM"], "comment": null, "summary": "Computationally inferring mechanistic insights from typical biological data\nis a challenging pursuit. Even the highest-quality experimental data come with\nchallenges. There are always sources of noise, a limit to how often we can\nmeasure the system, and we can rarely measure all the relevant states that\nparticipate in the underlying complexity. There are usually sources of\nuncertainty in model development, which give rise to multiple competing model\nstructures. To underscore the need for further analysis of structural\nuncertainty in modeling, we use a meta-analysis across six journals covering\nmathematical biology and show that a huge number of models for biological\nsystems are developed each year, but model selection and comparison across\nmodel structures appear to be less common. We walk through a case study\ninvolving inference of regulatory network structure involved in a developmental\ndecision in the nematode, \\textit{Pristonchus pacificus}. We use real\nbiological data and compare across 13,824 models--each corresponding to a\ndifferent regulatory network structure, to determine which regulatory features\nare supported by the data across three experimental conditions. We find that\nthe best-fitting models for each experimental condition share a combination of\nfeatures and identify a regulatory network that is common across the model sets\nfor each condition. This model can describe the data across the experimental\nconditions we considered and exhibits a high degree of positive regulation and\ninterconnectivity between the key regulators, \\textit{eud-1}, $textit{sult-1},\nand \\textit{nhr-40}. While the biological results are specific to the molecular\nbiology of development in \\textit{Pristonchus pacificus}, the general modeling\nframework and underlying challenges we faced doing this analysis are widespread\nacross biology, chemistry, physics, and many other scientific disciplines."}
{"id": "2508.20130", "pdf": "https://arxiv.org/pdf/2508.20130", "abs": "https://arxiv.org/abs/2508.20130", "authors": ["Alireza Abbaszadeh", "Armita Shahlai"], "title": "Artificial Intelligence for CRISPR Guide RNA Design: Explainable Models and Off-Target Safety", "categories": ["q-bio.QM", "cs.AI", "cs.LG"], "comment": "29 pages, 5 figures, 2 tables, 42 cited references", "summary": "CRISPR-based genome editing has revolutionized biotechnology, yet optimizing\nguide RNA (gRNA) design for efficiency and safety remains a critical challenge.\nRecent advances (2020--2025, updated to reflect current year if needed)\ndemonstrate that artificial intelligence (AI), especially deep learning, can\nmarkedly improve the prediction of gRNA on-target activity and identify\noff-target risks. In parallel, emerging explainable AI (XAI) techniques are\nbeginning to illuminate the black-box nature of these models, offering insights\ninto sequence features and genomic contexts that drive Cas enzyme performance.\nHere we review how state-of-the-art machine learning models are enhancing gRNA\ndesign for CRISPR systems, highlight strategies for interpreting model\npredictions, and discuss new developments in off-target prediction and safety\nassessment. We emphasize breakthroughs from top-tier journals that underscore\nan interdisciplinary convergence of AI and genome editing to enable more\nefficient, specific, and clinically viable CRISPR applications."}
{"id": "2508.20150", "pdf": "https://arxiv.org/pdf/2508.20150", "abs": "https://arxiv.org/abs/2508.20150", "authors": ["Jared A Kushner", "Mohit Pandey", "Sandeep", "S Kohli"], "title": "Biomarker Integration and Biosensor Technologies Enabling AI-Driven Insights into Biological Aging", "categories": ["q-bio.QM"], "comment": null, "summary": "As the global population continues to age, there is an increasing demand for\nways to accurately quantify the biological processes underlying aging.\nBiological age, unlike chronological age, reflects an individual's\nphysiological state, offering a more accurate measure of health-span and\nage-related decline. Aging is a complex, multisystem process involving\nmolecular, cellular, and environmental factors and can be quantified using\nvarious biophysical and biochemical markers. This review focuses on four key\nbiochemical markers that have recently been identified by experts as important\noutcome measures in longevity-promoting interventions: C-Reactive Protein,\nInsulin like Growth Factor-1, Interleukin-6, and Growth Differentiation\nFactor-15. With the use of Artificial Intelligence, the analysis and\nintegration of these biomarkers can be significantly enhanced, enabling the\nidentification of complex binding patterns and improving predictive accuracy\nfor biological age estimation and age-related disease risk stratification.\nArtificial intelligence-driven methods including machine learning, deep\nlearning, and multimodal data integration, facilitate the interpretation of\nhigh dimensional datasets and support the development of widely accessible,\ndata-informed tools for health monitoring and disease risk assessment. This\npaves the way for a future medical system, enabling more personalized and\naccessible care, offering deeper, data-driven insights into individual health\ntrajectories, risk profiles, and treatment response. The review additionally\nhighlights the key challenges, and future directions for the implementation of\nartificial intelligence-driven methods in precision aging frameworks."}
{"id": "2508.20218", "pdf": "https://arxiv.org/pdf/2508.20218", "abs": "https://arxiv.org/abs/2508.20218", "authors": ["Luis Hernandez-Garcia", "Alberto L. Vazquez", "Doug C. Noll"], "title": "Velocity Spectrum Imaging using velocity encoding preparation pulses", "categories": ["q-bio.QM", "physics.med-ph"], "comment": "23 pages, 7 figures, submitted for review at Magn. Res. Med , on Aug.\n  2025", "summary": "The movement of water in the human body is a very complex phenomenon\nencompassing both diffusion and convection. These different physical principles\ncoexist within the same voxel with dominant sub-mechanisms within different\nintra-voxel structures. While diffusion imaging techniques can separate\ndiffusion populations, convective flow imaging techniques usually measure an\naverage velocity over the voxel. In this article, we present, test and\nimplement a new technique to measure the velocity distribution of water inside\neach voxel of an MR image. This approach is completely non-invasive and\nrequires no contrast agents. Modified velocity-selective RF pulses can be used\nto encode velocity information analogously to k-space encoding. The velocity\ndistribution can then be decoded via the Fourier transform. This approach\nyields a three-dimensional velocity vector distribution of convective flow in\neach voxel, analogously to Diffusion Tensor Imaging. We present the theoretical\nprinciples of this technique, and demonstrates its use on a simple flow phantom\nwith known flow characteristics. We also demonstrate the technique on human\nparticipants used to collect the velocity distribution along the three\nlaboratory axes, and discusses its challenges and potential applications. In\naddition to a useful tool for validating computational fluid dynamic models in\nvivo, velocity spectrum imaging can be a powerful tool to study the complex\nmovement of water in the glymphatic system and its involvement in\nneurodegenerative disorders."}
{"id": "2508.20219", "pdf": "https://arxiv.org/pdf/2508.20219", "abs": "https://arxiv.org/abs/2508.20219", "authors": ["Stephen Williams", "Daravuth Cheam", "Michele K. Nishiguchi", "Suzanne S. Sindi", "Shilpa Khatri", "Erica M. Rutter"], "title": "Identifiability, Sensitivity, and Genetic Algorithms in Bacterial Biofilm Selection Models", "categories": ["q-bio.QM", "q-bio.PE"], "comment": "24 pages, 7 figures", "summary": "Bacteria often develop distinct phenotypes to adapt to environmental stress.\nIn particular, they can produce biofilms, dense communities of bacteria that\nlive in a complex extracellular matrix. Bacterial biofilms provide a safe haven\nfrom environmental conditions by distributing metabolic workload and allowing\nthem to perform complex multicellular processes. While previous studies have\ninvestigated how bacterial biofilms are regulated under laboratory conditions,\nthey have not considered (1) the data requirements necessary to estimate model\nparameters and (2) how bacteria respond to recurring stressors in their natural\nhabitats. To address (1), we adapted a mechanistic population model to explore\nthe dynamics of biofilm formation in the presence of predator stress, using\nsynthetic data. We used a Maximum Likelihood Estimation framework to measure\ncrucial parameters underpinning the biofilm formation dynamics. We used genetic\nalgorithms to propose an optimal data collection schedule that minimised\nparameter identifiability confidence interval widths. Our sensitivity analysis\nrevealed that we could simplify the binding dynamics and eliminate biofilm\ndetachment. To address (2), we proposed a structured version of our model to\ncapture the long-term behaviour and evolutionary selection. In our extended\nmodel, the subpopulations feature different maximal rates of biofilm formation.\nWe compared the selection under different predator types and amounts and\nidentified key parameters that affected the speed of selection via sensitivity\nanalysis."}
{"id": "2508.20469", "pdf": "https://arxiv.org/pdf/2508.20469", "abs": "https://arxiv.org/abs/2508.20469", "authors": ["Zizhao Tang", "Changhao Liu", "Nuo Tong", "Shuiping Gou", "Mei Shi"], "title": "Prediction of Distant Metastasis for Head and Neck Cancer Patients Using Multi-Modal Tumor and Peritumoral Feature Fusion Network", "categories": ["q-bio.QM", "cs.CV"], "comment": "19 pages, 4 figures, 5 tables. Zizhao Tang, Changhao Liu, and Nuo\n  Tong contributed equally. Corresponding Authors: Mei Shi\n  (mshi82@fmmu.edu.cn), Shuiping Gou (shpgou@mail.xidian.edu.cn)", "summary": "Metastasis remains the major challenge in the clinical management of head and\nneck squamous cell carcinoma (HNSCC). Reliable pre-treatment prediction of\nmetastatic risk is crucial for optimizing treatment strategies and prognosis.\nThis study develops a deep learning-based multimodal framework to predict\nmetastasis risk in HNSCC patients by integrating computed tomography (CT)\nimages, radiomics, and clinical data. 1497 HNSCC patients were included. Tumor\nand organ masks were derived from pretreatment CT images. A 3D Swin Transformer\nextracted deep features from tumor regions. Meanwhile, 1562 radiomics features\nwere obtained using PyRadiomics, followed by correlation filtering and random\nforest selection, leaving 36 features. Clinical variables including age, sex,\nsmoking, and alcohol status were encoded and fused with imaging-derived\nfeatures. Multimodal features were fed into a fully connected network to\npredict metastasis risk. Performance was evaluated using five-fold\ncross-validation with area under the curve (AUC), accuracy (ACC), sensitivity\n(SEN), and specificity (SPE). The proposed fusion model outperformed\nsingle-modality models. The 3D deep learning module alone achieved an AUC of\n0.715, and when combined with radiomics and clinical features, predictive\nperformance improved (AUC = 0.803, ACC = 0.752, SEN = 0.730, SPE = 0.758).\nStratified analysis showed generalizability across tumor subtypes. Ablation\nstudies indicated complementary information from different modalities.\nEvaluation showed the 3D Swin Transformer provided more robust representation\nlearning than conventional networks. This multimodal fusion model demonstrated\nhigh accuracy and robustness in predicting metastasis risk in HNSCC, offering a\ncomprehensive representation of tumor biology. The interpretable model has\npotential as a clinical decision-support tool for personalized treatment\nplanning."}
{"id": "2508.20833", "pdf": "https://arxiv.org/pdf/2508.20833", "abs": "https://arxiv.org/abs/2508.20833", "authors": ["Anthony Kwong", "Mark Muldoon"], "title": "Modelling birdsong transmission with methods from molecular sequence analysis", "categories": ["q-bio.QM", "stat.CO"], "comment": "34 pages, 13 figures", "summary": "In many species of songbirds, juvenile males learn their songs from adult\nmale tutors. In this paper we formulate a novel Markov model for birdsong\ntransmission developed by analogy with models used in biological sequence\nanalysis. We fit the model using the recently developed Interacting Particle\nLangevin Algorithm (IPLA) of Akyildiz et al. (arXiv:2303.13429) and analyse a\ncollection of songs from Java sparrows (Lonchura oryzivora) originally recorded\nand studied by Masayo Soma and her collaborators. The model proves to have\nlimited predictive power for a number of natural problems associated with song\ntransmission in Java sparrows and we propose reasons for this, including the\nwell-established faithfulness of song-learning and the comparative brevity of\nJava sparrow songs."}
{"id": "2508.20275", "pdf": "https://arxiv.org/pdf/2508.20275", "abs": "https://arxiv.org/abs/2508.20275", "authors": ["Anton Changalidis", "Yury Barbitoff", "Yulia Nasykhova", "Andrey Glotov"], "title": "A Systematic Review on the Generative AI Applications in Human Medical Genomics", "categories": ["cs.LG", "cs.CL", "q-bio.QM"], "comment": "31 pages, 5 figures", "summary": "Although traditional statistical techniques and machine learning methods have\ncontributed significantly to genetics and, in particular, inherited disease\ndiagnosis, they often struggle with complex, high-dimensional data, a challenge\nnow addressed by state-of-the-art deep learning models. Large language models\n(LLMs), based on transformer architectures, have excelled in tasks requiring\ncontextual comprehension of unstructured medical data. This systematic review\nexamines the role of LLMs in the genetic research and diagnostics of both rare\nand common diseases. Automated keyword-based search in PubMed, bioRxiv,\nmedRxiv, and arXiv was conducted, targeting studies on LLM applications in\ndiagnostics and education within genetics and removing irrelevant or outdated\nmodels. A total of 172 studies were analyzed, highlighting applications in\ngenomic variant identification, annotation, and interpretation, as well as\nmedical imaging advancements through vision transformers. Key findings indicate\nthat while transformer-based models significantly advance disease and risk\nstratification, variant interpretation, medical imaging analysis, and report\ngeneration, major challenges persist in integrating multimodal data (genomic\nsequences, imaging, and clinical records) into unified and clinically robust\npipelines, facing limitations in generalizability and practical implementation\nin clinical settings. This review provides a comprehensive classification and\nassessment of the current capabilities and limitations of LLMs in transforming\nhereditary disease diagnostics and supporting genetic education, serving as a\nguide to navigate this rapidly evolving field."}
{"id": "2508.20804", "pdf": "https://arxiv.org/pdf/2508.20804", "abs": "https://arxiv.org/abs/2508.20804", "authors": ["Lucas Amoudruz", "Gregory Buti", "Luciano Rivetti", "Ali Ajdari", "Gregory Sharp", "Petros Koumoutsakos", "Simon Spohn", "Anca L Grosu", "Thomas Bortfeld"], "title": "Ising energy model for the stochastic prediction of tumor islets", "categories": ["physics.med-ph", "physics.comp-ph", "q-bio.QM"], "comment": null, "summary": "A major challenge in diagnosing and treating cancer is the infiltrative\ngrowth of tumors into surrounding tissues.\n  This microscopic spread of the disease is invisible on most diagnostic\nimaging modalities and can often only be detected histologically in biopsies.\n  The purpose of this paper is to develop a physically based model of tumor\nspread that captures the histologically observed behavior in terms of seeding\nsmall tumor islets in prostate cancer.\n  The model is based on three elementary events: a tumor cell can move,\nduplicate, or die.\n  The propensity of each event is given by an Ising-like Hamiltonian that\ncaptures correlations between neighboring cells.\n  The model parameters were fitted to clinical data obtained from surgical\nspecimens taken from 23 prostate cancer patients.\n  The results demonstrate that this straightforward physical model effectively\ndescribes the distribution of the size and the number of tumor islets in\nprostate cancer.\n  The simulated tumor islets exhibit a regular, approximately spherical shape,\ncorrectly mimicking the shapes observed in histology.\n  This is due to the Ising interaction term between neighboring cells acting as\na surface tension that gives rise to regularly shaped islets.\n  The model addresses the important clinical need of calculating the\nprobability of tumor involvement in specific sub-volumes of the prostate, which\nis required for radiation treatment planning and other applications."}
{"id": "2508.21006", "pdf": "https://arxiv.org/pdf/2508.21006", "abs": "https://arxiv.org/abs/2508.21006", "authors": ["Cody E. FitzGerald", "Shelley Reich", "Victor Agaba", "Arjun Mathur", "Michael S. Werner", "Niall M. Mangan"], "title": "Practical indistinguishability in a gene regulatory network inference problem, a case study", "categories": ["q-bio.MN", "q-bio.QM"], "comment": null, "summary": "Computationally inferring mechanistic insights from typical biological data\nis a challenging pursuit. Even the highest-quality experimental data come with\nchallenges. There are always sources of noise, a limit to how often we can\nmeasure the system, and we can rarely measure all the relevant states that\nparticipate in the underlying complexity. There are usually sources of\nuncertainty in model development, which give rise to multiple competing model\nstructures. To underscore the need for further analysis of structural\nuncertainty in modeling, we use a meta-analysis across six journals covering\nmathematical biology and show that a huge number of models for biological\nsystems are developed each year, but model selection and comparison across\nmodel structures appear to be less common. We walk through a case study\ninvolving inference of regulatory network structure involved in a developmental\ndecision in the nematode, \\textit{Pristonchus pacificus}. We use real\nbiological data and compare across 13,824 models--each corresponding to a\ndifferent regulatory network structure, to determine which regulatory features\nare supported by the data across three experimental conditions. We find that\nthe best-fitting models for each experimental condition share a combination of\nfeatures and identify a regulatory network that is common across the model sets\nfor each condition. This model can describe the data across the experimental\nconditions we considered and exhibits a high degree of positive regulation and\ninterconnectivity between the key regulators, \\textit{eud-1}, $textit{sult-1},\nand \\textit{nhr-40}. While the biological results are specific to the molecular\nbiology of development in \\textit{Pristonchus pacificus}, the general modeling\nframework and underlying challenges we faced doing this analysis are widespread\nacross biology, chemistry, physics, and many other scientific disciplines."}
