{"id": "2507.05960", "pdf": "https://arxiv.org/pdf/2507.05960", "abs": "https://arxiv.org/abs/2507.05960", "authors": ["Gustavo Mockaitis"], "title": "Mono and Polyauxic Growth Kinetic Models", "categories": ["q-bio.QM", "q-bio.CB", "q-bio.PE", "92C45, 92D25, 62J02", "G.1.6; G.3; I.6.5; J.3"], "comment": "Method paper, 24 pages, 5 figures", "summary": "Accurate modeling of microbial growth curves is essential for understanding\nand optimizing bioprocesses in biotechnology and environmental engineering.\nWhile classical monoauxic models such as Monod, Boltzmann, and Gompertz are\nwidely used, they often lack biological interpretability or fail to capture the\ncomplex, multiphasic growth patterns observed in systems with mixed substrates\nor microbial communities. This paper presents a methodological framework for\nreparametrizing the Boltzmann and Gompertz equations, assigning direct\nbiological significance to each parameter and enabling their application to\nboth monoauxic and polyauxic (multi-phase) growth scenarios. Polyauxic growth\nis modeled as a weighted sum of sigmoidal functions, with constraints for model\nidentifiability and biological plausibility. Robust parameter estimation is\nachieved using a Lorentzian loss function, combined with a global-local\noptimization strategy (Particle Swarm Optimization and Nelder-Mead), and\nsystematic outlier exclusion using the ROUT method. Model parsimony is enforced\nvia established information criteria. This workflow enables reliable,\nreproducible, and interpretable extraction of kinetic parameters from complex\ngrowth data and is broadly applicable to other fields where sigmoidal patterns\nare observed."}
{"id": "2507.05383", "pdf": "https://arxiv.org/pdf/2507.05383", "abs": "https://arxiv.org/abs/2507.05383", "authors": ["Alexandr A. Kalinin", "Paula Llanos", "Theresa Maria Sommer", "Giovanni Sestini", "Xinhai Hou", "Jonathan Z. Sexton", "Xiang Wan", "Ivo D. Dinov", "Brian D. Athey", "Nicolas Rivron", "Anne E. Carpenter", "Beth Cimini", "Shantanu Singh", "Matthew J. O'Meara"], "title": "Foreground-aware Virtual Staining for Accurate 3D Cell Morphological Profiling", "categories": ["cs.CV", "q-bio.QM", "I.4.9; J.3"], "comment": "ICML 2025 Generative AI and Biology (GenBio) Workshop", "summary": "Microscopy enables direct observation of cellular morphology in 3D, with\ntransmitted-light methods offering low-cost, minimally invasive imaging and\nfluorescence microscopy providing specificity and contrast. Virtual staining\ncombines these strengths by using machine learning to predict fluorescence\nimages from label-free inputs. However, training of existing methods typically\nrelies on loss functions that treat all pixels equally, thus reproducing\nbackground noise and artifacts instead of focusing on biologically meaningful\nsignals. We introduce Spotlight, a simple yet powerful virtual staining\napproach that guides the model to focus on relevant cellular structures.\nSpotlight uses histogram-based foreground estimation to mask pixel-wise loss\nand to calculate a Dice loss on soft-thresholded predictions for shape-aware\nlearning. Applied to a 3D benchmark dataset, Spotlight improves morphological\nrepresentation while preserving pixel-level accuracy, resulting in virtual\nstains better suited for downstream tasks such as segmentation and profiling."}
{"id": "2507.05452", "pdf": "https://arxiv.org/pdf/2507.05452", "abs": "https://arxiv.org/abs/2507.05452", "authors": ["Jian Liu", "Li Shen", "Dong Chen", "Guo-Wei Wei"], "title": "Topological Sequence Analysis of Genomes: Delta Complex approaches", "categories": ["math.AT", "q-bio.QM", "Primary 55N31, Secondary 62R40, 68Q07"], "comment": null, "summary": "Algebraic topology has been widely applied to point cloud data to capture\ngeometric shapes and topological structures. However, its application to genome\nsequence analysis remains rare. In this work, we propose topological sequence\nanalysis (TSA) techniques by constructing $\\Delta$-complexes and classifying\nspaces, leading to persistent homology, and persistent path homology on genome\nsequences. We also develop $\\Delta$-complex-based persistent Laplacians to\nfacilitate the topological spectral analysis of genome sequences. Finally, we\ndemonstrate the utility of the proposed TSA approaches in phylogenetic analysis\nusing Ebola virus sequences and whole bacterial genomes. The present TSA\nmethods are more efficient than earlier TSA model, k-mer topology, and thus\nhave a potential to be applied to other time-consuming sequential data\nanalyses, such as those in linguistics, literature, music, media, and social\ncontexts."}
{"id": "2507.05656", "pdf": "https://arxiv.org/pdf/2507.05656", "abs": "https://arxiv.org/abs/2507.05656", "authors": ["Zhiyuan Yang", "Kai Li", "Sophia Ghamoshi Ramandi", "Patricia Brassard", "Hakim Khellaf", "Vincent Quoc-Huy Trinh", "Jennifer Zhang", "Lina Chen", "Corwyn Rowsell", "Sonal Varma", "Kostas Plataniotis", "Mahdi S. Hosseini"], "title": "ADPv2: A Hierarchical Histological Tissue Type-Annotated Dataset for Potential Biomarker Discovery of Colorectal Disease", "categories": ["eess.IV", "cs.CV", "cs.LG", "q-bio.QM", "I.2.10; I.2.1"], "comment": null, "summary": "Computational pathology (CoPath) leverages histopathology images to enhance\ndiagnostic precision and reproducibility in clinical pathology. However,\npublicly available datasets for CoPath that are annotated with extensive\nhistological tissue type (HTT) taxonomies at a granular level remain scarce due\nto the significant expertise and high annotation costs required. Existing\ndatasets, such as the Atlas of Digital Pathology (ADP), address this by\noffering diverse HTT annotations generalized to multiple organs, but limit the\ncapability for in-depth studies on specific organ diseases. Building upon this\nfoundation, we introduce ADPv2, a novel dataset focused on gastrointestinal\nhistopathology. Our dataset comprises 20,004 image patches derived from healthy\ncolon biopsy slides, annotated according to a hierarchical taxonomy of 32\ndistinct HTTs of 3 levels. Furthermore, we train a multilabel representation\nlearning model following a two-stage training procedure on our ADPv2 dataset.\nWe leverage the VMamba architecture and achieving a mean average precision\n(mAP) of 0.88 in multilabel classification of colon HTTs. Finally, we show that\nour dataset is capable of an organ-specific in-depth study for potential\nbiomarker discovery by analyzing the model's prediction behavior on tissues\naffected by different colon diseases, which reveals statistical patterns that\nconfirm the two pathological pathways of colon cancer development. Our dataset\nis publicly available here: Part 1 at https://zenodo.org/records/15307021, Part\n2 at https://zenodo.org/records/15312384 and Part 3 at\nhttps://zenodo.org/records/15312792"}
{"id": "2507.05265", "pdf": "https://arxiv.org/pdf/2507.05265", "abs": "https://arxiv.org/abs/2507.05265", "authors": ["Hongyang Li", "Sanjoy Dey", "Bum Chul Kwon", "Michael Danziger", "Michal Rosen-Tzvi", "Jianying Hu", "James Kozloski", "Ching-Huei Tsou", "Bharath Dandala", "Pablo Meyer"], "title": "BMFM-DNA: A SNP-aware DNA foundation model to capture variant effects", "categories": ["q-bio.GN", "cs.LG"], "comment": null, "summary": "Large language models (LLMs) trained on text demonstrated remarkable results\non natural language processing (NLP) tasks. These models have been adapted to\ndecipher the language of DNA, where sequences of nucleotides act as \"words\"\nthat encode genomic functions. However, the genome differs fundamentally from\nnatural language, as it lacks clearly defined words or a consistent grammar.\nAlthough DNA language models (DNALMs) such as DNABERT, GENA-LM have achieved\nhigh level of performance on genome-related biological tasks, these models do\nnot encode biological functions in the presence of sequence variations. To\naddress this problem, we pre-train foundation models that effectively integrate\nsequence variations, in particular Single Nucleotide Polymorphisms (SNPs), as\nthey underlie important biological functions. Specifically, we use ModernBERT\nto pre-train two different Biomedical Foundation Models (BMFM), namely,\nBMFM-DNA-REF in which the model is trained with sequences of varying lengths\nalong with their reverse complements derived from the reference genome and\nBMFM-DNA-SNP in which the model is trained with sequences created using a novel\nrepresentation scheme that encodes sequence variations. Our findings indicate\nthat integrating sequence variations into DNALMs helps capture the biological\nfunctions as seen in improvements on all fine-tuning tasks. To explore the\nmodel's practical utility, we experimented with various strategies for SNP\nimputation on promoter detection task introduced in DNABERT-2. However, we\nacknowledge that the current benchmarks are limited in their ability to fully\nevaluate these models. To enable more comprehensive assessment in the future\nand encourage community contributions, we release our models through\nHuggingFace and the code to reproduce the results at\nhttps://github.com/BiomedSciAI/biomed-multi-omic"}
{"id": "2507.06113", "pdf": "https://arxiv.org/pdf/2507.06113", "abs": "https://arxiv.org/abs/2507.06113", "authors": ["Seungjun Ahn", "Zhigang Li"], "title": "A Statistical Framework for Co-Mediators of Zero-Inflated Single-Cell RNA-Seq Data", "categories": ["stat.ME", "q-bio.GN", "q-bio.QM", "stat.AP"], "comment": "21 pages and 1 figure. Supplementary materials available upon request", "summary": "Single-cell RNA sequencing (scRNA-seq) has revolutionized the study of\ncellular heterogeneity, enabling detailed molecular profiling at the individual\ncell level. However, integrating high-dimensional single-cell data into causal\nmediation analysis remains challenging due to zero inflation and complex\nmediator structures. We propose a novel mediation framework leveraging\nzero-inflated negative binomial models to characterize cell-level mediator\ndistributions and beta regression for zero-inflation proportions. Subject-level\nmediators are aggregated from cell-level data to perform mediation analysis\nassessing causal pathways linking gene expression to clinical outcomes.\nExtensive simulation studies demonstrate improved power and controlled false\ndiscovery rates. We further illustrate the utility of this approach through\napplication to ROSMAP single-cell transcriptomic data, uncovering biologically\nmeaningful mediation effects that enhance understanding of disease mechanisms."}
{"id": "2507.06113", "pdf": "https://arxiv.org/pdf/2507.06113", "abs": "https://arxiv.org/abs/2507.06113", "authors": ["Seungjun Ahn", "Zhigang Li"], "title": "A Statistical Framework for Co-Mediators of Zero-Inflated Single-Cell RNA-Seq Data", "categories": ["stat.ME", "q-bio.GN", "q-bio.QM", "stat.AP"], "comment": "21 pages and 1 figure. Supplementary materials available upon request", "summary": "Single-cell RNA sequencing (scRNA-seq) has revolutionized the study of\ncellular heterogeneity, enabling detailed molecular profiling at the individual\ncell level. However, integrating high-dimensional single-cell data into causal\nmediation analysis remains challenging due to zero inflation and complex\nmediator structures. We propose a novel mediation framework leveraging\nzero-inflated negative binomial models to characterize cell-level mediator\ndistributions and beta regression for zero-inflation proportions. Subject-level\nmediators are aggregated from cell-level data to perform mediation analysis\nassessing causal pathways linking gene expression to clinical outcomes.\nExtensive simulation studies demonstrate improved power and controlled false\ndiscovery rates. We further illustrate the utility of this approach through\napplication to ROSMAP single-cell transcriptomic data, uncovering biologically\nmeaningful mediation effects that enhance understanding of disease mechanisms."}
{"id": "2507.06136", "pdf": "https://arxiv.org/pdf/2507.06136", "abs": "https://arxiv.org/abs/2507.06136", "authors": ["Sam Frank Kelemen", "Joaquín Gõni", "Sérgio Pequito", "Arian Ashourvan"], "title": "A Linear Generative Framework for Structure-Function Coupling in the Human Brain", "categories": ["q-bio.NC", "q-bio.QM"], "comment": null, "summary": "Brain function emerges from coordinated activity across anatomically\nconnected regions, where structural connectivity (SC) -- the network of white\nmatter pathways - provides the physical substrate for functional connectivity\n(FC) -- the correlated neural activity between brain areas. While these\nstructural and functional networks exhibit substantial overlap, their\nrelationship involves complex, indirect mechanisms, including the dynamic\ninterplay of direct and indirect pathways, recurrent network interactions, and\nneuromodulatory influences. To systematically untangle how structural\narchitecture shapes functional patterns, this work aims to establish a set of\nrules that decode how direct and indirect structural connections and motifs\ngive rise to FC between brain regions. Specifically, using a generative linear\nmodel, we derive explicit rules that predict an individual's resting-state fMRI\nFC from diffusion-weighted imaging (DWI)-derived SC, validated against\ntopological null models. Examining the rules reveals distinct classes of brain\nregions, with integrator hubs acting as structural linchpins promoting\nsynchronization and mediator hubs serving as structural fulcrums orchestrating\ncompeting dynamics. Through virtual lesion experiments, we demonstrate how\ndifferent cortical and subcortical systems distinctively contribute to global\nfunctional organization. Together, this framework disentangles the mechanisms\nby which structural architecture drives functional dynamics, enabling the\nprediction of how pathological or surgical disruptions to brain connectivity\ncascade through functional networks, potentially leading to cognitive and\nbehavioral impairments."}
