{"id": "2509.13376", "pdf": "https://arxiv.org/pdf/2509.13376", "abs": "https://arxiv.org/abs/2509.13376", "authors": ["Zhiwei Fan", "Tiangang Wang", "Kexin Huang", "Binwu Ying", "Xiaobo Zhou"], "title": "Unleashing the power of computational insights in revealing the complexity of biological systems in the new era of spatial multi-omics", "categories": ["q-bio.QM", "cs.LG"], "comment": "43 pages, 9 figures, 1 table", "summary": "Recent advances in spatial omics technologies have revolutionized our ability\nto study biological systems with unprecedented resolution. By preserving the\nspatial context of molecular measurements, these methods enable comprehensive\nmapping of cellular heterogeneity, tissue architecture, and dynamic biological\nprocesses in developmental biology, neuroscience, oncology, and evolutionary\nstudies. This review highlights a systematic overview of the continuous\nadvancements in both technology and computational algorithms that are paving\nthe way for a deeper, more systematic comprehension of the structure and\nmechanisms of mammalian tissues and organs by using spatial multi-omics. Our\nviewpoint demonstrates how advanced machine learning algorithms and multi-omics\nintegrative modeling can decode complex biological processes, including the\nspatial organization and topological relationships of cells during organ\ndevelopment, as well as key molecular signatures and regulatory networks\nunderlying tumorigenesis and metastasis. Finally, we outline future directions\nfor technological innovation and modeling insights of spatial omics in\nprecision medicine."}
{"id": "2509.13360", "pdf": "https://arxiv.org/pdf/2509.13360", "abs": "https://arxiv.org/abs/2509.13360", "authors": ["L. Zimmer", "J. Weidner", "M. Balcerak", "F. Kofler", "I. Ezhov", "B. Menze", "B. Wiestler"], "title": "PREDICT-GBM: Platform for Robust Evaluation and Development of Individualized Computational Tumor Models in Glioblastoma", "categories": ["eess.IV", "cs.CV", "cs.LG", "q-bio.QM"], "comment": null, "summary": "Glioblastoma is the most prevalent primary brain malignancy, distinguished by\nits highly invasive behavior and exceptionally high rates of recurrence.\nConventional radiation therapy, which employs uniform treatment margins, fails\nto account for patient-specific anatomical and biological factors that\ncritically influence tumor cell migration. To address this limitation, numerous\ncomputational models of glioblastoma growth have been developed, enabling\ngeneration of tumor cell distribution maps extending beyond radiographically\nvisible regions and thus informing more precise treatment strategies. However,\ndespite encouraging preliminary findings, the clinical adoption of these growth\nmodels remains limited. To bridge this translational gap and accelerate both\nmodel development and clinical validation, we introduce PREDICT-GBM, a\ncomprehensive integrated pipeline and dataset for modeling and evaluation. This\nplatform enables systematic benchmarking of state-of-the-art tumor growth\nmodels using an expert-curated clinical dataset comprising 255 subjects with\ncomplete tumor segmentations and tissue characterization maps. Our analysis\ndemonstrates that personalized radiation treatment plans derived from tumor\ngrowth predictions achieved superior recurrence coverage compared to\nconventional uniform margin approaches for two of the evaluated models. This\nwork establishes a robust platform for advancing and systematically evaluating\ncutting-edge tumor growth modeling approaches, with the ultimate goal of\nfacilitating clinical translation and improving patient outcomes."}
{"id": "2509.13372", "pdf": "https://arxiv.org/pdf/2509.13372", "abs": "https://arxiv.org/abs/2509.13372", "authors": ["Prahlad G Menon"], "title": "Generative AI Pipeline for Interactive Prompt-driven 2D-to-3D Vascular Reconstruction for Fontan Geometries from Contrast-Enhanced X-Ray Fluoroscopy Imaging", "categories": ["eess.IV", "cs.AI", "cs.CV", "cs.ET", "q-bio.QM", "92C50, 68T07, 76D05, 65D18, 92C55", "I.4.6; I.4.8; J.3; I.2.10; I.4.9"], "comment": null, "summary": "Fontan palliation for univentricular congenital heart disease progresses to\nhemodynamic failure with complex flow patterns poorly characterized by\nconventional 2D imaging. Current assessment relies on fluoroscopic angiography,\nproviding limited 3D geometric information essential for computational fluid\ndynamics (CFD) analysis and surgical planning.\n  A multi-step AI pipeline was developed utilizing Google's Gemini 2.5 Flash\n(2.5B parameters) for systematic, iterative processing of fluoroscopic\nangiograms through transformer-based neural architecture. The pipeline\nencompasses medical image preprocessing, vascular segmentation, contrast\nenhancement, artifact removal, and virtual hemodynamic flow visualization\nwithin 2D projections. Final views were processed through Tencent's\nHunyuan3D-2mini (384M parameters) for stereolithography file generation.\n  The pipeline successfully generated geometrically optimized 2D projections\nfrom single-view angiograms after 16 processing steps using a custom web\ninterface. Initial iterations contained hallucinated vascular features\nrequiring iterative refinement to achieve anatomically faithful\nrepresentations. Final projections demonstrated accurate preservation of\ncomplex Fontan geometry with enhanced contrast suitable for 3D conversion.\nAI-generated virtual flow visualization identified stagnation zones in central\nconnections and flow patterns in branch arteries. Complete processing required\nunder 15 minutes with second-level API response times.\n  This approach demonstrates clinical feasibility of generating CFD-suitable\ngeometries from routine angiographic data, enabling 3D generation and rapid\nvirtual flow visualization for cursory insights prior to full CFD simulation.\nWhile requiring refinement cycles for accuracy, this establishes foundation for\ndemocratizing advanced geometric and hemodynamic analysis using readily\navailable imaging data."}
{"id": "2509.14166", "pdf": "https://arxiv.org/pdf/2509.14166", "abs": "https://arxiv.org/abs/2509.14166", "authors": ["Jamie P. McKeown", "Laura E. Wadkin", "Nick G. Parker", "Andrew Golightly", "Andrew W. Baggaley"], "title": "Reaction-diffusion models of invasive tree pest spread: quantifying the spread of oak processionary moth in the UK", "categories": ["q-bio.PE", "q-bio.QM", "92D40, 92-10"], "comment": "19 pages, 8 figures, 2 tables", "summary": "UK woodlands, forests, and urban treescapes are under threat from invasive\nspecies, exacerbated by climate change, trade, and transport. Invasive tree\npests debilitate their host and disrupt forest ecosystems, thus it is\nimperative to quantitatively model and predict their spread. Addressing this,\nwe represent the spatial distribution of the pest as a population density field\nwhich evolves according to a spatiotemporal reaction-diffusion equation. We\nsolve this intractable system of equations numerically and, from the solution,\nwe determine first arrival times of the pest at locations in the field. The\nadopted model permits us to obtain the expansion rate of pest spread directly\nfrom the model parameters, which we infer in the Bayesian paradigm, using a\nMarkov chain Monte Carlo scheme. We apply our framework to the ongoing spread\nof oak processionary moth in the UK, an outbreak which continues to grow\ndespite management efforts. We demonstrate that our approach effectively\ncaptures the spread of the pest and that this has occurred at a non-constant\nexpansion rate. The proposed framework is a powerful tool for quantitatively\nmodelling the spread of an invasive tree pest and could underpin future\nprediction and management approaches."}
{"id": "2509.14167", "pdf": "https://arxiv.org/pdf/2509.14167", "abs": "https://arxiv.org/abs/2509.14167", "authors": ["Md Rezwan Jaher", "Abul Mukid Mohammad Mukaddes", "A. B. M. Abdul Malek"], "title": "Deconstructing Intraocular Pressure: A Non-invasive Multi-Stage Probabilistic Inverse Framework", "categories": ["cs.LG", "q-bio.QM", "stat.AP", "stat.ME"], "comment": "43 pages, 10 figures (including supplementary material)", "summary": "Many critical healthcare decisions are challenged by the inability to measure\nkey underlying parameters. Glaucoma, a leading cause of irreversible blindness\ndriven by elevated intraocular pressure (IOP), provides a stark example. The\nprimary determinant of IOP, a tissue property called trabecular meshwork\npermeability, cannot be measured in vivo, forcing clinicians to depend on\nindirect surrogates. This clinical challenge is compounded by a broader\ncomputational one: developing predictive models for such ill-posed inverse\nproblems is hindered by a lack of ground-truth data and prohibitive cost of\nlarge-scale, high-fidelity simulations. We address both challenges with an\nend-to-end framework to noninvasively estimate unmeasurable variables from\nsparse, routine data. Our approach combines a multi-stage artificial\nintelligence architecture to functionally separate the problem; a novel data\ngeneration strategy we term PCDS that obviates the need for hundreds of\nthousands of costly simulations, reducing the effective computational time from\nyears to hours; and a Bayesian engine to quantify predictive uncertainty. Our\nframework deconstructs a single IOP measurement into its fundamental components\nfrom routine inputs only, yielding estimates for the unmeasurable tissue\npermeability and a patient's outflow facility. Our noninvasively estimated\noutflow facility achieved excellent agreement with state-of-the-art tonography\nwith precision comparable to direct physical instruments. Furthermore, the\nnewly derived permeability biomarker demonstrates high accuracy in stratifying\nclinical cohorts by disease risk, highlighting its diagnostic potential. More\nbroadly, our framework establishes a generalizable blueprint for solving\nsimilar inverse problems in other data-scarce, computationally-intensive\ndomains."}
