{"id": "2510.00392", "pdf": "https://arxiv.org/pdf/2510.00392", "abs": "https://arxiv.org/abs/2510.00392", "authors": ["Muhammad Omer Latif", "Hayat Ullah", "Muhammad Ali Shafique", "Zhihua Dong"], "title": "A Deep Learning Pipeline for Epilepsy Genomic Analysis Using GPT-2 XL and NVIDIA H100", "categories": ["q-bio.GN", "cs.CV", "cs.LG"], "comment": "12 pages", "summary": "Epilepsy is a chronic neurological condition characterized by recurrent\nseizures, with global prevalence estimated at 50 million people worldwide.\nWhile progress in high-throughput sequencing has allowed for broad-based\ntranscriptomic profiling of brain tissues, the deciphering of these highly\ncomplex datasets remains one of the challenges. To address this issue, in this\npaper we propose a new analysis pipeline that integrates the power of deep\nlearning strategies with GPU-acceleration computation for investigating Gene\nexpression patterns in epilepsy. Specifically, our proposed approach employs\nGPT-2 XL, a transformer-based Large Language Model (LLM) with 1.5 billion\nparameters for genomic sequence analysis over the latest NVIDIA H100 Tensor\nCore GPUs based on Hopper architecture. Our proposed method enables efficient\npreprocessing of RNA sequence data, gene sequence encoding, and subsequent\npattern identification. We conducted experiments on two epilepsy datasets\nincluding GEO accession GSE264537 and GSE275235. The obtained results reveal\nseveral significant transcriptomic modifications, including reduced hippocampal\nastrogliosis after ketogenic diet treatment as well as restored\nexcitatory-inhibitory signaling equilibrium in zebrafish epilepsy model.\nMoreover, our results highlight the effectiveness of leveraging LLMs in\ncombination with advanced hardware acceleration for transcriptomic\ncharacterization in neurological diseases."}
{"id": "2510.00353", "pdf": "https://arxiv.org/pdf/2510.00353", "abs": "https://arxiv.org/abs/2510.00353", "authors": ["Xuanyu Lyu", "Jared Balbona", "Tong Chen", "Matthew C. Keller"], "title": "The Multivariate SEM-PGS Model: Using Polygenic Scores to Investigate Cross-Trait Genetic Nurture and Assortative Mating", "categories": ["q-bio.QM", "q-bio.GN", "stat.AP"], "comment": null, "summary": "Genetic nurture effects and assortative mating (AM) occur across many human\nbehaviors and can bias estimates from traditional genetic models. These\ninfluences are typically studied univariately, within the same trait. However,\nestimation of cross-trait genetic nurture effects and cross-trait AM remains\nunderexplored due to the absence of suitable approaches. To address this, we\ndeveloped a multivariate extension of the SEM-PGS model for datasets with\ngenotyped and phenotyped parents and offspring, enabling joint estimation of\nwithin-trait and cross-trait genetic and environmental influences. By\nintegrating haplotypic polygenic scores (PGS) into a structural equation\nmodeling framework, the model simultaneously estimates same-trait and\ncross-trait direct effects, genetic nurture, vertical transmission, and\nassortative mating. We also provide the first formal description of how copaths\ncan be used to model multivariate assortative mating and derive the\ncorresponding parameter expectations in matrix form. Forward-time Monte Carlo\nsimulations under varying conditions of r^2_PGS and N_trio demonstrate that the\nmodel yields unbiased estimates of both within-trait and cross-trait effects\nwhen assumptions are met. The precision of estimates was adequate with large\nsample sizes (N_trio > 16k) and improved as PGS predictive power increased. In\naddition, our simulation results show that failing to model cross-trait effects\nbiases within-trait estimates, underscoring the importance of incorporating\ncross-trait effects. The multivariate SEM-PGS model offers a powerful and\nflexible tool for disentangling gene-environment interplay and advancing the\nunderstanding of familial influences on human traits."}
{"id": "2510.00086", "pdf": "https://arxiv.org/pdf/2510.00086", "abs": "https://arxiv.org/abs/2510.00086", "authors": ["Nemanja Antonic", "Monika Scholz", "Aymeric Vellinger", "Euphrasie Ramahefarivo", "Elio Tuci"], "title": "Behavioural Classification in C. elegans: a Spatio-Temporal Analysis of Locomotion", "categories": ["q-bio.QM", "cs.CV"], "comment": null, "summary": "The 1mm roundworm C. elegans is a model organism used in many sub-areas of\nbiology to investigate different types of biological processes. In order to\ncomplement the n-vivo analysis with computer-based investigations, several\nmethods have been proposed to simulate the worm behaviour. These methods\nextract discrete behavioural units from the flow of the worm movements using\ndifferent types of tracking techniques. Nevertheless, these techniques require\na clear view of the entire worm body, which is not always achievable. For\nexample, this happens in high density worm conditions, which are particularly\ninformative to understand the influence of the social context on the single\nworm behaviour. In this paper, we illustrate and evaluate a method to extract\nbehavioural units from recordings of C. elegans movements which do not\nnecessarily require a clear view of the entire worm body. Moreover, the\nbehavioural units are defined by an unsupervised automatic pipeline which frees\nthe process from predefined assumptions that inevitably bias the behavioural\nanalysis. The behavioural units resulting from the automatic method are\ninterpreted by comparing them with hand-designed behavioural units. The\neffectiveness of the automatic method is evaluated by measuring the extent to\nwhich the movement of a simulated worm, with an agent-based model, matches the\nmovement of a natural worm. Our results indicate that spatio-temporal\nlocomotory patterns emerge even from single point worm tracking. Moreover, we\nshow that such patterns represent a fundamental aspect of the behavioural\nclassification process."}
{"id": "2510.00353", "pdf": "https://arxiv.org/pdf/2510.00353", "abs": "https://arxiv.org/abs/2510.00353", "authors": ["Xuanyu Lyu", "Jared Balbona", "Tong Chen", "Matthew C. Keller"], "title": "The Multivariate SEM-PGS Model: Using Polygenic Scores to Investigate Cross-Trait Genetic Nurture and Assortative Mating", "categories": ["q-bio.QM", "q-bio.GN", "stat.AP"], "comment": null, "summary": "Genetic nurture effects and assortative mating (AM) occur across many human\nbehaviors and can bias estimates from traditional genetic models. These\ninfluences are typically studied univariately, within the same trait. However,\nestimation of cross-trait genetic nurture effects and cross-trait AM remains\nunderexplored due to the absence of suitable approaches. To address this, we\ndeveloped a multivariate extension of the SEM-PGS model for datasets with\ngenotyped and phenotyped parents and offspring, enabling joint estimation of\nwithin-trait and cross-trait genetic and environmental influences. By\nintegrating haplotypic polygenic scores (PGS) into a structural equation\nmodeling framework, the model simultaneously estimates same-trait and\ncross-trait direct effects, genetic nurture, vertical transmission, and\nassortative mating. We also provide the first formal description of how copaths\ncan be used to model multivariate assortative mating and derive the\ncorresponding parameter expectations in matrix form. Forward-time Monte Carlo\nsimulations under varying conditions of r^2_PGS and N_trio demonstrate that the\nmodel yields unbiased estimates of both within-trait and cross-trait effects\nwhen assumptions are met. The precision of estimates was adequate with large\nsample sizes (N_trio > 16k) and improved as PGS predictive power increased. In\naddition, our simulation results show that failing to model cross-trait effects\nbiases within-trait estimates, underscoring the importance of incorporating\ncross-trait effects. The multivariate SEM-PGS model offers a powerful and\nflexible tool for disentangling gene-environment interplay and advancing the\nunderstanding of familial influences on human traits."}
{"id": "2510.00027", "pdf": "https://arxiv.org/pdf/2510.00027", "abs": "https://arxiv.org/abs/2510.00027", "authors": ["Ahmed A. Elhag", "Arun Raja", "Alex Morehead", "Samuel M. Blau", "Garrett M. Morris", "Michael M. Bronstein"], "title": "Learning Inter-Atomic Potentials without Explicit Equivariance", "categories": ["cs.LG", "cs.AI", "q-bio.BM", "q-bio.QM", "I.2.1; J.3"], "comment": "19 pages, 3 tables, 10 figures. Under review", "summary": "Accurate and scalable machine-learned inter-atomic potentials (MLIPs) are\nessential for molecular simulations ranging from drug discovery to new material\ndesign. Current state-of-the-art models enforce roto-translational symmetries\nthrough equivariant neural network architectures, a hard-wired inductive bias\nthat can often lead to reduced flexibility, computational efficiency, and\nscalability. In this work, we introduce TransIP: Transformer-based Inter-Atomic\nPotentials, a novel training paradigm for interatomic potentials achieving\nsymmetry compliance without explicit architectural constraints. Our approach\nguides a generic non-equivariant Transformer-based model to learn\nSO(3)-equivariance by optimizing its representations in the embedding space.\nTrained on the recent Open Molecules (OMol25) collection, a large and diverse\nmolecular dataset built specifically for MLIPs and covering different types of\nmolecules (including small organics, biomolecular fragments, and\nelectrolyte-like species), TransIP attains comparable performance in\nmachine-learning force fields versus state-of-the-art equivariant baselines.\nFurther, compared to a data augmentation baseline, TransIP achieves 40% to 60%\nimprovement in performance across varying OMol25 dataset sizes. More broadly,\nour work shows that learned equivariance can be a powerful and efficient\nalternative to equivariant or augmentation-based MLIP models."}
{"id": "2510.00051", "pdf": "https://arxiv.org/pdf/2510.00051", "abs": "https://arxiv.org/abs/2510.00051", "authors": ["Trinh Ngoc Huynh", "Nguyen Duc Kien", "Nguyen Hai Anh", "Dinh Tran Hiep", "Manuela Vaneckova", "Tomas Uher", "Jeroen Van Schependom", "Stijn Denissen", "Tran Quoc Long", "Nguyen Linh Trung", "Guy Nagels"], "title": "Latent Representation Learning from 3D Brain MRI for Interpretable Prediction in Multiple Sclerosis", "categories": ["eess.IV", "cs.CV", "q-bio.QM"], "comment": "The abstract has been condensed to under 1920 characters", "summary": "We present InfoVAE-Med3D, a latent-representation learning approach for 3D\nbrain MRI that targets interpretable biomarkers of cognitive decline. Standard\nstatistical models and shallow machine learning often lack power, while most\ndeep learning methods behave as black boxes. Our method extends InfoVAE to\nexplicitly maximize mutual information between images and latent variables,\nproducing compact, structured embeddings that retain clinically meaningful\ncontent. We evaluate on two cohorts: a large healthy-control dataset (n=6527)\nwith chronological age, and a clinical multiple sclerosis dataset from Charles\nUniversity in Prague (n=904) with age and Symbol Digit Modalities Test (SDMT)\nscores. The learned latents support accurate brain-age and SDMT regression,\npreserve key medical attributes, and form intuitive clusters that aid\ninterpretation. Across reconstruction and downstream prediction tasks,\nInfoVAE-Med3D consistently outperforms other VAE variants, indicating stronger\ninformation capture in the embedding space. By uniting predictive performance\nwith interpretability, InfoVAE-Med3D offers a practical path toward MRI-based\nbiomarkers and more transparent analysis of cognitive deterioration in\nneurological disease."}
{"id": "2510.00087", "pdf": "https://arxiv.org/pdf/2510.00087", "abs": "https://arxiv.org/abs/2510.00087", "authors": ["Anja Adamov", "Markus Chardonnet", "Florian Krach", "Jakob Heiss", "Josef Teichmann", "Nicholas A. Bokulich"], "title": "Revealing the temporal dynamics of antibiotic anomalies in the infant gut microbiome with neural jump ODEs", "categories": ["stat.AP", "cs.LG", "math.PR", "q-bio.QM"], "comment": null, "summary": "Detecting anomalies in irregularly sampled multi-variate time-series is\nchallenging, especially in data-scarce settings. Here we introduce an anomaly\ndetection framework for irregularly sampled time-series that leverages neural\njump ordinary differential equations (NJODEs). The method infers conditional\nmean and variance trajectories in a fully path dependent way and computes\nanomaly scores. On synthetic data containing jump, drift, diffusion, and noise\nanomalies, the framework accurately identifies diverse deviations. Applied to\ninfant gut microbiome trajectories, it delineates the magnitude and persistence\nof antibiotic-induced disruptions: revealing prolonged anomalies after second\nantibiotic courses, extended duration treatments, and exposures during the\nsecond year of life. We further demonstrate the predictive capabilities of the\ninferred anomaly scores in accurately predicting antibiotic events and\noutperforming diversity-based baselines. Our approach accommodates unevenly\nspaced longitudinal observations, adjusts for static and dynamic covariates,\nand provides a foundation for inferring microbial anomalies induced by\nperturbations, offering a translational opportunity to optimize intervention\nregimens by minimizing microbial disruptions."}
{"id": "2510.00733", "pdf": "https://arxiv.org/pdf/2510.00733", "abs": "https://arxiv.org/abs/2510.00733", "authors": ["Alessio Cristofoletto", "Cesare Rollo", "Giovanni Birolo", "Piero Fariselli"], "title": "Neural Diffusion Processes for Physically Interpretable Survival Prediction", "categories": ["cs.LG", "cs.AI", "q-bio.QM"], "comment": "11 pages, 6 figures", "summary": "We introduce DeepFHT, a survival-analysis framework that couples deep neural\nnetworks with first hitting time (FHT) distributions from stochastic process\ntheory. Time to event is represented as the first passage of a latent diffusion\nprocess to an absorbing boundary. A neural network maps input variables to\nphysically meaningful parameters including initial condition, drift, and\ndiffusion, within a chosen FHT process such as Brownian motion, both with drift\nand driftless. This yields closed-form survival and hazard functions and\ncaptures time-varying risk without assuming proportional-hazards.\n  We compare DeepFHT with Cox regression and other existing parametric survival\nmodels, using synthetic and real-world datasets. The method achieves predictive\naccuracy on par with state-of-the-art approaches, while maintaining a\nphysics-based interpretable parameterization that elucidates the relation\nbetween input features and risk. This combination of stochastic process theory\nand deep learning provides a principled avenue for modeling survival phenomena\nin complex systems."}
{"id": "2510.00976", "pdf": "https://arxiv.org/pdf/2510.00976", "abs": "https://arxiv.org/abs/2510.00976", "authors": ["Aueaphum Aueawatthanaphisut"], "title": "Adaptive Federated Few-Shot Rare-Disease Diagnosis with Energy-Aware Secure Aggregation", "categories": ["cs.AI", "cs.CR", "cs.DC", "cs.LG", "q-bio.QM"], "comment": "6 pages, 6 figures, 12 equations, 1 algorithm", "summary": "Rare-disease diagnosis remains one of the most pressing challenges in digital\nhealth, hindered by extreme data scarcity, privacy concerns, and the limited\nresources of edge devices. This paper proposes the Adaptive Federated Few-Shot\nRare-Disease Diagnosis (AFFR) framework, which integrates three pillars: (i)\nfew-shot federated optimization with meta-learning to generalize from limited\npatient samples, (ii) energy-aware client scheduling to mitigate device\ndropouts and ensure balanced participation, and (iii) secure aggregation with\ncalibrated differential privacy to safeguard sensitive model updates. Unlike\nprior work that addresses these aspects in isolation, AFFR unifies them into a\nmodular pipeline deployable on real-world clinical networks. Experimental\nevaluation on simulated rare-disease detection datasets demonstrates up to 10%\nimprovement in accuracy compared with baseline FL, while reducing client\ndropouts by over 50% without degrading convergence. Furthermore,\nprivacy-utility trade-offs remain within clinically acceptable bounds. These\nfindings highlight AFFR as a practical pathway for equitable and trustworthy\nfederated diagnosis of rare conditions."}
{"id": "2510.01089", "pdf": "https://arxiv.org/pdf/2510.01089", "abs": "https://arxiv.org/abs/2510.01089", "authors": ["Viktor Sip", "Martin Breyton", "Spase Petkoski", "Viktor Jirsa"], "title": "Dynamical system reconstruction from partial observations using stochastic dynamics", "categories": ["cs.LG", "q-bio.QM"], "comment": null, "summary": "Learning stochastic models of dynamical systems underlying observed data is\nof interest in many scientific fields. Here we propose a novel method for this\ntask, based on the framework of variational autoencoders for dynamical systems.\nThe method estimates from the data both the system state trajectories and noise\ntime series. This approach allows to perform multi-step system evolution and\nsupports a teacher forcing strategy, alleviating limitations of\nautoencoder-based approaches for stochastic systems. We demonstrate the\nperformance of the proposed approach on six test problems, covering simulated\nand experimental data. We further show the effects of the teacher forcing\ninterval on the nature of the internal dynamics, and compare it to the\ndeterministic models with equivalent architecture."}
