{"id": "2512.02089", "pdf": "https://arxiv.org/pdf/2512.02089", "abs": "https://arxiv.org/abs/2512.02089", "authors": ["Shelby Lacouture", "Mitchell Kelley", "Noah Plues", "Laszlo Hunyadi", "Emily Sundman", "Annette Sobel", "Robert V. Duncan"], "title": "A Compact, Data-Logging Breath-Gas Analyzer", "categories": ["q-bio.QM"], "comment": null, "summary": "Respiratory ailments are increasing globally at an alarming rate and are currently one of the leading factors of death and infirmity worldwide. Among respiratory diseases, those linked to poor air quality and pollutants are increasing at a proportionally higher rate than those linked to viral or other factors. Diagnosing disorders of the respiratory system is often performed initially by routine physical examinations and questionnaires. Once most patients have symptoms that are severe enough to warrant clinical testing, the ailment could have already caused pulmonary damage. Clinical diagnosis involves the use of cumbersome, expensive equipment that measures different parameters separately, e.g., Capnography (CO2) and spirometry (bidirectional tidal mass flow). These disparate sets of data must then be interpreted collectively by a qualified medical practitioner. This paper details the design of a portable, inexpensive, mixed-signal data-logging system that measures a chosen set of parameters in exhaled breath from humans or animals. The data is a comprehensive set of pertinent gases and mass flow that when looked at simultaneously, gives a synergistic view of these interrelated breathing biomarkers and thus the state of the respiratory system as a whole. A mask-mounted, tabletop, and handheld version was developed for different applications. The system, when fully developed, would enable a new set of clinical vitals that only require a patient to breathe through a single, small device for a few moments. This new set of clinical vitals could enable the early diagnosis of many respiratory ailments, something that could have a large positive impact on disease prognosis and quality of life."}
{"id": "2512.02260", "pdf": "https://arxiv.org/pdf/2512.02260", "abs": "https://arxiv.org/abs/2512.02260", "authors": ["Hammed A. Akande", "Abdulrauf A. Gidado"], "title": "EcoCast: A Spatio-Temporal Model for Continual Biodiversity and Climate Risk Forecasting", "categories": ["q-bio.QM", "stat.ML"], "comment": "9 pages, 3 figures, 1 table. Accepted to the NeurIPS 2025 Workshop on Tackling Climate Change with Machine Learning", "summary": "Increasing climate change and habitat loss are driving unprecedented shifts in species distributions. Conservation professionals urgently need timely, high-resolution predictions of biodiversity risks, especially in ecologically diverse regions like Africa. We propose EcoCast, a spatio-temporal model designed for continual biodiversity and climate risk forecasting. Utilizing multisource satellite imagery, climate data, and citizen science occurrence records, EcoCast predicts near-term (monthly to seasonal) shifts in species distributions through sequence-based transformers that model spatio-temporal environmental dependencies. The architecture is designed with support for continual learning to enable future operational deployment with new data streams. Our pilot study in Africa shows promising improvements in forecasting distributions of selected bird species compared to a Random Forest baseline, highlighting EcoCast's potential to inform targeted conservation policies. By demonstrating an end-to-end pipeline from multi-modal data ingestion to operational forecasting, EcoCast bridges the gap between cutting-edge machine learning and biodiversity management, ultimately guiding data-driven strategies for climate resilience and ecosystem conservation throughout Africa."}
{"id": "2512.02312", "pdf": "https://arxiv.org/pdf/2512.02312", "abs": "https://arxiv.org/abs/2512.02312", "authors": ["Gregory M Ellison", "Liang Liu"], "title": "Fast and Accurate Node-Age Estimation Under Fossil Calibration Uncertainty Using the Adjusted Pairwise Likelihood", "categories": ["q-bio.QM", "q-bio.PE"], "comment": "32 pages, 11 figures", "summary": "Estimating divergence times from molecular sequence data is central to reconstructing the evolutionary history of lineages. Although Bayesian relaxed-clock methods provide a principled framework for incorporating fossil information, their dependence on repeated evaluations of the full phylogenetic likelihood makes them computationally demanding for large genomic datasets. Furthermore, because disagreements in divergence-time estimates often arise from uncertainty or error in fossil placement and prior specification, there is a need for methods that are both computationally efficient and robust to fossil-calibration uncertainty. In this study, we introduce fast and accurate alternatives based on the phylogenetic pairwise composite likelihood, presenting two adjusted pairwise likelihood (APW) formulations that employ asymptotic moment-matching weights to better approximate the behavior of the full likelihood within a Bayesian MCMC framework. Extensive simulations across diverse fossil-calibration scenarios show that APW methods produce node-age estimates comparable to those obtained from the full likelihood while offering greater robustness to fossil misplacement and prior misspecification, due to the reduced sensitivity of composite likelihoods to local calibration errors. Applied to a genome-scale dataset of modern birds, APW methods recover divergence time patterns consistent with recent studies, while reducing computational cost by more than an order of magnitude. Overall, our results demonstrate that adjusted pairwise likelihoods provide a calibration-robust and computationally efficient framework for Bayesian node dating, especially suited for large phylogenomic datasets and analyses in which fossil priors may be uncertain or imperfectly placed."}
{"id": "2512.02478", "pdf": "https://arxiv.org/pdf/2512.02478", "abs": "https://arxiv.org/abs/2512.02478", "authors": ["Thomas P. Steele", "David J. Warne"], "title": "Simulation and inference methods for non-Markovian stochastic biochemical reaction networks", "categories": ["q-bio.MN", "math.NA", "stat.CO"], "comment": null, "summary": "Stochastic models of biochemical reaction networks are widely used to capture intrinsic noise in cellular systems. The typical formulation of these models are based on Markov processes for which there is extensive research on efficient simulation and inference. However, there are biological processes, such as gene transcription and translation, that introduce history dependent dynamics requiring non-Markovian processes to accurately capture the stochastic dynamics of the system. This greater realism comes with additional computational challenges for simulation and parameter inference. We develop efficient stochastic simulation algorithms for well-mixed non-Markovian stochastic biochemical reaction networks with delays that depend on system state and time. Our methods generalize the next reaction method and $τ$-leaping method to support arbitrary inter-event time distributions while preserving computational scalability. We also introduce a coupling scheme to generate exact non-Markovian sample paths that are positively correlated to an approximate non-Markovian $τ$-leaping sample path. This enables substantial computational gains for Bayesian inference of model parameters though multifidelity simulation-based inference schemes. We demonstrate the effectiveness of our approach on a gene regulation model with delayed auto-inhibition, showing substantial gains in both simulation accuracy and inference efficiency of two orders of magnitude. These results extend the practical applicability of non-Markovian models in systems biology and beyond."}
{"id": "2512.02328", "pdf": "https://arxiv.org/pdf/2512.02328", "abs": "https://arxiv.org/abs/2512.02328", "authors": ["Jiabao Brad Wang", "Siyuan Cao", "Hongxuan Wu", "Yiliang Yuan", "Mustafa Misir"], "title": "Molecular Embedding-Based Algorithm Selection in Protein-Ligand Docking", "categories": ["q-bio.QM", "cs.LG"], "comment": "25 pages, 13 figures, 5 tables. Protein-ligand docking, algorithm selection, pretrained embeddings (ESM, ChemBERTa), docking benchmarks, oracle-landscape analysis. Code and data available", "summary": "Selecting an effective docking algorithm is highly context-dependent, and no single method performs reliably across structural, chemical, or protocol regimes. We introduce MolAS, a lightweight algorithm selection system that predicts per-algorithm performance from pretrained protein-ligand embeddings using attentional pooling and a shallow residual decoder. With only hundreds to a few thousand labelled complexes, MolAS achieves up to 15% absolute improvement over the single-best solver (SBS) and closes 17-66% of the Virtual Best Solver (VBS)-SBS gap across five diverse docking benchmarks. Analyses of reliability, embedding geometry, and solver-selection patterns show that MolAS succeeds when the oracle landscape exhibits low entropy and separable solver behaviour, but collapses under protocol-induced hierarchy shifts. These findings indicate that the main barrier to robust docking AS is not representational capacity but instability in solver rankings across pose-generation regimes, positioning MolAS as both a practical in-domain selector and a diagnostic tool for assessing when AS is feasible."}
{"id": "2512.02908", "pdf": "https://arxiv.org/pdf/2512.02908", "abs": "https://arxiv.org/abs/2512.02908", "authors": ["Iryna Zabaikina", "Ramon Grima"], "title": "Imperfect molecular detection renormalizes apparent kinetic rates in stochastic gene regulatory networks", "categories": ["q-bio.MN", "q-bio.QM", "q-bio.SC"], "comment": "24 pages, 5 figures", "summary": "Imperfect molecular detection in single-cell experiments introduces technical noise that obscures the true stochastic dynamics of gene regulatory networks. While binomial models of molecular capture provide a principled description of imperfect detection, they have so far been analyzed only for simple gene-expression models that do not explicitly account for regulation. Here, we extend binomial models of capture to general gene regulatory networks to understand how imperfect capture reshapes the observed time-dependent statistics of molecular counts. Our results reveal when capture effects correspond to a renormalization of a subset of the kinetic rates and when they cannot be absorbed into effective rates, providing a systematic basis for interpreting noisy single-cell measurements. In particular, we show that rate renormalization emerges either under significant transcription factor abundance or when promoter-state transitions occur on a distinct (much slower or faster) timescale than other reactions. In these cases, technical noise causes the apparent mean burst size of synthesized gene products to appear reduced while transcription factor binding reactions appear faster. These effects hold for gene regulatory networks of arbitrary connectivity and remain valid under time-dependent kinetic rates."}
{"id": "2512.02528", "pdf": "https://arxiv.org/pdf/2512.02528", "abs": "https://arxiv.org/abs/2512.02528", "authors": ["Vincent Wieland", "Nils Wassmuth", "Lorenzo Contento", "Martin Kühn", "Jan Hasenauer"], "title": "Assessment of Simulation-based Inference Methods for Stochastic Compartmental Models", "categories": ["q-bio.QM"], "comment": null, "summary": "Global pandemics, such as the recent COVID-19 crisis, highlight the need for stochastic epidemic models that can capture the randomness inherent in the spread of disease. Such models must be accompanied by methods for estimating parameters in order to generate fast nowcasts and short-term forecasts that can inform public health decisions. This paper presents a comparison of two advanced Bayesian inference methods: 1) pseudo-marginal particle Markov chain Monte Carlo, short Particle Filters (PF), and 2) Conditional Normalizing Flows (CNF). We investigate their performance on two commonly used compartmental models: a classical Susceptible-Infected-Recovered (SIR) model and a two-variant Susceptible-Exposed-Infected-Recovered (SEIR) model, complemented by an observation model that maps latent trajectories to empirical data. Addressing the challenges of intractable likelihoods for parameter inference in stochastic settings, our analysis highlights how these likelihood-free methods provide accurate and robust inference capabilities. The results of our simulation study further underscore the effectiveness of these approaches in capturing the stochastic dynamics of epidemics, providing prediction capabilities for the control of epidemic outbreaks. Results on an Ethiopian cohort study demonstrate operational robustness under real-world noise and irregular data sampling. To facilitate reuse and to enable building pipelines that ultimately contribute to better informed decision making in public health, we make code and synthetic datasets publicly available."}
{"id": "2512.02811", "pdf": "https://arxiv.org/pdf/2512.02811", "abs": "https://arxiv.org/abs/2512.02811", "authors": ["Timo Jakumeit", "Lukas Brand", "Jens Kirchner", "Robert Schober", "Sebastian Lotter"], "title": "Vessel Network Topology in Molecular Communication: Insights from Experiments and Theory", "categories": ["q-bio.QM", "cs.ET"], "comment": "29 pages, 10 figures; This paper has been submitted to IEEE Transactions on Molecular, Biological, and Multi-Scale Communications", "summary": "The notion of synthetic molecular communication (MC) refers to the transmission of information via signaling molecules and is foreseen to enable innovative medical applications in the human cardiovascular system (CVS). Crucially, the design of such applications requires accurate and experimentally validated channel models that characterize the propagation of signaling molecules, not just in individual blood vessels, but in complex vessel networks (VNs), as prevalent in the CVS. However, experimentally validated models for MC in VNs remain scarce. To address this gap, we propose a novel channel model for MC in complex VN topologies, which captures molecular transport via advection, molecular and turbulent diffusion, as well as adsorption and desorption at the vessel walls. We specialize this model for superparamagnetic iron-oxide nanoparticles (SPIONs) as signaling molecules by introducing a new receiver (RX) model for planar coil inductive sensors, enabling end-to-end experimental validation with a dedicated SPION testbed. Validation covers a range of channel topologies, from single-vessel topologies to branched VNs with multiple paths between transmitter (TX) and RX. Additionally, to quantify how the VN topology impacts signal quality, and inspired by multi-path propagation models in conventional wireless communications, we introduce two metrics, namely molecule delay and multi-path spread. We show that these metrics link the VN structure to molecule dispersion induced by the VN and mediately to the resulting signal-to-noise ratio (SNR) at the RX. The proposed VN structure-SNR link is validated experimentally, demonstrating that the proposed framework can support tasks such as optimal sensor placement in the CVS or the identification of suitable testbed topologies for specific SNR requirements. All experimental data are openly available on Zenodo."}
{"id": "2512.02162", "pdf": "https://arxiv.org/pdf/2512.02162", "abs": "https://arxiv.org/abs/2512.02162", "authors": ["Rahul Mehta"], "title": "Mapping of Lesion Images to Somatic Mutations", "categories": ["cs.CV", "q-bio.QM"], "comment": "https://dl.acm.org/doi/abs/10.1145/3340531.3414074#sec-terms", "summary": "Medical imaging is a critical initial tool used by clinicians to determine a patient's cancer diagnosis, allowing for faster intervention and more reliable patient prognosis. At subsequent stages of patient diagnosis, genetic information is extracted to help select specific patient treatment options. As the efficacy of cancer treatment often relies on early diagnosis and treatment, we build a deep latent variable model to determine patients' somatic mutation profiles based on their corresponding medical images. We first introduce a point cloud representation of lesions images to allow for invariance to the imaging modality. We then propose, LLOST, a model with dual variational autoencoders coupled together by a separate shared latent space that unifies features from the lesion point clouds and counts of distinct somatic mutations. Therefore our model consists of three latent space, each of which is learned with a conditional normalizing flow prior to account for the diverse distributions of each domain. We conduct qualitative and quantitative experiments on de-identified medical images from The Cancer Imaging Archive and the corresponding somatic mutations from the Pan Cancer dataset of The Cancer Genomic Archive. We show the model's predictive performance on the counts of specific mutations as well as it's ability to accurately predict the occurrence of mutations. In particular, shared patterns between the imaging and somatic mutation domain that reflect cancer type. We conclude with a remark on how to improve the model and possible future avenues of research to include other genetic domains."}
{"id": "2512.02908", "pdf": "https://arxiv.org/pdf/2512.02908", "abs": "https://arxiv.org/abs/2512.02908", "authors": ["Iryna Zabaikina", "Ramon Grima"], "title": "Imperfect molecular detection renormalizes apparent kinetic rates in stochastic gene regulatory networks", "categories": ["q-bio.MN", "q-bio.QM", "q-bio.SC"], "comment": "24 pages, 5 figures", "summary": "Imperfect molecular detection in single-cell experiments introduces technical noise that obscures the true stochastic dynamics of gene regulatory networks. While binomial models of molecular capture provide a principled description of imperfect detection, they have so far been analyzed only for simple gene-expression models that do not explicitly account for regulation. Here, we extend binomial models of capture to general gene regulatory networks to understand how imperfect capture reshapes the observed time-dependent statistics of molecular counts. Our results reveal when capture effects correspond to a renormalization of a subset of the kinetic rates and when they cannot be absorbed into effective rates, providing a systematic basis for interpreting noisy single-cell measurements. In particular, we show that rate renormalization emerges either under significant transcription factor abundance or when promoter-state transitions occur on a distinct (much slower or faster) timescale than other reactions. In these cases, technical noise causes the apparent mean burst size of synthesized gene products to appear reduced while transcription factor binding reactions appear faster. These effects hold for gene regulatory networks of arbitrary connectivity and remain valid under time-dependent kinetic rates."}
