{"id": "2510.01935", "pdf": "https://arxiv.org/pdf/2510.01935", "abs": "https://arxiv.org/abs/2510.01935", "authors": ["Evgeny Knyazev", "Timur Kulagin", "Ivan Antipenko", "Alexander Tonevitsky"], "title": "Single-cell sequencing of trophoblasts in preeclampsia and chemical hypoxia in BeWo b30 cells reveals EBI3, COL17A1, miR-27a-5p, and miR-193b-5p as hypoxia-response markers", "categories": ["q-bio.GN", "q-bio.CB", "q-bio.TO"], "comment": "27 pages, 10 figures, 2 tables", "summary": "Background. Preeclampsia (PE) complicates 2-8% of pregnancies and is marked\nby placental hypoxia and HIF-pathway activation, especially in early-onset PE\n(eoPE). Integrating patient tissue analyses with experimental models may reveal\ncommon molecular markers of trophoblast hypoxia.\n  Methods. We analyzed scRNA-seq data from 10 eoPE, 7 late-onset PE (loPE), and\ncorresponding control placentas, identifying villous cytotrophoblast (VCT),\nsyncytiotrophoblast (SCT), and extravillous trophoblast (EVT) subpopulations.\nBeWo b30 cells were treated for 24 h with CoCl2 (300 $\\mu$M) or an oxyquinoline\nderivative (OD, 5 $\\mu$M) to induce hypoxia. RNA and small RNA sequencing\nquantified mRNA and microRNA changes. PROGENy inferred pathway activities.\n  Results. ScRNA-seq revealed highest hypoxia pathway activation in eoPE, with\nEVT showing maximum activity among trophoblast populations. Nine genes were\nupregulated across all trophoblast types in eoPE: EBI3, CST6, FN1, RFK,\nCOL17A1, LDHA, PKP2, RPS4Y1, and RPS26. In vitro, OD induced more specific\nhypoxia responses than CoCl2, with 1,284 versus 3,032 differentially expressed\ngenes respectively. Critically, EBI3, FN1, and COL17A1 showed concordant\nupregulation in both placental tissue and OD-treated cells, while CoCl2\ntreatment produced opposite expression patterns. MicroRNA analysis identified\nhsa-miR-27a-5p and hsa-miR-193b-5p as consistently elevated in both\nexperimental conditions and previously reported in PE placental vesicles. We\nalso identified isoforms of hsa-miR-9-5p and hsa-miR-92b-3p as\nhypoxia-associated in trophoblast.\n  Conclusions. EBI3, COL17A1, hsa-miR-27a-5p, and hsa-miR-193b-5p emerge as\ntrophoblast hypoxia markers in PE. Oxyquinoline derivatives offer a more\nphysiologically relevant in vitro hypoxia model than CoCl2. This integrated\napproach advances understanding of PE pathophysiology and suggests candidate\ntherapeutic targets."}
{"id": "2510.01282", "pdf": "https://arxiv.org/pdf/2510.01282", "abs": "https://arxiv.org/abs/2510.01282", "authors": ["Shuyang Chu", "Jingang Shi", "Xu Cheng", "Haoyu Chen", "Xin Liu", "Jian Xu", "Guoying Zhao"], "title": "To Remember, To Adapt, To Preempt: A Stable Continual Test-Time Adaptation Framework for Remote Physiological Measurement in Dynamic Domain Shifts", "categories": ["q-bio.QM"], "comment": null, "summary": "Remote photoplethysmography (rPPG) aims to extract non-contact physiological\nsignals from facial videos and has shown great potential. However, existing\nrPPG approaches struggle to bridge the gap between source and target domains.\nRecent test-time adaptation (TTA) solutions typically optimize rPPG model for\nthe incoming test videos using self-training loss under an unrealistic\nassumption that the target domain remains stationary. However, time-varying\nfactors like weather and lighting in dynamic environments often cause continual\ndomain shifts. The erroneous gradients accumulation from these shifts may\ncorrupt the model's key parameters for physiological information, leading to\ncatastrophic forgetting. Therefore, We propose a physiology-related parameters\nfreezing strategy to retain such knowledge. It isolates physiology-related and\ndomain-related parameters by assessing the model's uncertainty to current\ndomain and freezes the physiology-related parameters during adaptation to\nprevent catastrophic forgetting. Moreover, the dynamic domain shifts with\nvarious non-physiological characteristics may lead to conflicting optimization\nobjectives during TTA, which is manifested as the over-adapted model losing its\nadaptability to future domains. To fix over-adaptation, we propose a preemptive\ngradient modification strategy. It preemptively adapts to future domains and\nuses the acquired gradients to modify current adaptation, thereby preserving\nthe model's adaptability. In summary, we propose a stable continual test-time\nadaptation (CTTA) framework for rPPG measurement, called \\textbf{PhysRAP},\nwhich \\textbf{R}emembers the past, \\textbf{A}dapts to the present, and\n\\textbf{P}reempts the future. Extensive experiments show its state-of-the-art\nperformance, especially in domain shifts. The code is available at\nhttps://github.com/xjtucsy/PhysRAP."}
{"id": "2510.01287", "pdf": "https://arxiv.org/pdf/2510.01287", "abs": "https://arxiv.org/abs/2510.01287", "authors": ["Runchen Wang", "Junlin Guo", "Siqi Lu", "Ruining Deng", "Zhengyi Lu", "Yanfan Zhu", "Yuechen Yang", "Chongyu Qu", "Yu Wang", "Shilin Zhao", "Catie Chang", "Mitchell Wilkes", "Mengmeng Yin", "Haichun Yang", "Yuankai Huo"], "title": "Evaluating New AI Cell Foundation Models on Challenging Kidney Pathology Cases Unaddressed by Previous Foundation Models", "categories": ["q-bio.QM", "cs.AI"], "comment": null, "summary": "Accurate cell nuclei segmentation is critical for downstream tasks in kidney\npathology and remains a major challenge due to the morphological diversity and\nimaging variability of renal tissues. While our prior work has evaluated\nearly-generation AI cell foundation models in this domain, the effectiveness of\nrecent cell foundation models remains unclear. In this study, we benchmark\nadvanced AI cell foundation models (2025), including CellViT++ variants and\nCellpose-SAM, against three widely used cell foundation models developed prior\nto 2024, using a diverse large-scale set of kidney image patches within a\nhuman-in-the-loop rating framework. We further performed fusion-based ensemble\nevaluation and model agreement analysis to assess the segmentation capabilities\nof the different models. Our results show that CellViT++ [Virchow] yields the\nhighest standalone performance with 40.3% of predictions rated as \"Good\" on a\ncurated set of 2,091 challenging samples, outperforming all prior models. In\naddition, our fused model achieves 62.2% \"Good\" predictions and only 0.4%\n\"Bad\", substantially reducing segmentation errors. Notably, the fusion model\n(2025) successfully resolved the majority of challenging cases that remained\nunaddressed in our previous study. These findings demonstrate the potential of\nAI cell foundation model development in renal pathology and provide a curated\ndataset of challenging samples to support future kidney-specific model\nrefinement."}
{"id": "2510.01298", "pdf": "https://arxiv.org/pdf/2510.01298", "abs": "https://arxiv.org/abs/2510.01298", "authors": ["Berker Demirel", "Marco Fumero", "Theofanis Karaletsos", "Francesco Locatello"], "title": "MorphGen: Controllable and Morphologically Plausible Generative Cell-Imaging", "categories": ["q-bio.QM", "cs.CV", "cs.LG"], "comment": null, "summary": "Simulating in silico cellular responses to interventions is a promising\ndirection to accelerate high-content image-based assays, critical for advancing\ndrug discovery and gene editing. To support this, we introduce MorphGen, a\nstate-of-the-art diffusion-based generative model for fluorescent microscopy\nthat enables controllable generation across multiple cell types and\nperturbations. To capture biologically meaningful patterns consistent with\nknown cellular morphologies, MorphGen is trained with an alignment loss to\nmatch its representations to the phenotypic embeddings of OpenPhenom, a\nstate-of-the-art biological foundation model. Unlike prior approaches that\ncompress multichannel stains into RGB images -- thus sacrificing\norganelle-specific detail -- MorphGen generates the complete set of fluorescent\nchannels jointly, preserving per-organelle structures and enabling a\nfine-grained morphological analysis that is essential for biological\ninterpretation. We demonstrate biological consistency with real images via\nCellProfiler features, and MorphGen attains an FID score over $35\\%$ lower than\nthe prior state-of-the-art MorphoDiff, which only generates RGB images for a\nsingle cell type. Code is available at https://github.com/czi-ai/MorphGen."}
{"id": "2510.01428", "pdf": "https://arxiv.org/pdf/2510.01428", "abs": "https://arxiv.org/abs/2510.01428", "authors": ["Ching-Huei Tsou", "Michal Ozery-Flato", "Ella Barkan", "Diwakar Mahajan", "Ben Shapira"], "title": "BioVERSE: Representation Alignment of Biomedical Modalities to LLMs for Multi-Modal Reasoning", "categories": ["q-bio.QM", "cs.AI"], "comment": null, "summary": "Recent advances in large language models (LLMs) and biomedical foundation\nmodels (BioFMs) have achieved strong results in biological text reasoning,\nmolecular modeling, and single-cell analysis, yet they remain siloed in\ndisjoint embedding spaces, limiting cross-modal reasoning. We present BIOVERSE\n(Biomedical Vector Embedding Realignment for Semantic Engagement), a two-stage\napproach that adapts pretrained BioFMs as modality encoders and aligns them\nwith LLMs through lightweight, modality-specific projection layers. The\napproach first aligns each modality to a shared LLM space through independently\ntrained projections, allowing them to interoperate naturally, and then applies\nstandard instruction tuning with multi-modal data to bring them together for\ndownstream reasoning. By unifying raw biomedical data with knowledge embedded\nin LLMs, the approach enables zero-shot annotation, cross-modal question\nanswering, and interactive, explainable dialogue. Across tasks spanning\ncell-type annotation, molecular description, and protein function reasoning,\ncompact BIOVERSE configurations surpass larger LLM baselines while enabling\nricher, generative outputs than existing BioFMs, establishing a foundation for\nprincipled multi-modal biomedical reasoning."}
{"id": "2510.01480", "pdf": "https://arxiv.org/pdf/2510.01480", "abs": "https://arxiv.org/abs/2510.01480", "authors": ["Ekaterina Podplutova", "Anastasia Vepreva", "Olga A. Konovalova", "Vladimir Vinogradov", "Dmitrii O. Shkil", "Andrei Dmitrenko"], "title": "Pharmacophore-Guided Generative Design of Novel Drug-Like Molecules", "categories": ["q-bio.QM", "cs.AI"], "comment": "AI4Mat-NeurIPS-2025 Poster", "summary": "The integration of artificial intelligence (AI) in early-stage drug discovery\noffers unprecedented opportunities for exploring chemical space and\naccelerating hit-to-lead optimization. However, docking optimization in\ngenerative approaches is computationally expensive and may lead to inaccurate\nresults. Here, we present a novel generative framework that balances\npharmacophore similarity to reference compounds with structural diversity from\nactive molecules. The framework allows users to provide custom reference sets,\nincluding FDA-approved drugs or clinical candidates, and guides the \\textit{de\nnovo} generation of potential therapeutics. We demonstrate its applicability\nthrough a case study targeting estrogen receptor modulators and antagonists for\nbreast cancer. The generated compounds maintain high pharmacophoric fidelity to\nknown active molecules while introducing substantial structural novelty,\nsuggesting strong potential for functional innovation and patentability.\nComprehensive evaluation of the generated molecules against common drug-like\nproperties confirms the robustness and pharmaceutical relevance of the\napproach."}
{"id": "2510.01694", "pdf": "https://arxiv.org/pdf/2510.01694", "abs": "https://arxiv.org/abs/2510.01694", "authors": ["Tony Wong", "Ikchang Cho", "Maria R. D'Orsogna", "Tom Chou"], "title": "First passage times to T cell activation", "categories": ["q-bio.QM", "q-bio.CB", "35K57, 35Q92, 60J70, 92C17, 92C37"], "comment": null, "summary": "Effective recognition of foreign antigens by the adaptive immune system\nrelies on T cells being activated by antigen-presenting cells (APCs) in lymph\nnodes. Here, diffusing T cells may encounter cognate APCs that present matching\nantigen fragments or non-cognate ones that do not; they are also subject to\ndegradation. We develop a stochastic model in which T cell-APCs interact via a\nsequence of recognition steps, represented as a multistage Markov chain. T\ncells are successfully activated only if the terminal state associated with a\ncognate APC is reached. We compute the probability of successful activation in\nthe presence of interfering non-cognate APCs, T cell degradation, and lymph\nnode exit, and analyze the mean first-passage time to activation. We also\nincorporate a kinetic proofreading mechanism that enables state resetting, and\nshow how this enhances specificity toward cognate APCs."}
{"id": "2510.02037", "pdf": "https://arxiv.org/pdf/2510.02037", "abs": "https://arxiv.org/abs/2510.02037", "authors": ["Carlijn Lems", "Leslie Tessier", "John-Melle Bokhorst", "Mart van Rijthoven", "Witali Aswolinskiy", "Matteo Pozzi", "Natalie Klubickova", "Suzanne Dintzis", "Michela Campora", "Maschenka Balkenhol", "Peter Bult", "Joey Spronck", "Thomas Detone", "Mattia Barbareschi", "Enrico Munari", "Giuseppe Bogina", "Jelle Wesseling", "Esther H. Lips", "Francesco Ciompi", "Frédérique Meeuwsen", "Jeroen van der Laak"], "title": "A Multicentric Dataset for Training and Benchmarking Breast Cancer Segmentation in H&E Slides", "categories": ["q-bio.QM", "cs.CV", "eess.IV"], "comment": "Our dataset is available at https://zenodo.org/records/16812932 , our\n  code is available at https://github.com/DIAGNijmegen/beetle , and our\n  benchmark is available at https://beetle.grand-challenge.org/", "summary": "Automated semantic segmentation of whole-slide images (WSIs) stained with\nhematoxylin and eosin (H&E) is essential for large-scale artificial\nintelligence-based biomarker analysis in breast cancer. However, existing\npublic datasets for breast cancer segmentation lack the morphological diversity\nneeded to support model generalizability and robust biomarker validation across\nheterogeneous patient cohorts. We introduce BrEast cancEr hisTopathoLogy\nsEgmentation (BEETLE), a dataset for multiclass semantic segmentation of\nH&E-stained breast cancer WSIs. It consists of 587 biopsies and resections from\nthree collaborating clinical centers and two public datasets, digitized using\nseven scanners, and covers all molecular subtypes and histological grades.\nUsing diverse annotation strategies, we collected annotations across four\nclasses - invasive epithelium, non-invasive epithelium, necrosis, and other -\nwith particular focus on morphologies underrepresented in existing datasets,\nsuch as ductal carcinoma in situ and dispersed lobular tumor cells. The\ndataset's diversity and relevance to the rapidly growing field of automated\nbiomarker quantification in breast cancer ensure its high potential for reuse.\nFinally, we provide a well-curated, multicentric external evaluation set to\nenable standardized benchmarking of breast cancer segmentation models."}
{"id": "2510.02139", "pdf": "https://arxiv.org/pdf/2510.02139", "abs": "https://arxiv.org/abs/2510.02139", "authors": ["Florensia Widjaja", "Zhangtianyi Chen", "Juexiao Zhou"], "title": "BioinfoMCP: A Unified Platform Enabling MCP Interfaces in Agentic Bioinformatics", "categories": ["q-bio.QM", "cs.AI", "cs.LG", "cs.MA"], "comment": "20 pages, 8 figures, 3 tables", "summary": "Bioinformatics tools are essential for complex computational biology tasks,\nyet their integration with emerging AI-agent frameworks is hindered by\nincompatible interfaces, heterogeneous input-output formats, and inconsistent\nparameter conventions. The Model Context Protocol (MCP) provides a standardized\nframework for tool-AI communication, but manually converting hundreds of\nexisting and rapidly growing specialized bioinformatics tools into\nMCP-compliant servers is labor-intensive and unsustainable. Here, we present\nBioinfoMCP, a unified platform comprising two components: BioinfoMCP Converter,\nwhich automatically generates robust MCP servers from tool documentation using\nlarge language models, and BioinfoMCP Benchmark, which systematically validates\nthe reliability and versatility of converted tools across diverse computational\ntasks. We present a platform of 38 MCP-converted bioinformatics tools,\nextensively validated to show that 94.7% successfully executed complex\nworkflows across three widely used AI-agent platforms. By removing technical\nbarriers to AI automation, BioinfoMCP enables natural-language interaction with\nsophisticated bioinformatics analyses without requiring extensive programming\nexpertise, offering a scalable path to intelligent, interoperable computational\nbiology."}
{"id": "2510.01484", "pdf": "https://arxiv.org/pdf/2510.01484", "abs": "https://arxiv.org/abs/2510.01484", "authors": ["Michael B. Weissman"], "title": "Bayesian Re-Analysis of the Phylogenetic Topology of Early SARS-CoV-2 Case Sequences", "categories": ["q-bio.PE", "q-bio.QM"], "comment": "4642 words in main text", "summary": "A much-cited 2022 paper by Pekar et al. claimed that Bayesian analysis of the\nmolecular phylogeny of early SARS-CoV-2 cases indicated that it was more likely\nthat two successful introductions to humans had occurred than that just one\nhad. Here I show that after correcting a fundamental error in Bayesian\nreasoning the results in that paper give larger likelihood for a single\nintroduction than for two."}
{"id": "2510.01666", "pdf": "https://arxiv.org/pdf/2510.01666", "abs": "https://arxiv.org/abs/2510.01666", "authors": ["Jianxu Wang", "Ge Wang"], "title": "Median2Median: Zero-shot Suppression of Structured Noise in Images", "categories": ["eess.IV", "cs.CV", "q-bio.QM", "stat.ML"], "comment": "13 pages, 6 figures, not published yet", "summary": "Image denoising is a fundamental problem in computer vision and medical\nimaging. However, real-world images are often degraded by structured noise with\nstrong anisotropic correlations that existing methods struggle to remove. Most\ndata-driven approaches rely on large datasets with high-quality labels and\nstill suffer from limited generalizability, whereas existing zero-shot methods\navoid this limitation but remain effective only for independent and identically\ndistributed (i.i.d.) noise. To address this gap, we propose Median2Median\n(M2M), a zero-shot denoising framework designed for structured noise. M2M\nintroduces a novel sampling strategy that generates pseudo-independent\nsub-image pairs from a single noisy input. This strategy leverages directional\ninterpolation and generalized median filtering to adaptively exclude values\ndistorted by structured artifacts. To further enlarge the effective sampling\nspace and eliminate systematic bias, a randomized assignment strategy is\nemployed, ensuring that the sampled sub-image pairs are suitable for\nNoise2Noise training. In our realistic simulation studies, M2M performs on par\nwith state-of-the-art zero-shot methods under i.i.d. noise, while consistently\noutperforming them under correlated noise. These findings establish M2M as an\nefficient, data-free solution for structured noise suppression and mark the\nfirst step toward effective zero-shot denoising beyond the strict i.i.d.\nassumption."}
