{"id": "2511.07497", "pdf": "https://arxiv.org/pdf/2511.07497", "abs": "https://arxiv.org/abs/2511.07497", "authors": ["Anna Frances-Abellan", "David Endesfelder", "Alfredo Hernandez", "Gemma Armengol", "Joan Francesc Barquinero"], "title": "Biodose Tools updates for criticality accidents and interlaboratory comparisons", "categories": ["q-bio.QM"], "comment": null, "summary": "Purpose: Since its initial release, the aim of Biodose Tools was to offer an easy-to-use platform to perform the mathematical calculations needed in biological dosimetry. This update 3.7.1, mainly focuses on new features related to large-scale emergency responses, like criticality accidents dose estimation and laboratory networks. Material and Methods: Biodose Tools has been developed using the R programming language. The current version (3.7.1) uses the same external dependencies as version 3.6.1 (released November 2022) while integrating three new external packages to support the new functionalities. Results: Version 3.7.1 introduces different new modules: (a) a characteristic limits module that calculates decision thresholds and detection limits following ISO19238:2023 standards, and offers statistical tests to compare rates between suspected exposure cases and control data; (b) an enhanced dose estimation module which supports multiple dose assessments for dicentric and translocation assays for various exposure scenarios (acute, protracted, and highly protracted) as well as whole and partial-body exposures; (c) a criticality accidents module for multiple dose estimations using dicentrics in mixed gamma-neutron exposure scenarios (e.g., nuclear detonations); and (d) an Interlaboratory comparison module that automates the evaluation and comparison of dose estimates across laboratories. Conclusions: Biodose Tools (biodosetools.reneb.bfs.de) continues to evolve in response to the dynamic needs of the biological dosimetry community, contributing to the preparedness and consistency in emergency response and routine applications."}
{"id": "2511.08411", "pdf": "https://arxiv.org/pdf/2511.08411", "abs": "https://arxiv.org/abs/2511.08411", "authors": ["Perry Beamer", "Zixuan Cang"], "title": "PHD-MS: Multiscale Domain Identification for Spatial Transcriptomics via Persistent Homology", "categories": ["q-bio.QM"], "comment": null, "summary": "Spatial transcriptomics (ST) measures gene expression at a set of spatial locations in a tissue. Communities of nearby cells that express similar genes form \\textit{spatial domains}. Specialized ST clustering algorithms have been developed to identify these spatial domains. These methods often identify spatial domains at a single morphological scale, and interactions across multiple scales are often overlooked. For example, large cellular communities often contain smaller substructures, and heterogeneous frontier regions often lie between homogeneous domains. Topological data analysis (TDA) is an emerging mathematical toolkit that studies the underlying features of data at various geometric scales. It is especially useful for analyzing complex biological datasets with multiscale characteristics. Using TDA, we develop Persistent Homology for Domains at Multiple Scales (PHD-MS) to locate tissue structures that persist across morphological scales. We apply PHD-MS to highlight multiscale spatial domains in several tissue types and ST technologies. We also compare PHD-MS domains against ground-truth domains in expert-annotated tissues, where PHD-MS outperforms traditional clustering approaches. PHD-MS is available as an open-source software package with an interactive graphical user interface for exploring the identified multiscale domains."}
{"id": "2511.07624", "pdf": "https://arxiv.org/pdf/2511.07624", "abs": "https://arxiv.org/abs/2511.07624", "authors": ["Hristo Dimitrov", "Giulia Dominijanni", "Viktorija Pavalkyte", "Tamar R. Makin"], "title": "TrackStudio: An Integrated Toolkit for Markerless Tracking", "categories": ["cs.CV", "q-bio.QM"], "comment": "26 pages, 5 main text figures, 5 supplementary figures", "summary": "Markerless motion tracking has advanced rapidly in the past 10 years and currently offers powerful opportunities for behavioural, clinical, and biomechanical research. While several specialised toolkits provide high performance for specific tasks, using existing tools still requires substantial technical expertise. There remains a gap in accessible, integrated solutions that deliver sufficient tracking for non-experts across diverse settings.\n  TrackStudio was developed to address this gap by combining established open-source tools into a single, modular, GUI-based pipeline that works out of the box. It provides automatic 2D and 3D tracking, calibration, preprocessing, feature extraction, and visualisation without requiring any programming skills. We supply a user guide with practical advice for video acquisition, synchronisation, and setup, alongside documentation of common pitfalls and how to avoid them.\n  To validate the toolkit, we tested its performance across three environments using either low-cost webcams or high-resolution cameras, including challenging conditions for body position, lightning, and space and obstructions. Across 76 participants, average inter-frame correlations exceeded 0.98 and average triangulation errors remained low (<13.6mm for hand tracking), demonstrating stable and consistent tracking. We further show that the same pipeline can be extended beyond hand tracking to other body and face regions. TrackStudio provides a practical, accessible route into markerless tracking for researchers or laypeople who need reliable performance without specialist expertise."}
{"id": "2511.08554", "pdf": "https://arxiv.org/pdf/2511.08554", "abs": "https://arxiv.org/abs/2511.08554", "authors": ["Sara Maria Brancato", "Davide Salzano", "Davide Fiore", "Francesco De Lellis", "Giovanni Russo", "Mario di Bernardo"], "title": "A bioreactor-based architecture for in vivo model-based and sim-to-real learning control of microbial consortium composition", "categories": ["eess.SY", "q-bio.QM"], "comment": null, "summary": "Microbial consortia offer significant biotechnological advantages over monocultures for bioproduction. However, industrial deployment is hampered by the lack of scalable architectures to ensure stable coexistence between populations. Existing strategies rely on genetic modifications, which impose metabolic load, or environmental changes, which can reduce production. We present a versatile control architecture to regulate density and composition of a two-strain consortium without genetic engineering or drastic environmental changes. Our bioreactor-based control architecture comprises a mixing chamber where both strains are co-cultured and a reservoir sustaining the slower-growing strain. For both chambers we develop model-based and sim-to-real learning controllers. The control architecture is then validated in vivo on a two-strain Escherichia coli consortium, achieving precise and robust regulation of consortium density and composition, including tracking of time-varying references and recovery from perturbations."}
