{"id": "2511.00057", "pdf": "https://arxiv.org/pdf/2511.00057", "abs": "https://arxiv.org/abs/2511.00057", "authors": ["Yukun Guo", "An-Lun Wu", "Tristan T. Hormel", "Liqin Gao", "Min Gao", "Thomas S. Hwang", "Steven T. Bailey", "Yali Jia"], "title": "AI-derived layer-specific OCT biomarkers for classification of geographic atrophy", "categories": ["q-bio.QM"], "comment": "12 pages, 5 figures", "summary": "Geographic atrophy (GA) is a key biomarker of dry age-related macular\ndegeneration (AMD) traditionally identified through color fundus photography.\nHyper-transmission defects (hyperTDs), a feature highly correlated with GA,\nhave recently gained prominence in optical coherence tomography (OCT) research.\nOCT offers cross-sectional imaging of the retina, leading to the development of\nthe terms complete retinal pigment epithelium and outer retinal atrophy (cRORA)\nto describe specific patterns of structural degeneration. Within the\ndefinitions of cRORA three critical lesions are implicated: inner nuclear layer\nand outer plexiform layer (INL-OPL) subsidence, ellipsoid zone and retinal\npigment epithelium (EZ-RPE) disruption, and hyperTDs. To enable the automated\nquantification of retinal atrophy progression, we propose an AI-based model\nthat segments INL-OPL subsidence, EZ-RPE disruption, and hyperTDs.\nAdditionally, we developed an algorithm that leverages these segmentation\nresults to distinguish cRORA from hyperTDs in the absence of GA. We evaluated\nour approach on a comprehensive dataset of eyes with AMD and healthy eyes,\nachieving mean voxel-level F1-scores of 0.76/0.13 (mean/standard deviation) for\nINL-OPL subsidence, 0.64/0.15 for EZ-RPE disruption, and 0.69/0.04 for\nhyperTDs. For distinguishing cRORA from hyperTDs, we achieved an average\npixel-level F1-score of 0.80/0.12 for segment cRORA from hyperTDs. This method\ndemonstrates significant advances in the quantitative analysis of retinal\natrophy, offering a promising tool for improved AMD diagnosis and disease\nprogression monitoring."}
{"id": "2511.00119", "pdf": "https://arxiv.org/pdf/2511.00119", "abs": "https://arxiv.org/abs/2511.00119", "authors": ["Mengbo Wang", "Shourya Verma", "Aditya Malusare", "Luopin Wang", "Yiyang Lu", "Vaneet Aggarwal", "Mario Sola", "Ananth Grama", "Nadia Atallah Lanman"], "title": "GeneFlow: Translation of Single-cell Gene Expression to Histopathological Images via Rectified Flow", "categories": ["q-bio.QM", "cs.CV"], "comment": null, "summary": "Spatial transcriptomics (ST) technologies can be used to align transcriptomes\nwith histopathological morphology, presenting exciting new opportunities for\nbiomolecular discovery. Using ST data, we construct a novel framework,\nGeneFlow, to map transcriptomics onto paired cellular images. By combining an\nattention-based RNA encoder with a conditional UNet guided by rectified flow,\nwe generate high-resolution images with different staining methods (e.g. H&E,\nDAPI) to highlight various cellular/tissue structures. Rectified flow with\nhigh-order ODE solvers creates a continuous, bijective mapping between\ntranscriptomics and image manifolds, addressing the many-to-one relationship\ninherent in this problem. Our method enables the generation of realistic\ncellular morphology features and spatially resolved intercellular interactions\nfrom observational gene expression profiles, provides potential to incorporate\ngenetic/chemical perturbations, and enables disease diagnosis by revealing\ndysregulated patterns in imaging phenotypes. Our rectified flow-based method\noutperforms diffusion-based baseline method in all experiments. Code can be\nfound at https://github.com/wangmengbo/GeneFlow."}
{"id": "2511.00507", "pdf": "https://arxiv.org/pdf/2511.00507", "abs": "https://arxiv.org/abs/2511.00507", "authors": ["Chenghang Li", "Jinzhi Lei"], "title": "Mathematical modeling of tumor-immune interactions: methods, applications, and future perspectives", "categories": ["q-bio.QM", "92C42, 92B05, 92B10"], "comment": "72 pages, 11 figures", "summary": "Mathematical oncology is a rapidly evolving interdisciplinary field that uses\nmathematical models to enhance our understanding of cancer dynamics, including\ntumor growth, metastasis, and treatment response. Tumor-immune interactions\nplay a crucial role in cancer biology, influencing tumor progression and the\neffectiveness of immunotherapy and targeted treatments. However, studying tumor\ndynamics in isolation often fails to capture the complex interplay between\ncancer cells and the immune system, which is critical to disease progression\nand therapeutic efficacy. Mathematical models that incorporate tumor-immune\ninteractions offer valuable insights into these processes, providing a\nframework for analyzing immune escape, treatment response, and resistance\nmechanisms. In this review, we provide an overview of mathematical models that\ndescribe tumor-immune dynamics, highlighting their applications in\nunderstanding tumor growth, evaluating treatment strategies, and predicting\nimmune responses. We also discuss the strengths and limitations of current\nmodeling approaches and propose future directions for the development of more\ncomprehensive and predictive models of tumor-immune interactions. We aim to\noffer a comprehensive guide to the state of mathematical modeling in tumor\nimmunology, emphasizing its potential to inform clinical decision-making and\nimprove cancer therapies."}
{"id": "2511.01171", "pdf": "https://arxiv.org/pdf/2511.01171", "abs": "https://arxiv.org/abs/2511.01171", "authors": ["Jingyuan Li"], "title": "STELLAR-koff: A Transfer Learning Model for Protein-Ligand Dissociation Rate Constant Prediction Based on Interaction Landscape", "categories": ["q-bio.QM"], "comment": null, "summary": "The key to successful drug design lies in the correct comprehension of\nprotein-ligand interactions. Within the current knowledge paragm, these\ninteractions can be described from both thermodynamic and kinetic perspectives.\nIn recent years, many deep learning models have emerged for predicting the\nthermodynamic properties of protein-ligand interactions. However, there is\ncurrently no mature model for predicting kinetic properties, primarily due to\nlack of kinetic data. To tackle this problem, we have developed a graph neural\nnetwork model called STELLAR-koff (Structure-based TransfEr Learning for Ligand\nActivity Regression) to predict protein-ligand dissociation rate constant.\nUnlike traditional protein-ligand property prediction models, which typically\nuse a single complex conformation as input, STELLAR-koff employs transfer\nlearning to transform multiple ligand conformations within the protein into a\nprotein ligand interaction landscape, and uses this landscape as the primary\ninput for the model. In addition, we expanded the PDBbind koff dataset from 680\nto 1,197 entries and employed the augmented dataset for model training and\ntesting. When tested through five-fold cross-validation, STELLAR-koff achieved\nPearson correlation coefficient of 0.729 surpassing or being on pair with most\nof the published prediction methods. Tested on external set, STELLAR-koff\ndemonstrated strong predictive performance on unseen protein, achieving a\nPearson of 0.838 on the focal adhesion kinase in particular. Experimental\nvalidation on cyclin-dependent kinase also demonstrated the effectiveness of\nSTELLAR-koff in real drug discovering scenarios. We believe this study provides\nan effective tool for predicting protein-ligand dissociation rate constant and\noffers new insight for the future development of this field."}
{"id": "2511.00209", "pdf": "https://arxiv.org/pdf/2511.00209", "abs": "https://arxiv.org/abs/2511.00209", "authors": ["Yiquan Wang", "Yahui Ma", "Yuhan Chang", "Jiayao Yan", "Jialin Zhang", "Minnuo Cai", "Kai Wei"], "title": "Diffusion Models at the Drug Discovery Frontier: A Review on Generating Small Molecules versus Therapeutic Peptides", "categories": ["cs.LG", "cs.AI", "q-bio.BM", "q-bio.QM"], "comment": "21 pages, 3 figures", "summary": "Diffusion models have emerged as a leading framework in generative modeling,\nshowing significant potential to accelerate and transform the traditionally\nslow and costly process of drug discovery. This review provides a systematic\ncomparison of their application in designing two principal therapeutic\nmodalities: small molecules and therapeutic peptides. We analyze how a unified\nframework of iterative denoising is adapted to the distinct molecular\nrepresentations, chemical spaces, and design objectives of each modality. For\nsmall molecules, these models excel at structure-based design, generating\nnovel, pocket-fitting ligands with desired physicochemical properties, yet face\nthe critical hurdle of ensuring chemical synthesizability. Conversely, for\ntherapeutic peptides, the focus shifts to generating functional sequences and\ndesigning de novo structures, where the primary challenges are achieving\nbiological stability against proteolysis, ensuring proper folding, and\nminimizing immunogenicity. Despite these distinct challenges, both domains face\nshared hurdles: the need for more accurate scoring functions, the scarcity of\nhigh-quality experimental data, and the crucial requirement for experimental\nvalidation. We conclude that the full potential of diffusion models will be\nunlocked by bridging these modality-specific gaps and integrating them into\nautomated, closed-loop Design-Build-Test-Learn (DBTL) platforms, thereby\nshifting the paradigm from chemical exploration to the targeted creation of\nnovel therapeutics."}
{"id": "2511.00326", "pdf": "https://arxiv.org/pdf/2511.00326", "abs": "https://arxiv.org/abs/2511.00326", "authors": ["Stephen Williams", "Kyra Alexa Ruiz", "Elizabeth Heath-Heckman", "Erica M. Rutter", "Shilpa Khatri"], "title": "Thermal Stress Disrupts Symbiotic Fluid Dynamics in Bobtail Squid", "categories": ["physics.bio-ph", "q-bio.QM"], "comment": "24 pages, 7 figures; 5 supplementary pages, 3 supplemental figures", "summary": "The impact of thermal stress on beneficial symbiosis, in the face of rapid\nclimate change, remains poorly understood. We investigate this using the model\nsystem, Euprymna scolopes, the Hawaiian Bobtail Squid, and its bioluminescent\nsymbiont, Vibrio fischeri, which enables the squid to camouflage itself through\ncounter-illumination. Successful colonisation of the squid by V. fischeri must\noccur hours after hatching and is mediated by fluid flow due to respiration\nwithin the squid mantle cavity. To study this process, we develop a\nmathematical model using the Method of Regularised Stokeslets to simulate the\nflow and resulting bacterial trajectories within the squid. We explore how\nthermal stress, mediated by physiological changes in respiration, ciliary\ndynamics, and internal geometry, affects this early colonisation by analysing\nthe time bacteria spend in regions crucial to the establishment of symbiosis in\nthese simulations. A variance-based sensitivity analysis of physiologically\nrelevant parameters on these metrics demonstrates that changes in the breath\ncycle significantly impact and reduce the time bacteria spend in the critical\nzone within the squid, hindering colonisation."}
{"id": "2511.00579", "pdf": "https://arxiv.org/pdf/2511.00579", "abs": "https://arxiv.org/abs/2511.00579", "authors": ["G. Pillonetto", "A. Giaretta", "A. Aravkin", "M. Bisiacco", "T. Elston"], "title": "Sparse and nonparametric estimation of equations governing dynamical systems with applications to biology", "categories": ["cs.LG", "q-bio.QM", "stat.ML"], "comment": null, "summary": "Data-driven discovery of model equations is a powerful approach for\nunderstanding the behavior of dynamical systems in many scientific fields. In\nparticular, the ability to learn mathematical models from data would benefit\nsystems biology, where the complex nature of these systems often makes a bottom\nup approach to modeling unfeasible. In recent years, sparse estimation\ntechniques have gained prominence in system identification, primarily using\nparametric paradigms to efficiently capture system dynamics with minimal model\ncomplexity. In particular, the Sindy algorithm has successfully used sparsity\nto estimate nonlinear systems by extracting from a library of functions only a\nfew key terms needed to capture the dynamics of these systems. However,\nparametric models often fall short in accurately representing certain\nnonlinearities inherent in complex systems. To address this limitation, we\nintroduce a novel framework that integrates sparse parametric estimation with\nnonparametric techniques. It captures nonlinearities that Sindy cannot describe\nwithout requiring a priori information about their functional form. That is,\nwithout expanding the library of functions to include the one that is trying to\nbe discovered. We illustrate our approach on several examples related to\nestimation of complex biological phenomena."}
{"id": "2511.00775", "pdf": "https://arxiv.org/pdf/2511.00775", "abs": "https://arxiv.org/abs/2511.00775", "authors": ["Mingyang Li", "Yu'an Li", "H. P. Zhang", "Yongfeng Zhao"], "title": "Detecting active Lévy particles using differential dynamic microscopy", "categories": ["cond-mat.soft", "q-bio.QM"], "comment": "11 pages, 5 figures", "summary": "Detecting L\\'evy flights of cells has been a challenging problem in\nexperiments. The challenge lies in accessing data in spatiotemporal scales\nacross orders of magnitude, which is necessary for reliably extracting a\npower-law scaling. Differential dynamic microscopy has been shown to be a\npowerful method that allows one to acquire statistics of cell motion across\nscales, which is a potentially versatile method for detecting L\\'evy walks in\nbiological systems. In this article, we extend the differential dynamic\nmicroscopy method to self-propelled L\\'evy particles, whose run-time\ndistribution has a algebraic tail. We validate our protocol using synthetic\nimaging data and show that a reliable detection of active L\\'evy particles\nrequires accessing length scales of one order of magnitude larger than its\npersistence length. Applying the protocol to experimental data of E. coli and\nE. gracilis, we find that E. coli exhibits no signature of L\\'evy walks, while\nE. gracilis is better described as active L\\'evy particles."}
{"id": "2511.00977", "pdf": "https://arxiv.org/pdf/2511.00977", "abs": "https://arxiv.org/abs/2511.00977", "authors": ["Kristiyan Sakalyan", "Alessandro Palma", "Filippo Guerranti", "Fabian J. Theis", "Stephan Günnemann"], "title": "Modeling Microenvironment Trajectories on Spatial Transcriptomics with NicheFlow", "categories": ["cs.LG", "q-bio.QM"], "comment": "37 pages, 15 figures, to appear in NeurIPS 2025", "summary": "Understanding the evolution of cellular microenvironments in spatiotemporal\ndata is essential for deciphering tissue development and disease progression.\nWhile experimental techniques like spatial transcriptomics now enable\nhigh-resolution mapping of tissue organization across space and time, current\nmethods that model cellular evolution operate at the single-cell level,\noverlooking the coordinated development of cellular states in a tissue. We\nintroduce NicheFlow, a flow-based generative model that infers the temporal\ntrajectory of cellular microenvironments across sequential spatial slides. By\nrepresenting local cell neighborhoods as point clouds, NicheFlow jointly models\nthe evolution of cell states and spatial coordinates using optimal transport\nand Variational Flow Matching. Our approach successfully recovers both global\nspatial architecture and local microenvironment composition across diverse\nspatiotemporal datasets, from embryonic to brain development."}
{"id": "2511.01277", "pdf": "https://arxiv.org/pdf/2511.01277", "abs": "https://arxiv.org/abs/2511.01277", "authors": ["Annabelle Martin", "Daphne Kontogiorgos-Heintz", "Jeff Nivala"], "title": "Identification of Capture Phases in Nanopore Protein Sequencing Data Using a Deep Learning Model", "categories": ["cs.LG", "q-bio.QM"], "comment": null, "summary": "Nanopore protein sequencing produces long, noisy ionic current traces in\nwhich key molecular phases, such as protein capture and translocation, are\nembedded. Capture phases mark the successful entry of a protein into the pore\nand serve as both a checkpoint and a signal that a channel merits further\nanalysis. However, manual identification of capture phases is time-intensive,\noften requiring several days for expert reviewers to annotate the data due to\nthe need for domain-specific interpretation of complex signal patterns. To\naddress this, a lightweight one-dimensional convolutional neural network (1D\nCNN) was developed and trained to detect capture phases in down-sampled signal\nwindows. Evaluated against CNN-LSTM (Long Short-Term Memory) hybrids,\nhistogram-based classifiers, and other CNN variants using run-level data\nsplits, our best model, CaptureNet-Deep, achieved an F1 score of 0.94 and\nprecision of 93.39% on held-out test data. The model supports low-latency\ninference and is integrated into a dashboard for Oxford Nanopore experiments,\nreducing the total analysis time from several days to under thirty minutes.\nThese results show that efficient, real-time capture detection is possible\nusing simple, interpretable architectures and suggest a broader role for\nlightweight ML models in sequencing workflows."}
{"id": "2511.01732", "pdf": "https://arxiv.org/pdf/2511.01732", "abs": "https://arxiv.org/abs/2511.01732", "authors": ["Liangkang Wang", "Akhil Ambekar", "Ani Eloyan"], "title": "Geometric Modeling of Hippocampal Tau Deposition: A Surface-Based Framework for Covariate Analysis and Off-Target Contamination Detection", "categories": ["stat.AP", "q-bio.QM", "stat.OT"], "comment": null, "summary": "We introduce a framework combining geometric modeling with disease\nprogression analysis to investigate tau deposition in Alzheimer's disease (AD)\nusing positron emission tomography (PET) data. Focusing on the hippocampus, we\nconstruct a principal surface that captures the spatial distribution and\nmorphological changes of tau pathology. By projecting voxels onto this surface,\nwe quantify tau coverage, intensity, and thickness through bidirectional\nprojection distances and interpolated standardized uptake value ratios (SUVR).\nThis low-dimensional embedding preserves spatial specificity while mitigating\nmultiple comparison issues. Covariate effects are analyzed using a two-stage\nregression model with inverse probability weighting to adjust for signal\nsparsity and selection bias. Using the SuStaIn model, we identify subtypes and\nstages of AD, revealing distinct tau dynamics: the limbic-predominant subtype\nshows age-related nonlinear accumulation in coverage and thickness, whereas the\nposterior subtype exhibits uniform SUVR increases across disease progression.\nModel-based predictions show that hippocampal tau deposition follows a\nstructured spatial trajectory expanding bidirectionally with increasing\nthickness, while subtype differences highlight posterior hippocampal\ninvolvement consistent with whole-brain patterns. Finally, directional signal\npatterns on the principal surface reveal contamination from the choroid plexus,\ndemonstrating the broader applicability of the proposed framework across\nmodalities including amyloid PET."}
