{"id": "2506.21641", "pdf": "https://arxiv.org/pdf/2506.21641", "abs": "https://arxiv.org/abs/2506.21641", "authors": ["Don Roosan", "Rubayat Khan", "Md Rahatul Ashakin", "Tiffany Khou", "Saif Nirzhor", "Mohammad Rifat Haider"], "title": "Quantum Variational Transformer Model for Enhanced Cancer Classification", "categories": ["q-bio.QM"], "comment": "Conference information can be found here: https://ieai.net/prog.html", "summary": "Accurate prediction of cancer type and primary tumor site is critical for\neffective diagnosis, personalized treatment, and improved outcomes. Traditional\nmodels struggle with the complexity of genomic and clinical data, but quantum\ncomputing offers enhanced computational capabilities. This study develops a\nhybrid quantum-classical transformer model, incorporating quantum attention\nmechanisms via variational quantum circuits (VQCs) to improve prediction\naccuracy. Using 30,000 anonymized cancer samples from the Genome Warehouse\n(GWH), data preprocessing included cleaning, encoding, and feature selection.\nClassical self-attention modules were replaced with quantum attention layers,\nwith classical data encoded into quantum states via amplitude encoding. The\nmodel, trained using hybrid backpropagation and quantum gradient calculations,\noutperformed the classical transformer model, achieving 92.8% accuracy and an\nAUC of 0.96 compared to 87.5% accuracy and an AUC of 0.89. It also demonstrated\n35% faster training and 25% fewer parameters, highlighting computational\nefficiency. These findings showcase the potential of quantum-enhanced\ntransformers to advance biomedical data analysis, enabling more accurate\ndiagnostics and personalized medicine."}
{"id": "2506.21943", "pdf": "https://arxiv.org/pdf/2506.21943", "abs": "https://arxiv.org/abs/2506.21943", "authors": ["Seongyu Park", "Inho Yang", "Jinseob Lee", "Sinwoo Kim", "Juana Martín-López", "Richard Fishel", "Jong-Bong Lee", "Jae-Hyung Jeon"], "title": "Single-Trajectory Bayesian Modeling Reveals Multi-State Diffusion of the MSH Sliding Clamp", "categories": ["physics.bio-ph", "q-bio.QM"], "comment": null, "summary": "DNA mismatch repair (MMR) is the essential mechanism for preserving genomic\nintegrity in various living organisms. In this process, MutS homologs (MSH)\nplay crucial roles in identifying mismatched basepairs and recruiting\ndownstream MMR proteins. The MSH protein exhibits distinct functions and\ndiffusion dynamics before and after the recognition of mismatches while\ntraversing along DNA. An ADP-bound MSH, known as the MSH searching clamp, scans\nDNA sequences via rotational diffusion along the DNA backbone. Upon recognizing\na mismatch, the MSH combines with ATP molecules, forming a stable sliding\nclamp. Recent experimental evidence challenges the conventional view that the\nsliding clamp performs a simple Brownian motion. In this study, we explore the\ndiffusion dynamics of the ATP-bound MSH sliding clamp through single-particle\ntracking experiments and introduce a Bayesian single-trajectory modeling\nframework to analyze its motion. Our quantitative analysis reveals that the\ndiffusion characteristics defy explanation by a single-state diffusion\nmechanism. Instead, our in-depth model inference uncovers three distinct\ndiffusion states, each characterized by specific diffusion coefficients. These\nstates alternate over time, with cross-state transitions predominantly\ninvolving one intermediate state, and direct transitions between the slowest\nand the fastest states being scarce. We propose that these multi-state dynamics\nreflect underlying conformational changes in the MSH sliding clamp,\nhighlighting a more intricate diffusion mechanism than previously appreciated."}
