{"id": "2508.04739", "pdf": "https://arxiv.org/pdf/2508.04739", "abs": "https://arxiv.org/abs/2508.04739", "authors": ["Shiyi Du", "Litian Liang", "Jiayi Li", "Carl Kingsford"], "title": "CodonMoE: DNA Language Models for mRNA Analyses", "categories": ["q-bio.GN", "cs.LG"], "comment": null, "summary": "Genomic language models (gLMs) face a fundamental efficiency challenge:\neither maintain separate specialized models for each biological modality (DNA\nand RNA) or develop large multi-modal architectures. Both approaches impose\nsignificant computational burdens - modality-specific models require redundant\ninfrastructure despite inherent biological connections, while multi-modal\narchitectures demand massive parameter counts and extensive cross-modality\npretraining. To address this limitation, we introduce CodonMoE (Adaptive\nMixture of Codon Reformative Experts), a lightweight adapter that transforms\nDNA language models into effective RNA analyzers without RNA-specific\npretraining. Our theoretical analysis establishes CodonMoE as a universal\napproximator at the codon level, capable of mapping arbitrary functions from\ncodon sequences to RNA properties given sufficient expert capacity. Across four\nRNA prediction tasks spanning stability, expression, and regulation, DNA models\naugmented with CodonMoE significantly outperform their unmodified counterparts,\nwith HyenaDNA+CodonMoE series achieving state-of-the-art results using 80%\nfewer parameters than specialized RNA models. By maintaining sub-quadratic\ncomplexity while achieving superior performance, our approach provides a\nprincipled path toward unifying genomic language modeling, leveraging more\nabundant DNA data and reducing computational overhead while preserving\nmodality-specific performance advantages."}
{"id": "2508.04742", "pdf": "https://arxiv.org/pdf/2508.04742", "abs": "https://arxiv.org/abs/2508.04742", "authors": ["Ke Chen", "Haohan Wang"], "title": "Discovery of Disease Relationships via Transcriptomic Signature Analysis Powered by Agentic AI", "categories": ["q-bio.GN", "cs.LG"], "comment": null, "summary": "Modern disease classification often overlooks molecular commonalities hidden\nbeneath divergent clinical presentations. This study introduces a\ntranscriptomics-driven framework for discovering disease relationships by\nanalyzing over 1300 disease-condition pairs using GenoMAS, a fully automated\nagentic AI system. Beyond identifying robust gene-level overlaps, we develop a\nnovel pathway-based similarity framework that integrates multi-database\nenrichment analysis to quantify functional convergence across diseases. The\nresulting disease similarity network reveals both known comorbidities and\npreviously undocumented cross-category links. By examining shared biological\npathways, we explore potential molecular mechanisms underlying these\nconnections-offering functional hypotheses that go beyond symptom-based\ntaxonomies. We further show how background conditions such as obesity and\nhypertension modulate transcriptomic similarity, and identify therapeutic\nrepurposing opportunities for rare diseases like autism spectrum disorder based\non their molecular proximity to better-characterized conditions. In addition,\nthis work demonstrates how biologically grounded agentic AI can scale\ntranscriptomic analysis while enabling mechanistic interpretation across\ncomplex disease landscapes. All results are publicly accessible at\ngithub.com/KeeeeChen/Pathway_Similarity_Network."}
{"id": "2508.04747", "pdf": "https://arxiv.org/pdf/2508.04747", "abs": "https://arxiv.org/abs/2508.04747", "authors": ["Tianxiang Hu", "Chenyi Zhou", "Jiaxiang Liu", "Jiongxin Wang", "Ruizhe Chen", "Haoxiang Xia", "Gaoang Wang", "Jian Wu", "Zuozhu Liu"], "title": "GRIT: Graph-Regularized Logit Refinement for Zero-shot Cell Type Annotation", "categories": ["q-bio.GN", "cs.LG"], "comment": null, "summary": "Cell type annotation is a fundamental step in the analysis of single-cell RNA\nsequencing (scRNA-seq) data. In practice, human experts often rely on the\nstructure revealed by principal component analysis (PCA) followed by\n$k$-nearest neighbor ($k$-NN) graph construction to guide annotation. While\neffective, this process is labor-intensive and does not scale to large\ndatasets. Recent advances in CLIP-style models offer a promising path toward\nautomating cell type annotation. By aligning scRNA-seq profiles with natural\nlanguage descriptions, models like LangCell enable zero-shot annotation. While\nLangCell demonstrates decent zero-shot performance, its predictions remain\nsuboptimal, particularly in achieving consistent accuracy across all cell\ntypes. In this paper, we propose to refine the zero-shot logits produced by\nLangCell through a graph-regularized optimization framework. By enforcing local\nconsistency over the task-specific PCA-based k-NN graph, our method combines\nthe scalability of the pre-trained models with the structural robustness relied\nupon in expert annotation. We evaluate our approach on 14 annotated human\nscRNA-seq datasets from 4 distinct studies, spanning 11 organs and over 200,000\nsingle cells. Our method consistently improves zero-shot annotation accuracy,\nachieving accuracy gains of up to 10%. Further analysis showcase the mechanism\nby which GRIT effectively propagates correct signals through the graph, pulling\nback mislabeled cells toward more accurate predictions. The method is\ntraining-free, model-agnostic, and serves as a simple yet effective plug-in for\nenhancing automated cell type annotation in practice."}
{"id": "2508.04757", "pdf": "https://arxiv.org/pdf/2508.04757", "abs": "https://arxiv.org/abs/2508.04757", "authors": ["Nirjhor Datta", "Swakkhar Shatabda", "M Sohel Rahman"], "title": "Embedding Is (Almost) All You Need: Retrieval-Augmented Inference for Generalizable Genomic Prediction Tasks", "categories": ["q-bio.GN", "cs.LG"], "comment": null, "summary": "Large pre-trained DNA language models such as DNABERT-2, Nucleotide\nTransformer, and HyenaDNA have demonstrated strong performance on various\ngenomic benchmarks. However, most applications rely on expensive fine-tuning,\nwhich works best when the training and test data share a similar distribution.\nIn this work, we investigate whether task-specific fine-tuning is always\nnecessary. We show that simple embedding-based pipelines that extract fixed\nrepresentations from these models and feed them into lightweight classifiers\ncan achieve competitive performance. In evaluation settings with different data\ndistributions, embedding-based methods often outperform fine-tuning while\nreducing inference time by 10x to 20x. Our results suggest that embedding\nextraction is not only a strong baseline but also a more generalizable and\nefficient alternative to fine-tuning, especially for deployment in diverse or\nunseen genomic contexts. For example, in enhancer classification, HyenaDNA\nembeddings combined with zCurve achieve 0.68 accuracy (vs. 0.58 for\nfine-tuning), with an 88% reduction in inference time and over 8x lower carbon\nemissions (0.02 kg vs. 0.17 kg CO2). In non-TATA promoter classification,\nDNABERT-2 embeddings with zCurve or GC content reach 0.85 accuracy (vs. 0.89\nwith fine-tuning) with a 22x lower carbon footprint (0.02 kg vs. 0.44 kg CO2).\nThese results show that embedding-based pipelines offer over 10x better carbon\nefficiency while maintaining strong predictive performance. The code is\navailable here:\nhttps://github.com/NIRJHOR-DATTA/EMBEDDING-IS-ALMOST-ALL-YOU-NEED."}
{"id": "2508.04743", "pdf": "https://arxiv.org/pdf/2508.04743", "abs": "https://arxiv.org/abs/2508.04743", "authors": ["Debanjan Konar", "Neerav Sreekumar", "Richard Jiang", "Vaneet Aggarwal"], "title": "Alz-QNet: A Quantum Regression Network for Studying Alzheimer's Gene Interactions", "categories": ["q-bio.MN", "cs.LG", "q-bio.GN", "quant-ph"], "comment": null, "summary": "Understanding the molecular-level mechanisms underpinning Alzheimer's disease\n(AD) by studying crucial genes associated with the disease remains a challenge.\nAlzheimer's, being a multifactorial disease, requires understanding the\ngene-gene interactions underlying it for theranostics and progress. In this\narticle, a novel attempt has been made using a quantum regression to decode how\nsome crucial genes in the AD Amyloid Beta Precursor Protein ($APP$), Sterol\nregulatory element binding transcription factor 14 ($FGF14$), Yin Yang 1\n($YY1$), and Phospholipase D Family Member 3 ($PLD3$) etc. become influenced by\nother prominent switching genes during disease progression, which may help in\ngene expression-based therapy for AD. Our proposed Quantum Regression Network\n(Alz-QNet) introduces a pioneering approach with insights from the\nstate-of-the-art Quantum Gene Regulatory Networks (QGRN) to unravel the gene\ninteractions involved in AD pathology, particularly within the Entorhinal\nCortex (EC), where early pathological changes occur. Using the proposed\nAlz-QNet framework, we explore the interactions between key genes ($APP$,\n$FGF14$, $YY1$, $EGR1$, $GAS7$, $AKT3$, $SREBF2$, and $PLD3$) within the CE\nmicroenvironment of AD patients, studying genetic samples from the database\n$GSE138852$, all of which are believed to play a crucial role in the\nprogression of AD. Our investigation uncovers intricate gene-gene interactions,\nshedding light on the potential regulatory mechanisms that underlie the\npathogenesis of AD, which help us to find potential gene inhibitors or\nregulators for theranostics."}
{"id": "2508.04724", "pdf": "https://arxiv.org/pdf/2508.04724", "abs": "https://arxiv.org/abs/2508.04724", "authors": ["Timothy Fei Truong Jr", "Tristan Bepler"], "title": "Understanding protein function with a multimodal retrieval-augmented foundation model", "categories": ["q-bio.QM", "cs.LG"], "comment": null, "summary": "Protein language models (PLMs) learn probability distributions over natural\nprotein sequences. By learning from hundreds of millions of natural protein\nsequences, protein understanding and design capabilities emerge. Recent works\nhave shown that scaling these models improves structure prediction, but does\nnot seem to improve mutation understanding and representation quality for\nprotein function prediction. We introduce PoET-2, a multimodal,\nretrieval-augmented protein foundation model that incorporates in-context\nlearning of family-specific evolutionary constraints with optional structure\nconditioning to learn generative distributions over protein sequences. PoET-2\nuses a hierarchical transformer encoder that is equivariant to sequence context\nordering and a dual decoder architecture with both causal and masked language\nmodeling objectives, allowing PoET-2 to operate in both fully generative and\nbidirectional representation learning modes. PoET-2 achieves state-of-the-art\nperformance on zero-shot variant effect prediction, excelling at scoring\nvariants with multiple mutations and challenging indel mutations. In supervised\nsettings, PoET-2 embeddings outperform previous methods for learning\nsequence-function relationships, especially with small datasets. This work\nhighlights the benefits of combining retrieval augmentation with multimodal,\nfamily-centric modeling for advancing protein foundation models."}
{"id": "2508.04743", "pdf": "https://arxiv.org/pdf/2508.04743", "abs": "https://arxiv.org/abs/2508.04743", "authors": ["Debanjan Konar", "Neerav Sreekumar", "Richard Jiang", "Vaneet Aggarwal"], "title": "Alz-QNet: A Quantum Regression Network for Studying Alzheimer's Gene Interactions", "categories": ["q-bio.MN", "cs.LG", "q-bio.GN", "quant-ph"], "comment": null, "summary": "Understanding the molecular-level mechanisms underpinning Alzheimer's disease\n(AD) by studying crucial genes associated with the disease remains a challenge.\nAlzheimer's, being a multifactorial disease, requires understanding the\ngene-gene interactions underlying it for theranostics and progress. In this\narticle, a novel attempt has been made using a quantum regression to decode how\nsome crucial genes in the AD Amyloid Beta Precursor Protein ($APP$), Sterol\nregulatory element binding transcription factor 14 ($FGF14$), Yin Yang 1\n($YY1$), and Phospholipase D Family Member 3 ($PLD3$) etc. become influenced by\nother prominent switching genes during disease progression, which may help in\ngene expression-based therapy for AD. Our proposed Quantum Regression Network\n(Alz-QNet) introduces a pioneering approach with insights from the\nstate-of-the-art Quantum Gene Regulatory Networks (QGRN) to unravel the gene\ninteractions involved in AD pathology, particularly within the Entorhinal\nCortex (EC), where early pathological changes occur. Using the proposed\nAlz-QNet framework, we explore the interactions between key genes ($APP$,\n$FGF14$, $YY1$, $EGR1$, $GAS7$, $AKT3$, $SREBF2$, and $PLD3$) within the CE\nmicroenvironment of AD patients, studying genetic samples from the database\n$GSE138852$, all of which are believed to play a crucial role in the\nprogression of AD. Our investigation uncovers intricate gene-gene interactions,\nshedding light on the potential regulatory mechanisms that underlie the\npathogenesis of AD, which help us to find potential gene inhibitors or\nregulators for theranostics."}
{"id": "2508.05136", "pdf": "https://arxiv.org/pdf/2508.05136", "abs": "https://arxiv.org/abs/2508.05136", "authors": ["Lukas Madsen Brandt", "Katja Nowick", "Jing Qin"], "title": "GCnet: Using Granger causality to explore the dynamic causality relations among genes as-sociated with intellectual disability in human brain", "categories": ["q-bio.MN"], "comment": null, "summary": "Intellectual disability (ID) is defined by an IQ under 70, in addition to\ndeficits in two or more adaptive behaviors that affect everyday living.\nThroughout history, individuals with ID have often been margin-alized from\nsociety and continue to suffer significantly even in modern times. A varying\nproportion of ID cases are attributable to genetic causes. Identifying the\ncausal relation among these ID-associated genes and their gene expression\npattern during brain development process would gain us a better understanding\nof the molecular basis of ID. In this paper, we interpret gene expression data\ncollected at different time points during the in vitro brain development\nprocess as time series and further introduce Granger causality test to evaluate\nthe dynamic dependence relations among genes. These evaluations are used as\ninput to construct gene expression network and extract the pathological\ninformation associated to ID including identi-fying new genes that can be\ncritically related to the disease. To demonstrate our methods, we pro-vide a\npriority list of new genes that are most likely associated with Mowat Wilson\nSyndrome via monitoring the community structure of ZEB2 in our Granger\ncausality network constructed based on the Kutsche dataset (Kutsche, et al.,\n2018)."}
{"id": "2508.04734", "pdf": "https://arxiv.org/pdf/2508.04734", "abs": "https://arxiv.org/abs/2508.04734", "authors": ["Jillur Rahman Saurav", "Mohammad Sadegh Nasr", "Jacob M. Luber"], "title": "Cross-Domain Image Synthesis: Generating H&E from Multiplex Biomarker Imaging", "categories": ["q-bio.QM", "cs.AI", "eess.IV"], "comment": null, "summary": "While multiplex immunofluorescence (mIF) imaging provides deep,\nspatially-resolved molecular data, integrating this information with the\nmorphological standard of Hematoxylin & Eosin (H&E) can be very important for\nobtaining complementary information about the underlying tissue. Generating a\nvirtual H&E stain from mIF data offers a powerful solution, providing immediate\nmorphological context. Crucially, this approach enables the application of the\nvast ecosystem of H&E-based computer-aided diagnosis (CAD) tools to analyze\nrich molecular data, bridging the gap between molecular and morphological\nanalysis. In this work, we investigate the use of a multi-level\nVector-Quantized Generative Adversarial Network (VQGAN) to create high-fidelity\nvirtual H&E stains from mIF images. We rigorously evaluated our VQGAN against a\nstandard conditional GAN (cGAN) baseline on two publicly available colorectal\ncancer datasets, assessing performance on both image similarity and functional\nutility for downstream analysis. Our results show that while both architectures\nproduce visually plausible images, the virtual stains generated by our VQGAN\nprovide a more effective substrate for computer-aided diagnosis. Specifically,\ndownstream nuclei segmentation and semantic preservation in tissue\nclassification tasks performed on VQGAN-generated images demonstrate superior\nperformance and agreement with ground-truth analysis compared to those from the\ncGAN. This work establishes that a multi-level VQGAN is a robust and superior\narchitecture for generating scientifically useful virtual stains, offering a\nviable pathway to integrate the rich molecular data of mIF into established and\npowerful H&E-based analytical workflows."}
{"id": "2508.04735", "pdf": "https://arxiv.org/pdf/2508.04735", "abs": "https://arxiv.org/abs/2508.04735", "authors": ["Pouyan Navard", "Yasemin Ozkut", "Srikar Adhikari", "Elaine Situ-LaCasse", "Josie Acuña", "Adrienne Yarnish", "Alper Yilmaz"], "title": "ERDES: A Benchmark Video Dataset for Retinal Detachment and Macular Status Classification in Ocular Ultrasound", "categories": ["q-bio.QM", "cs.AI"], "comment": "Under Review, https://github.com/OSUPCVLab/ERDES", "summary": "Retinal detachment (RD) is a vision-threatening condition that requires\ntimely intervention to preserve vision. Macular involvement -- whether the\nmacula is still intact (macula-intact) or detached (macula-detached) -- is the\nkey determinant of visual outcomes and treatment urgency. Point-of-care\nultrasound (POCUS) offers a fast, non-invasive, cost-effective, and accessible\nimaging modality widely used in diverse clinical settings to detect RD.\nHowever, ultrasound image interpretation is limited by a lack of expertise\namong healthcare providers, especially in resource-limited settings. Deep\nlearning offers the potential to automate ultrasound-based assessment of RD.\nHowever, there are no ML ultrasound algorithms currently available for clinical\nuse to detect RD and no prior research has been done on assessing macular\nstatus using ultrasound in RD cases -- an essential distinction for surgical\nprioritization. Moreover, no public dataset currently supports macular-based RD\nclassification using ultrasound video clips. We introduce Eye Retinal\nDEtachment ultraSound, ERDES, the first open-access dataset of ocular\nultrasound clips labeled for (i) presence of retinal detachment and (ii)\nmacula-intact versus macula-detached status. The dataset is intended to\nfacilitate the development and evaluation of machine learning models for\ndetecting retinal detachment. We also provide baseline benchmarks using\nmultiple spatiotemporal convolutional neural network (CNN) architectures. All\nclips, labels, and training code are publicly available at\nhttps://osupcvlab.github.io/ERDES/."}
{"id": "2508.05550", "pdf": "https://arxiv.org/pdf/2508.05550", "abs": "https://arxiv.org/abs/2508.05550", "authors": ["Vincent Noel", "Marco Ruscone", "Randy Heiland", "Arnau Montagud", "Alfonso Valencia", "Emmanuel Barillot", "Paul Macklin", "Laurence Calzone"], "title": "PhysiBoSS-Models: A database for multiscale models", "categories": ["q-bio.QM"], "comment": null, "summary": "PhysiBoSS is an open-source platform that integrates agent-based modeling of\ncell populations with intracellular stochastic Boolean networks, enabling\nmultiscale simulations of complex biological behaviors. To promote model\nsharing and versioning, we present the PhysiBoSS-Models database: a curated\nrepository for multiscale models built with PhysiBoSS. By providing a simple\nPython API, PhysiBoSS-Models provides an easy way to download and simulate\npreexisting models through tools such as PhysiCell Studio. By providing\nstandardized access to validated models, PhysiBoSS-Models facilitates reuse,\nvalidation, and benchmarking, supporting research in biology."}
{"id": "2508.05594", "pdf": "https://arxiv.org/pdf/2508.05594", "abs": "https://arxiv.org/abs/2508.05594", "authors": ["Maria M. Warns", "Leah Mrowiec", "Christopher Owen", "Adam Horton", "Chi-Yu Lin", "Modou Lamin Jarju", "Niall M. Mangan", "Aaron Packman", "Katelyn Plaisier Leisman", "Abhilasha Shrestha", "Rachel Poretsky"], "title": "Data Analysis and Modeling for Transitioning Between Laboratory Methods for Detecting SARS-CoV-2 in Wastewater", "categories": ["q-bio.QM"], "comment": null, "summary": "Wastewater surveillance has proven to be a useful tool to monitor pathogens\nsuch as SARS-CoV-2 as it is a nonintrusive way to survey the potential disease\nburden of the population contributing to a sewershed. With the expansion of\nthis field since the beginning of the COVID-19 pandemic, laboratory methods to\nprocess wastewater and quantify pathogen nucleic acid levels have improved as\ntechnologies changed, efforts expanded in size and scope, and supply chain\nissues were resolved. Maintaining data continuity is crucial for labs\nundergoing method transitions to accurately assess infectious disease levels\nover time and compare measured RNA concentrations to public health data.\nDespite the dynamic nature of laboratory methods and the necessity to ensure\nuninterrupted data, to our knowledge there has not been a study that unites two\ndatasets from different lab methods for pathogen quantification from\nenvironmental samples. Here, we describe a lab transition from SARS-CoV-2 RNA\nquantification using a low-throughput, manual filtration-based wastewater\nconcentration and RNA extraction followed by qPCR to a high-throughput,\nautomated magnetic bead-based concentration and extraction followed by dPCR.\nDuring the two-month transition period, wastewater samples from across the\nChicago metropolitan area were processed with both methods in parallel. We\nevaluated a variety of regression models to relate the RNA measurements from\nboth methods and found a log-log model was most appropriate after removing\noutliers and discrepancy points to improve model performance. We also evaluated\nthe consequences of assigning values to samples that were below the detection\nlimit. Our study demonstrates that data continuity can be maintained throughout\na transition of laboratory methods if there is a sufficient period of overlap\nbetween the methods for an appropriate model to be constructed to relate the\ndatasets."}
{"id": "2508.04727", "pdf": "https://arxiv.org/pdf/2508.04727", "abs": "https://arxiv.org/abs/2508.04727", "authors": ["Ruru Xu", "Ilkay Oksuz"], "title": "Adaptive k-space Radial Sampling for Cardiac MRI with Reinforcement Learning", "categories": ["q-bio.TO", "eess.IV", "q-bio.QM"], "comment": "MICCAI 2025 STACOM workshop", "summary": "Accelerated Magnetic Resonance Imaging (MRI) requires careful optimization of\nk-space sampling patterns to balance acquisition speed and image quality. While\nrecent advances in deep learning have shown promise in optimizing Cartesian\nsampling, the potential of reinforcement learning (RL) for non-Cartesian\ntrajectory optimization remains largely unexplored. In this work, we present a\nnovel RL framework for optimizing radial sampling trajectories in cardiac MRI.\nOur approach features a dual-branch architecture that jointly processes k-space\nand image-domain information, incorporating a cross-attention fusion mechanism\nto facilitate effective information exchange between domains. The framework\nemploys an anatomically-aware reward design and a golden-ratio sampling\nstrategy to ensure uniform k-space coverage while preserving cardiac structural\ndetails. Experimental results demonstrate that our method effectively learns\noptimal radial sampling strategies across multiple acceleration factors,\nachieving improved reconstruction quality compared to conventional approaches.\nCode available: https://github.com/Ruru-Xu/RL-kspace-Radial-Sampling"}
