{"id": "2512.08175", "pdf": "https://arxiv.org/pdf/2512.08175", "abs": "https://arxiv.org/abs/2512.08175", "authors": ["Jonas A. Gustafson", "Jiadong Lin", "Evan E. Eichler", "Danny E. Miller"], "title": "needLR: Long-read structural variant annotation with population-scale frequency estimation", "categories": ["q-bio.GN"], "comment": null, "summary": "Summary: We present needLR, a structural variant (SV) annotation tool that can be used for filtering and prioritization of candidate pathogenic SVs from long-read sequencing data using population allele frequencies, annotations for genomic context, and gene-phenotype associations. When using population data from 500 presumably healthy individuals to evaluate nine test cases with known pathogenic SVs, needLR assigned allele frequencies to over 97.5% of all detected SVs and reduced the average number of novel genic SVs to 121 per case while retaining all known pathogenic variants. Availability and Implementation: needLR is implemented in bash with dependencies including Truvari v4.2.2, BEDTools v2.31.1, and BCFtools v1.19. Source code, documentation, and pre-computed population allele frequency data are freely available at https://github.com/jgust1/needLR under an MIT license."}
{"id": "2512.08226", "pdf": "https://arxiv.org/pdf/2512.08226", "abs": "https://arxiv.org/abs/2512.08226", "authors": ["Kartik Singhal", "Evelyn Schmidt", "Susanna Kiwala", "S. Peter Goedegebuure", "Christopher A. Miller", "Huiming Xia", "Kelsy C. Cotto", "Jinglun Li", "Jennie Yao", "Luke Hendrickson", "Miller M. Richters", "My H. Hoang", "Mariam Khanfar", "Isabel Risch", "Shelly O'Laughlin", "Nancy Myers", "Tammi Vickery", "Sherri R. Davies", "Feiyu Du", "Thomas B. Mooney", "Adam Coffman", "Gue Su Chang", "Jasreet Hundal", "John E. Garza", "Michael D. McLellan", "Joshua F. McMichael", "John Maruska", "William Blake Inabinett", "William A. Hoos", "Rachel Karchin", "Tanner M. Johanns", "Gavin P. Dunn", "Russel K. Pachynski", "Todd A. Fehniger", "Jeffrey P. Ward", "Jennifer A. Foltz", "William E. Gillanders", "Obi L. Griffith", "Malachi Griffith"], "title": "ImmunoNX: a robust bioinformatics workflow to support personalized neoantigen vaccine trials", "categories": ["q-bio.GN"], "comment": "Supplementary tables and materials available at https://doi.org/10.5281/zenodo.17862140", "summary": "Personalized neoantigen vaccines represent a promising immunotherapy approach that harnesses tumor-specific antigens to stimulate anti-tumor immune responses. However, the design of these vaccines requires sophisticated computational workflows to predict and prioritize neoantigen candidates from patient sequencing data, coupled with rigorous review to ensure candidate quality. While numerous computational tools exist for neoantigen prediction, to our knowledge, there are no established protocols detailing the complete process from raw sequencing data through systematic candidate selection. Here, we present ImmunoNX (Immunogenomics Neoantigen eXplorer), an end-to-end protocol for neoantigen prediction and vaccine design that has supported over 185 patients across 11 clinical trials. The workflow integrates tumor DNA/RNA and matched normal DNA sequencing data through a computational pipeline built with Workflow Definition Language (WDL) and executed via Cromwell on Google Cloud Platform. ImmunoNX employs consensus-based variant calling, in-silico HLA typing, and pVACtools for neoantigen prediction. Additionally, we describe a two-stage immunogenomics review process with prioritization of neoantigen candidates, enabled by pVACview, followed by manual assessment of variants using the Integrative Genomics Viewer (IGV). This workflow enables vaccine design in under three months. We demonstrate the protocol using the HCC1395 breast cancer cell line dataset, identifying 78 high-confidence neoantigen candidates from 322 initial predictions. Although demonstrated here for vaccine development, this workflow can be adapted for diverse neoantigen therapies and experiments. Therefore, this protocol provides the research community with a reproducible, version-controlled framework for designing personalized neoantigen vaccines, supported by detailed documentation, example datasets, and open-source code."}
{"id": "2512.07912", "pdf": "https://arxiv.org/pdf/2512.07912", "abs": "https://arxiv.org/abs/2512.07912", "authors": ["Fateme Mobini", "Mohammad Reza Hedyehzadeh", "Mahdi Yousefi"], "title": "A Semi-Supervised Inf-Net Framework for CT-Based Lung Nodule Analysis with a Conceptual Extension Toward Genomic Integration", "categories": ["q-bio.QM"], "comment": null, "summary": "Lung cancer is a primary contributor to cancer-related mortality globally, highlighting the necessity for precise early detection of pulmonary nodules through low-dose CT (LDCT) imaging. Deep learning methods have improved nodule detection and classification; however, their performance is frequently limited by the availability of annotated data and variability among imaging centers. This research presents a CT-driven, semi-supervised framework utilizing the Inf-Net architecture to enhance lung nodule analysis with minimal annotation. The model incorporates multi-scale feature aggregation, Reverse Attention refinement, and pseudo-labeling to efficiently utilize unlabeled CT slices. Experiments conducted on subsets of the LUNA16 dataset indicate that the supervised Inf-Net attains a score of 0.825 on 10,000 labeled slices. In contrast, the semi-supervised variant achieves a score of 0.784 on 20,000 slices that include both labeled and pseudo-labeled data, thus surpassing its supervised baseline of 0.755. This study presents a conceptual framework for the integration of genomic biomarkers with CT-derived features, facilitating the development of future multimodal, biologically informed CAD systems. The proposed semi-supervised Inf-Net framework improves CT-based lung nodule assessment and lays the groundwork for flexible multi-omics diagnostic models."}
{"id": "2512.08074", "pdf": "https://arxiv.org/pdf/2512.08074", "abs": "https://arxiv.org/abs/2512.08074", "authors": ["Simen Jacobs", "Julian Voits", "Nikita Frolov", "Ulrich S. Schwarz", "Lendert Gelens"], "title": "Understanding the temperature response of biological systems: From empirical fits to mechanistic frameworks", "categories": ["q-bio.QM", "cond-mat.soft", "cond-mat.stat-mech", "nlin.AO", "physics.bio-ph"], "comment": "19 pages, 4 figures", "summary": "Virtually every biological rate changes with temperature, but the mechanisms underlying these responses differ between different processes. Here, we bring together the main theoretical approaches used to describe temperature-rate relationships, ranging from empirical curve shapes to reaction-level kinetics and network-based dynamical frameworks. These models highlight how temperature influences not only the speed of elementary reactions, but also the behavior that emerges when many reactions interact through regulation, feedback, or stochastic transitions. By outlining the assumptions and implications of each perspective, we aim to clarify how different modeling strategies connect molecular processes to physiological temperature response curves and to point toward integrative frameworks that can better explain the diversity of biological thermal responses."}
{"id": "2512.08087", "pdf": "https://arxiv.org/pdf/2512.08087", "abs": "https://arxiv.org/abs/2512.08087", "authors": ["Ziyue Zheng", "Loay J. Jabre", "Matthew McIlvin", "Mak A. Saito", "Sangwon Hyun"], "title": "Subcellular proteome niche discovery using semi-supervised functional clustering", "categories": ["q-bio.QM", "q-bio.SC", "stat.AP"], "comment": "42 pages, 9 figures, 6 supplemental figures", "summary": "Intracellular compartmentalization of proteins underpins their function and the metabolic processes they sustain. Various mass spectrometry-based proteomics methods (subcellular spatial proteomics) now allow high throughput subcellular protein localization. Yet, the curation, analysis and interpretation of these data remain challenging, particularly in non-model organisms where establishing reliable marker proteins is difficult, and in contexts where experimental replication and subcellular fractionation are constrained. Here, we develop FSPmix, a semi-supervised functional clustering method implemented as an open-source R package, which leverages partial annotations from a subset of marker proteins to predict protein subcellular localization from subcellular spatial proteomics data. This method explicitly assumes that protein signatures vary smoothly across subcellular fractions, enabling more robust inference under low signal-to-noise data regimes. We applied FSPmix to a subcellular proteomics dataset from a marine diatom, allowing us to assign probabilistic localizations to proteins and uncover potentially new protein functions. Altogether, this work lays the foundation for more robust statistical analysis and interpretation of subcellular proteomics datasets, particularly in understudied organisms."}
{"id": "2512.08202", "pdf": "https://arxiv.org/pdf/2512.08202", "abs": "https://arxiv.org/abs/2512.08202", "authors": ["Toru Nagasaka", "Takaaki Tachibana", "Yukari Adachi", "Hiroki Kagiyama", "Ryota Ito", "Mitsugu Fujita", "Kimihiro Yamashita", "Yoshihiro Kakeji"], "title": "Spatially-extended Flow Phixer (SpeF-Phixer): A Spatially Extended $\\varphi$-Mixing Framework for Gene Regulatory Causal Inference in Spatial Gene Field", "categories": ["q-bio.QM"], "comment": null, "summary": "Background and objective: Spatial transcriptomics provides rich spatial context but lacks sufficient resolution for large-scale causal inference. We developed SpeF-Phixer, a spatially extended phi-mixing framework integrating whole-slide image (WSI)-derived spatial cell distributions with mapped scRNA-seq expression fields to infer directed gene regulatory triplets with spatial coherence. Methods: Using CD103/CD8-immunostained colorectal cancer WSIs and publicly available scRNA-seq datasets, spatial gene fields were constructed around mapped cells and discretized for signed phi-mixing computation. Pairwise dependencies, directional signs, and triplet structures were evaluated through kNN-based neighborhood screening and bootstrap consensus inference. Mediation and convergence were distinguished using generalized additive models (GAMs), with spatial validity assessed by real-null comparisons and database-backed direction checks. Results: Across tissue patches, the pipeline reduced approximately 3.6x10^4 triplet candidates to a reproducible consensus set (approximately 3x10^2 per patch). The downstream edge (Y to Z) showed significant directional bias consistent with curated regulatory databases. Spatial path tracing demonstrated markedly higher coherence for real triplets than for null controls, indicating that inferred chains represent biologically instantiated regulatory flows. Conclusion: SpeF-Phixer extracts spatially coherent, directionally consistent gene regulatory triplets from histological images. This framework bridges single-cell molecular profiles with microenvironmental organization and provides a scalable foundation for constructing spatially informed causal gene networks."}
