{"id": "2508.08351", "pdf": "https://arxiv.org/pdf/2508.08351", "abs": "https://arxiv.org/abs/2508.08351", "authors": ["Nadezhda Diadkina"], "title": "An Interactive Platform for Unified Assessment of Drug-Drug Interactions Using Descriptive and Pharmacokinetic Data", "categories": ["q-bio.QM"], "comment": "11 pages, 2 figures, 28 references. Interactive demo & scripts: link\n  in paper (Data & Code availability)", "summary": "Drug-drug interactions (DDIs) are a major concern in polypharmacy. Public\ndatabases often provide only qualitative descriptions without pharmacokinetic\ncontext. We present an interactive web tool that integrates 191,541 descriptive\nDDI records from DrugBank with 3,779 AUC-based interactions from the PK-DDIP\ndataset, extracted from FDA-approved drug labeling (DailyMed) using natural\nlanguage processing and manual verification. Using multi-step name\nharmonization (exact, fuzzy, synonym expansion, manual curation), 1,803\ninteraction pairs were unified across 639 overlapping compounds. The platform\nis built with Streamlit and offers smart drug search, color-coded output, and\nreal-time response. It enables users to explore both descriptive and\npharmacokinetic data, supporting research and education in clinical\npharmacology and drug safety. This research prototype is not intended for\nclinical decision-making."}
{"id": "2508.08441", "pdf": "https://arxiv.org/pdf/2508.08441", "abs": "https://arxiv.org/abs/2508.08441", "authors": ["Yunyue Su", "Jiahui Chen", "Zao Jiang", "Zhenyi Zhong", "Liang Wang", "Qiang Liu"], "title": "Language Models Can Understand Spectra: A Multimodal Model for Molecular Structure Elucidation", "categories": ["q-bio.QM", "cs.CE", "cs.LG", "68T07, 68Q32, 92E10", "I.2.6; I.2.7; I.2.3; J.2; H.2.8"], "comment": "22 pages, 3 figures, 11 tables", "summary": "Structure elucidation is a fundamental technique for understanding the\nmicroscopic composition of matter and is widely applied across various\ndisciplines in the natural sciences and engineering. However, existing methods\noften rely heavily on prior databases or known structural information, making\nit difficult to resolve unknown structures. In addition, complex structures\ntypically require the joint analysis of multiple spectroscopic modalities. This\nprocess heavily depends on expert domain knowledge and is often accompanied by\nhigh costs in terms of both time and instrumentation. To address these\nchallenges, we propose SpectraLLM, the first large language model designed to\nsupport multi-modal spectroscopic joint reasoning. SpectraLLM is capable of\nprocessing either single or multiple spectroscopic inputs and performing\nend-to-end structure elucidation. By integrating continuous and discrete\nspectroscopic modalities into a shared semantic space, SpectraLLM learns to\nuncover substructural patterns that are consistent and complementary across\nspectra, enabling precise molecular structure elucidation. We pretrain and\nfine-tune SpectraLLM in the domain of small molecules, and evaluate it on six\nstandardized, publicly available chemical datasets. The model achieves\nstate-of-the-art performance, significantly outperforming existing approaches\ntrained on single modalities. Notably, SpectraLLM demonstrates strong\nrobustness and generalization even for single-spectrum inference, while its\nmulti-modal reasoning capability further improves the accuracy of structural\nprediction."}
{"id": "2508.08334", "pdf": "https://arxiv.org/pdf/2508.08334", "abs": "https://arxiv.org/abs/2508.08334", "authors": ["Zihang Shao", "Wentao Lei", "Lei Wang", "Wencai Ye", "Li Liu"], "title": "HSA-Net: Hierarchical and Structure-Aware Framework for Efficient and Scalable Molecular Language Modeling", "categories": ["cs.LG", "cs.AI", "q-bio.QM"], "comment": null, "summary": "Molecular representation learning, a cornerstone for downstream tasks like\nmolecular captioning and molecular property prediction, heavily relies on Graph\nNeural Networks (GNN). However, GNN suffers from the over-smoothing problem,\nwhere node-level features collapse in deep GNN layers. While existing feature\nprojection methods with cross-attention have been introduced to mitigate this\nissue, they still perform poorly in deep features. This motivated our\nexploration of using Mamba as an alternative projector for its ability to\nhandle complex sequences. However, we observe that while Mamba excels at\npreserving global topological information from deep layers, it neglects\nfine-grained details in shallow layers. The capabilities of Mamba and\ncross-attention exhibit a global-local trade-off. To resolve this critical\nglobal-local trade-off, we propose Hierarchical and Structure-Aware Network\n(HSA-Net), a novel framework with two modules that enables a hierarchical\nfeature projection and fusion. Firstly, a Hierarchical Adaptive Projector (HAP)\nmodule is introduced to process features from different graph layers. It learns\nto dynamically switch between a cross-attention projector for shallow layers\nand a structure-aware Graph-Mamba projector for deep layers, producing\nhigh-quality, multi-level features. Secondly, to adaptively merge these\nmulti-level features, we design a Source-Aware Fusion (SAF) module, which\nflexibly selects fusion experts based on the characteristics of the aggregation\nfeatures, ensuring a precise and effective final representation fusion.\nExtensive experiments demonstrate that our HSA-Net framework quantitatively and\nqualitatively outperforms current state-of-the-art (SOTA) methods."}
{"id": "2508.08763", "pdf": "https://arxiv.org/pdf/2508.08763", "abs": "https://arxiv.org/abs/2508.08763", "authors": ["Lixin Lin", "Haydar Demirhan", "Peter Eizenberg", "James M. Trauer", "Lewi Stone"], "title": "Quantifying the direct and indirect impact of COVID-19 vaccination: evidence from Victoria, Australia", "categories": ["q-bio.PE", "q-bio.QM"], "comment": null, "summary": "Vaccines not only directly protect vaccinated individuals but also contribute\nto protect the entire population via indirect herd-immunity benefits. However,\nresearchers have long struggled to quantify these indirect effects at the\npopulation level, hindering assessment of vaccination program effectiveness. We\ndeveloped a new method to estimate these effects, thereby markedly improving\nmeasures of the number of infections, hospitalizations, and deaths averted by\nvaccination. Our population-based analysis of 6,440,000 residents of Victoria,\nAustralia reveal strong indirect effects during the Delta outbreak\n(September-November 2021). By modelling a non-vaccination counterfactual, we\nconservatively estimate 316,000 infections were averted (95\\% BCI: 232k-406k),\nas well as 33,500 hospitalizations (95\\% BCI: 22.2k-46.2k), and 4,900 deaths\n(95\\% BCI: 2.9k-7.3k). These are 4.0, 7.5, and 8.0 times higher, respectively,\nthan observed. Half of the averted infections and around one-quarter of\nhospitalizations and deaths were attributable to indirect protection.\nHomogeneous vaccination across LGAs could have reduced outcomes by\napproximately 25\\%."}
{"id": "2508.09038", "pdf": "https://arxiv.org/pdf/2508.09038", "abs": "https://arxiv.org/abs/2508.09038", "authors": ["Guilherme Giovanini", "Cyro von Zuben de Valega Negrão", "Ammar Alsinai", "Alexandre Ferreira Ramos"], "title": "A control theoretical approach to gene regulation raises quantitative constraints for dynamic homeostasis in stochastic gene expression", "categories": ["q-bio.MN", "physics.bio-ph", "q-bio.QM"], "comment": "13 pages, 5 figures, submitted to Biochimica et Biophysica Acta (BBA)\n  - Molecular Basis of Disease", "summary": "Cell phenotype dynamic homeostasis contrasts with the inherent randomness of\nintracellular reactions. Although feedback control of master regulatory genes\n(MRG) is a key strategy for maintaining gene network expression ranges limited,\nunderstanding the quantitative constraints and corresponding mechanisms\nenabling such a dynamic stability under noise remains elusive. Here we model\nMRG expression as a stochastic process and downstream genes as sensors which\nresponse conditionally induce MRG activity. We show that at homeostatic regime:\ni. the trajectories of the MRG expression levels can be adjusted towards\nspecific ranges using both the exact solutions of the stochastic model and the\nexact stochastic simulation algorithm (SSA); ii. there exists a sampling rate\nwhich optimizes the feedback control of the MRG activity, and non-optimal\ncontrols resulting in alternative homeostatic dynamics; iii. the feedback\ncontrol of MRG activity leads to updates which intensities and time intervals\nare non-linearly related; iv. the ON state probability of an MRG promoter has\ndynamics confined within a narrow domain. Our results help to understand the\nquantitative constraints underpinning dynamic homeostasis despite randomness,\nthe mechanisms underlying alternative, non-optimal, homeostatic regimes, and\nmay be useful for theoretically prototyping therapies aiming at gene networks\nmodulation."}
