{"id": "2508.02743", "pdf": "https://arxiv.org/pdf/2508.02743", "abs": "https://arxiv.org/abs/2508.02743", "authors": ["Vinil Polepalli"], "title": "A Novel cVAE-Augmented Deep Learning Framework for Pan-Cancer RNA-Seq Classification", "categories": ["q-bio.GN", "cs.AI", "cs.LG"], "comment": null, "summary": "Pan-cancer classification using transcriptomic (RNA-Seq) data can inform\ntumor subtyping and therapy selection, but is challenging due to extremely high\ndimensionality and limited sample sizes. In this study, we propose a novel deep\nlearning framework that uses a class-conditional variational autoencoder (cVAE)\nto augment training data for pan-cancer gene expression classification. Using\n801 tumor RNA-Seq samples spanning 5 cancer types from The Cancer Genome Atlas\n(TCGA), we first perform feature selection to reduce 20,531 gene expression\nfeatures to the 500 most variably expressed genes. A cVAE is then trained on\nthis data to learn a latent representation of gene expression conditioned on\ncancer type, enabling the generation of synthetic gene expression samples for\neach tumor class. We augment the training set with these cVAE-generated samples\n(doubling the dataset size) to mitigate overfitting and class imbalance. A\ntwo-layer multilayer perceptron (MLP) classifier is subsequently trained on the\naugmented dataset to predict tumor type. The augmented framework achieves high\nclassification accuracy (~98%) on a held-out test set, substantially\noutperforming a classifier trained on the original data alone. We present\ndetailed experimental results, including VAE training curves, classifier\nperformance metrics (ROC curves and confusion matrix), and architecture\ndiagrams to illustrate the approach. The results demonstrate that cVAE-based\nsynthetic augmentation can significantly improve pan-cancer prediction\nperformance, especially for underrepresented cancer classes."}
{"id": "2508.02928", "pdf": "https://arxiv.org/pdf/2508.02928", "abs": "https://arxiv.org/abs/2508.02928", "authors": ["Achraf Zinihi", "Matthias Ehrhardt", "Moulay Rchid Sidi Ammi"], "title": "A nonstandard finite difference scheme for an SEIQR epidemiological PDE mode", "categories": ["q-bio.QM", "cs.NA", "math.DS", "math.NA", "92D30, 65M06, 35K57, 37N30"], "comment": null, "summary": "This paper introduces a nonstandard finite difference (NSFD) approach to a\nreaction-diffusion SEIQR epidemiological model, which captures the\nspatiotemporal dynamics of infectious disease transmission. Formulated as a\nsystem of semilinear parabolic partial differential equations (PDEs), the model\nextends classical compartmental models by incorporating spatial diffusion to\naccount for population movement and spatial heterogeneity. The proposed NSFD\ndiscretization is designed to preserve the continuous model's essential\nqualitative features, such as positivity, boundedness, and stability, which are\noften compromised by standard finite difference methods. We rigorously analyze\nthe model's well-posedness, construct a structure-preserving NSFD scheme for\nthe PDE system, and study its convergence and local truncation error. Numerical\nsimulations validate the theoretical findings and demonstrate the scheme's\neffectiveness in preserving biologically consistent dynamics."}
{"id": "2508.03584", "pdf": "https://arxiv.org/pdf/2508.03584", "abs": "https://arxiv.org/abs/2508.03584", "authors": ["Fatih Gulec", "Hamdan Awan", "Nigel Wallbridge", "Andrew W. Eckford"], "title": "Decoding and Engineering the Phytobiome Communication for Smart Agriculture", "categories": ["eess.SP", "cs.AI", "cs.ET", "cs.NI", "q-bio.MN"], "comment": "Under revision for IEEE Communications Magazine", "summary": "Smart agriculture applications, integrating technologies like the Internet of\nThings and machine learning/artificial intelligence (ML/AI) into agriculture,\nhold promise to address modern challenges of rising food demand, environmental\npollution, and water scarcity. Alongside the concept of the phytobiome, which\ndefines the area including the plant, its environment, and associated\norganisms, and the recent emergence of molecular communication (MC), there\nexists an important opportunity to advance agricultural science and practice\nusing communication theory. In this article, we motivate to use the\ncommunication engineering perspective for developing a holistic understanding\nof the phytobiome communication and bridge the gap between the phytobiome\ncommunication and smart agriculture. Firstly, an overview of phytobiome\ncommunication via molecular and electrophysiological signals is presented and a\nmulti-scale framework modeling the phytobiome as a communication network is\nconceptualized. Then, how this framework is used to model electrophysiological\nsignals is demonstrated with plant experiments. Furthermore, possible smart\nagriculture applications, such as smart irrigation and targeted delivery of\nagrochemicals, through engineering the phytobiome communication are proposed.\nThese applications merge ML/AI methods with the Internet of Bio-Nano-Things\nenabled by MC and pave the way towards more efficient, sustainable, and\neco-friendly agricultural production. Finally, the implementation challenges,\nopen research issues, and industrial outlook for these applications are\ndiscussed."}
{"id": "2508.03545", "pdf": "https://arxiv.org/pdf/2508.03545", "abs": "https://arxiv.org/abs/2508.03545", "authors": ["Stephanie Wohlfahrt", "Christoph Praschl", "Horst Leitner", "Wolfram Jantsch", "Julia Konic", "Silvio Schueler", "Andreas Stöckl", "David C. Schedl"], "title": "Advancing Wildlife Monitoring: Drone-Based Sampling for Roe Deer Density Estimation", "categories": ["cs.CV", "q-bio.QM", "62P10", "I.4.8"], "comment": "6 pages, 1 figure, 1 table, International Wildlife Congress 2025", "summary": "We use unmanned aerial drones to estimate wildlife density in southeastern\nAustria and compare these estimates to camera trap data. Traditional methods\nlike capture-recapture, distance sampling, or camera traps are well-established\nbut labour-intensive or spatially constrained. Using thermal (IR) and RGB\nimagery, drones enable efficient, non-intrusive animal counting. Our surveys\nwere conducted during the leafless period on single days in October and\nNovember 2024 in three areas of a sub-Illyrian hill and terrace landscape.\nFlight transects were based on predefined launch points using a 350 m grid and\nan algorithm that defined the direction of systematically randomized transects.\nThis setup allowed surveying large areas in one day using multiple drones,\nminimizing double counts. Flight altitude was set at 60 m to avoid disturbing\nroe deer (Capreolus capreolus) while ensuring detection. Animals were manually\nannotated in the recorded imagery and extrapolated to densities per square\nkilometer. We applied three extrapolation methods with increasing complexity:\nnaive area-based extrapolation, bootstrapping, and zero-inflated negative\nbinomial modelling. For comparison, a Random Encounter Model (REM) estimate was\ncalculated using camera trap data from the flight period. The drone-based\nmethods yielded similar results, generally showing higher densities than REM,\nexcept in one area in October. We hypothesize that drone-based density reflects\ndaytime activity in open and forested areas, while REM estimates average\nactivity over longer periods within forested zones. Although both approaches\nestimate density, they offer different perspectives on wildlife presence. Our\nresults show that drones offer a promising, scalable method for wildlife\ndensity estimation."}
