{"id": "2511.14806", "pdf": "https://arxiv.org/pdf/2511.14806", "abs": "https://arxiv.org/abs/2511.14806", "authors": ["Siyuan Li", "Kai Yu", "Anna Wang", "Zicheng Liu", "Chang Yu", "Jingbo Zhou", "Qirong Yang", "Yucheng Guo", "Xiaoming Zhang", "Stan Z. Li"], "title": "MergeDNA: Context-aware Genome Modeling with Dynamic Tokenization through Token Merging", "categories": ["q-bio.GN", "cs.AI", "cs.LG"], "comment": "AAAI 2026 (Oral Presentation) Preprint", "summary": "Modeling genomic sequences faces two unsolved challenges: the information density varies widely across different regions, while there is no clearly defined minimum vocabulary unit. Relying on either four primitive bases or independently designed DNA tokenizers, existing approaches with naive masked language modeling pre-training often fail to adapt to the varying complexities of genomic sequences. Leveraging Token Merging techniques, this paper introduces a hierarchical architecture that jointly optimizes a dynamic genomic tokenizer and latent Transformers with context-aware pre-training tasks. As for network structures, the tokenization module automatically chunks adjacent bases into words by stacking multiple layers of the differentiable token merging blocks with local-window constraints, then a Latent Encoder captures the global context of these merged words by full-attention blocks. Symmetrically employing a Latent Decoder and a Local Decoder, MergeDNA learns with two pre-training tasks: Merged Token Reconstruction simultaneously trains the dynamic tokenization module and adaptively filters important tokens, while Adaptive Masked Token Modeling learns to predict these filtered tokens to capture informative contents. Extensive experiments show that MergeDNA achieves superior performance on three popular DNA benchmarks and several multi-omics tasks with fine-tuning or zero-shot evaluation, outperforming typical tokenization methods and large-scale DNA foundation models."}
{"id": "2511.15139", "pdf": "https://arxiv.org/pdf/2511.15139", "abs": "https://arxiv.org/abs/2511.15139", "authors": ["Amit Kumar", "Maninder Kaur", "Raghvendra Mall", "Sukrit Gupta"], "title": "CASPER: Cross-modal Alignment of Spatial and single-cell Profiles for Expression Recovery", "categories": ["q-bio.GN", "cs.AI", "cs.LG"], "comment": null, "summary": "Spatial Transcriptomics enables mapping of gene expression within its native tissue context, but current platforms measure only a limited set of genes due to experimental constraints and excessive costs. To overcome this, computational models integrate Single-Cell RNA Sequencing data with Spatial Transcriptomics to predict unmeasured genes. We propose CASPER, a cross-attention based framework that predicts unmeasured gene expression in Spatial Transcriptomics by leveraging centroid-level representations from Single-Cell RNA Sequencing. We performed rigorous testing over four state-of-the-art Spatial Transcriptomics/Single-Cell RNA Sequencing dataset pairs across four existing baseline models. CASPER shows significant improvement in nine out of the twelve metrics for our experiments. This work paves the way for further work in Spatial Transcriptomics to Single-Cell RNA Sequencing modality translation. The code for CASPER is available at https://github.com/AI4Med-Lab/CASPER."}
{"id": "2511.14826", "pdf": "https://arxiv.org/pdf/2511.14826", "abs": "https://arxiv.org/abs/2511.14826", "authors": ["Bryan Harris", "Majid Bani-Yaghoub"], "title": "Leveraging NCBI Genomic Metadata for Epidemiological Insights: Example of Enterobacterales", "categories": ["q-bio.QM"], "comment": null, "summary": "Numerous studies have utilized NCBI data for genomic analysis, gene annotation, and identifying disease-associated variants, yet NCBI's epidemiological potential remains underexplored. This study demonstrates how NCBI datasets can be systematically leveraged to extract and interpret infectious disease patterns across spatial and temporal dimensions. Using Enterobacterales as a case study, we analyzed over 477,000 genomic records and metadata, including collection date, location, host species, and isolation source. We compared trends of Escherichia coli and Salmonella in NCBI data with CDC's National Outbreak Reporting System (NORS). While both datasets showed consistent seasonal peaks and foodborne sources, NCBI data revealed broader host species (e.g., wildlife, environmental reservoirs), greater isolate diversity, and finer spatial-temporal resolution. These insights were enabled by our open-source Python package, EpiNCBI_V1, developed for real-time downloading, filtering, and cleaning of pathogen genomic metadata from NCBI. This work highlights the value of integrating genomic repositories into public health analytics to enhance surveillance, outbreak detection, and cross-species transmission tracking globally."}
{"id": "2511.14909", "pdf": "https://arxiv.org/pdf/2511.14909", "abs": "https://arxiv.org/abs/2511.14909", "authors": ["Amit Lavon"], "title": "Izzy: a high-throughput metagenomic read simulator", "categories": ["q-bio.QM"], "comment": null, "summary": "Simulated microbial communities are used in benchmarking microbial abundance estimators and other bioinformatic utilities. To match current data scales, large simulated samples are needed, and many. The speed of current implementations might create bottlenecks for scientists testing new innovations. Here, a new implementation is introduced, based on existing error models. The new implementation, Izzy, provides up to a 60x speedup while maintaining a simple and easy-to-use interface."}
{"id": "2511.15173", "pdf": "https://arxiv.org/pdf/2511.15173", "abs": "https://arxiv.org/abs/2511.15173", "authors": ["Jun Hyeun Kang", "Jung Eek Son", "Tae In Ahn"], "title": "Data-driven Prediction of Species-Specific Plant Responses to Spectral-Shifting Films from Leaf Phenotypic and Photosynthetic Traits", "categories": ["q-bio.QM", "cs.CV", "cs.LG", "eess.IV"], "comment": null, "summary": "The application of spectral-shifting films in greenhouses to shift green light to red light has shown variable growth responses across crop species. However, the yield enhancement of crops under altered light quality is related to the collective effects of the specific biophysical characteristics of each species. Considering only one attribute of a crop has limitations in understanding the relationship between sunlight quality adjustments and crop growth performance. Therefore, this study aims to comprehensively link multiple plant phenotypic traits and daily light integral considering the physiological responses of crops to their growth outcomes under SF using artificial intelligence. Between 2021 and 2024, various leafy, fruiting, and root crops were grown in greenhouses covered with either PEF or SF, and leaf reflectance, leaf mass per area, chlorophyll content, daily light integral, and light saturation point were measured from the plants cultivated in each condition. 210 data points were collected, but there was insufficient data to train deep learning models, so a variational autoencoder was used for data augmentation. Most crop yields showed an average increase of 22.5% under SF. These data were used to train several models, including logistic regression, decision tree, random forest, XGBoost, and feedforward neural network (FFNN), aiming to binary classify whether there was a significant effect on yield with SF application. The FFNN achieved a high classification accuracy of 91.4% on a test dataset that was not used for training. This study provide insight into the complex interactions between leaf phenotypic and photosynthetic traits, environmental conditions, and solar spectral components by improving the ability to predict solar spectral shift effects using SF."}
{"id": "2511.14962", "pdf": "https://arxiv.org/pdf/2511.14962", "abs": "https://arxiv.org/abs/2511.14962", "authors": ["Haizhou Wen", "He Li", "Zhen Li"], "title": "Reconstruction of three-dimensional shapes of normal and disease-related erythrocytes from partial observations using multi-fidelity neural networks", "categories": ["physics.comp-ph", "cs.LG", "eess.IV", "physics.bio-ph", "q-bio.QM"], "comment": "29 pages, 10 figures, 3 appendices", "summary": "Reconstruction of 3D erythrocyte or red blood cell (RBC) morphology from partial observations, such as microscope images, is essential for understanding the physiology of RBC aging and the pathology of various RBC disorders. In this study, we propose a multi-fidelity neural network (MFNN) approach to fuse high-fidelity cross-sections of an RBC, with a morphologically similar low-fidelity reference 3D RBC shape to recover its full 3D surface. The MFNN predictor combines a convolutional neural network trained on low-fidelity reference RBC data with a feedforward neural network that captures nonlinear morphological correlations, and augments training with surface area and volume constraints for regularization in the low-fidelity branch. This approach is theoretically grounded by a topological homeomorphism between a sphere and 3D RBC surfaces, with training data generated by dissipative particle dynamics simulations of stomatocyte-discocyte-echinocyte transformation. Benchmarking across diverse RBC shapes observed in normal and aged populations, our results show that the MFNN predictor can reconstruct complex RBC morphologies with over 95% coordinate accuracy when provided with at least two orthogonal cross-sections. It is observed that informative oblique cross-sections intersecting spicule tips of echinocytes improve both local and global feature reconstruction, highlighting the value of feature-aware sampling. Our study further evaluates the influence of sampling strategies, shape dissimilarity, and noise, showing enhanced robustness under physically constrained training. Altogether, these results demonstrate the capability of MFNN to reconstruct the 3D shape of normal and aged RBCs from partial cross-sections as observed in conventional microscope images, which could facilitate the quantitative analysis of RBC morphological parameters in normal and disease-related RBC samples."}
