{"id": "2509.23057", "pdf": "https://arxiv.org/pdf/2509.23057", "abs": "https://arxiv.org/abs/2509.23057", "authors": ["Qian Qin", "Heng Li"], "title": "Challenges in structural variant calling in low-complexity regions", "categories": ["q-bio.GN"], "comment": "5 pages, 4 figures", "summary": "Background: Structural variants (SVs) are genomic differences $\\ge$50 bp in\nlength. They remain challenging to detect even with long sequence reads, and\nthe sources of these difficulties are not well quantified.\n  Results: We identified 35.4 Mb of low-complexity regions (LCRs) in GRCh38.\nAlthough these regions cover only 1.2% of the genome, they contain 69.1% of\nconfident SVs in sample HG002. Across long-read SV callers, 77.3-91.3% of\nerroneous SV calls occur within LCRs, with error rates increasing with LCR\nlength.\n  Conclusion: SVs are enriched and difficult to call in LCRs. Special care need\nto be taken for calling and analyzing these variants."}
{"id": "2509.23543", "pdf": "https://arxiv.org/pdf/2509.23543", "abs": "https://arxiv.org/abs/2509.23543", "authors": ["Luxuan Zhang", "Douglas Jiang", "Qinglong Wang", "Haoqi Sun", "Feng Tian"], "title": "Contrastive Learning Enhances Language Model Based Cell Embeddings for Low-Sample Single Cell Transcriptomics", "categories": ["q-bio.GN", "cs.NE", "q-bio.MN"], "comment": "14 pages, 4 figures, 2 tables", "summary": "Large language models (LLMs) have shown strong ability in generating rich\nrepresentations across domains such as natural language processing and\ngeneration, computer vision, and multimodal learning. However, their\napplication in biomedical data analysis remains nascent. Single-cell\ntranscriptomic profiling is essential for dissecting cell subtype diversity in\ndevelopment and disease, but rare subtypes pose challenges for scaling laws. We\npresent a computational framework that integrates single-cell RNA sequencing\n(scRNA-seq) with LLMs to derive knowledge-informed gene embeddings. Highly\nexpressed genes for each cell are mapped to NCBI Gene descriptions and embedded\nusing models such as text-embedding-ada-002, BioBERT, and SciBERT. Applied to\nretinal ganglion cells (RGCs), which differ in vulnerability to\nglaucoma-related neurodegeneration, this strategy improves subtype\nclassification, highlights biologically significant features, and reveals\npathways underlying selective neuronal vulnerability. More broadly, it\nillustrates how LLM-derived embeddings can augment biological analysis under\ndata-limited conditions and lay the groundwork for future foundation models in\nsingle-cell biology."}
{"id": "2509.24926", "pdf": "https://arxiv.org/pdf/2509.24926", "abs": "https://arxiv.org/abs/2509.24926", "authors": ["Rebecca J. Rousseau", "Rob Phillips"], "title": "Bifurcations and multistability in inducible three-gene toggle switch networks", "categories": ["q-bio.MN", "physics.bio-ph", "q-bio.SC"], "comment": "32 pages, 23 figures", "summary": "Control of transcription presides over a vast array of biological processes\nincluding through gene regulatory circuits that exhibit multistability. Two-\nand three-gene network motifs are often found to be critical parts of the\nrepertoire of metabolic and developmental pathways. Theoretical models of these\ncircuits, however, typically vary parameters such as dissociation constants,\ntranscription rates, and degradation rates without specifying precisely how\nthese parameters are controlled biologically. In this paper, we examine the\nrole of effector molecules, which can alter the concentrations of the active\ntranscription factors that control regulation, and are ubiquitous to regulatory\nprocesses across biological settings. We specifically consider allosteric\nregulation in the context of extending the standard bistable switch to\nthree-gene networks, and explore the rich multistable dynamics exhibited in\nthese architectures as a function of effector concentrations. We then study how\nthe conditions required for tristability and more complex dynamics, and the\nbifurcations in dynamic phase space upon tuning effector concentrations, evolve\nunder various interpretations of regulatory circuit mechanics, the underlying\nactivity of inducers, and perturbations thereof. Notably, the biological\nmechanism by which we model effector control over dual-function proteins\ntransforms not only the phenotypic trend of dynamic tuning but also the set of\navailable dynamic regimes. In this way, we determine key parameters and\nregulatory features that drive phenotypic decisions, and offer an\nexperimentally tunable structure for encoding inducible multistable behavior\narising from both single and dual-function allosteric transcription factors."}
{"id": "2509.22853", "pdf": "https://arxiv.org/pdf/2509.22853", "abs": "https://arxiv.org/abs/2509.22853", "authors": ["Irsyad Adam", "Zekai Chen", "David Laub", "Shaun Porwal", "Arda Pekis", "Kevin Brown"], "title": "Patient-specific Biomolecular Instruction Tuning", "categories": ["q-bio.QM", "cs.AI", "cs.CL", "cs.LG", "92C40, 68T07, 62P10", "I.2.7; I.5.1; J.3"], "comment": null, "summary": "Proteomics data is essential to pathogenic understanding of a disease\nphenotype. In cancer, analysis of molecular signatures enables precision\nmedicine through the identification of biological processes that drive\nindividualized tumor progression, therapeutic resistance, and clinical\nheterogeneity. Recent advances in multimodal large language models (LLMs) have\nshown remarkable capacity to integrate and reason across heterogeneous data\nmodalities. However, performing multi-modal language modeling for molecular\nunderstanding of patient-specific proteomics remains a significant challenge\ndue to two barriers: (1) the lack of instruction-tuning datasets that enable\nclinical interpretation from proteomics data, and (2) the absence of language\nmodeling architectures designed to capture the rich heterogeneity of molecular\ndata. In this work, we introduce CPTAC-PROTSTRUCT, the first instruction tuning\ndataset for molecular understanding of oncology, comprising over 400k\nopen-ended examples derived from individualized proteomic profiles curated from\nthe largest national proteomics cancer study (CPTAC). Additionally, we propose\nKRONOS (Knowledge Representation of patient Omics Networks in Oncology via\nStructured tuning), a novel graph-LLM framework that leverages molecular\ninteraction topology with proteomics to learn patient-specific graph\nrepresentations for enhanced clinical reasoning. We show that KRONOS achieves\ncompetitive performance across benchmark clinical tasks, including molecular\nclassification, temporal trajectory modeling, and tumor stage prediction from\nproteomics data. Ultimately, this approach empowers LLMs to understand\npatient-level pathogenesis, advancing precision medicine through more accurate\ndiagnosis, prognosis, and treatment stratification."}
{"id": "2509.23543", "pdf": "https://arxiv.org/pdf/2509.23543", "abs": "https://arxiv.org/abs/2509.23543", "authors": ["Luxuan Zhang", "Douglas Jiang", "Qinglong Wang", "Haoqi Sun", "Feng Tian"], "title": "Contrastive Learning Enhances Language Model Based Cell Embeddings for Low-Sample Single Cell Transcriptomics", "categories": ["q-bio.GN", "cs.NE", "q-bio.MN"], "comment": "14 pages, 4 figures, 2 tables", "summary": "Large language models (LLMs) have shown strong ability in generating rich\nrepresentations across domains such as natural language processing and\ngeneration, computer vision, and multimodal learning. However, their\napplication in biomedical data analysis remains nascent. Single-cell\ntranscriptomic profiling is essential for dissecting cell subtype diversity in\ndevelopment and disease, but rare subtypes pose challenges for scaling laws. We\npresent a computational framework that integrates single-cell RNA sequencing\n(scRNA-seq) with LLMs to derive knowledge-informed gene embeddings. Highly\nexpressed genes for each cell are mapped to NCBI Gene descriptions and embedded\nusing models such as text-embedding-ada-002, BioBERT, and SciBERT. Applied to\nretinal ganglion cells (RGCs), which differ in vulnerability to\nglaucoma-related neurodegeneration, this strategy improves subtype\nclassification, highlights biologically significant features, and reveals\npathways underlying selective neuronal vulnerability. More broadly, it\nillustrates how LLM-derived embeddings can augment biological analysis under\ndata-limited conditions and lay the groundwork for future foundation models in\nsingle-cell biology."}
{"id": "2509.22920", "pdf": "https://arxiv.org/pdf/2509.22920", "abs": "https://arxiv.org/abs/2509.22920", "authors": ["Will Ke Wang", "Rui Yang", "Chao Pang", "Karthik Natarajan", "Nan Liu", "Daniel McDuff", "David Slotwiner", "Fei Wang", "Xuhai Orson Xu"], "title": "Beyond the Clinic: A Large-Scale Evaluation of Augmenting EHR with Wearable Data for Diverse Health Prediction", "categories": ["q-bio.QM"], "comment": null, "summary": "Electronic health records (EHRs) provide a powerful basis for predicting the\nonset of health outcomes. Yet EHRs primarily capture in-clinic events and miss\naspects of daily behavior and lifestyle containing rich health information.\nConsumer wearables, by contrast, continuously measure activity, heart rate, and\nsleep, and more, offering complementary signals that can fill this gap. Despite\nthis potential, there has been little systematic evaluation of the benefit that\nwearable data can bring to health outcome prediction on top of EHRs. In this\nstudy, we present an extensible framework for multimodal health outcome\nprediction that integrates EHR and wearable data streams. Using data from the\nAll of Us Program, we systematically compared the combination of different\nencoding methods on EHR and wearable data, including the traditional feature\nengineering approach, as well as foundation model embeddings. Across ten\nclinical outcomes, wearable integration consistently improved model performance\nrelative to EHR-only baselines, e.g., average delta AUROC +5.8% for major\ndepressive disorder, +10.7% for hypertension, and +12.2% for diabetes. On\naverage across all ten outcomes, fusing EHRs with wearable features shows 8.9%\nimprovement in AUROC. To our knowledge, this is the first large-scale\nevaluation of wearable-EHR fusion, underscoring the utility of wearable-derived\nsignals in complementing EHRs and enabling more holistic, personalized health\noutcome predictions. Meanwhile, our analysis elucidates future directions for\noptimizing foundation models for wearable data and its integration with EHR\ndata."}
{"id": "2509.22950", "pdf": "https://arxiv.org/pdf/2509.22950", "abs": "https://arxiv.org/abs/2509.22950", "authors": ["Supantha Dey", "Ratul Chowdhury"], "title": "Twin Peaks: Dual-Head Architecture for Structure-Free Prediction of Protein-Protein Binding Affinity and Mutation Effects", "categories": ["q-bio.QM"], "comment": null, "summary": "We present a novel dual-head deep learning architecture for protein-protein\ninteraction modeling that enables simultaneous prediction of binding affinity\n($\\Delta G$) and mutation-induced affinity changes ($\\Delta\\Delta G$) using\nonly protein sequence information. Our approach offers a significant\nadvancement over existing methods by employing specialized prediction heads\nthat operate on a shared representation network, allowing direct and optimized\nprediction of both values. To ensure robust generalization, we integrated\ncomplementary datasets from SKEMPI v2 and PDBbind with a rigorous protein\ndomain-based splitting strategy that prevents information leakage between\ntraining and validation sets. Our architecture combines transformer-based\nencoders with a novel cross-attention mechanism that processes paired protein\nsequences directly, without requiring any structural information. The network\nembeds input sequences using ESM3 representations, then employs a learnable\nsliced window embedding layer to manage variable-length sequences efficiently.\nA multi-layer transformer encoder with bidirectional self-attention captures\nintra-protein patterns, while cross-attention layers enable explicit modeling\nof interactions between protein pairs. This shared representation network feeds\ninto separate $\\Delta G$ and $\\Delta\\Delta G$ prediction heads, allowing\ntask-specific optimization while leveraging common features. The model achieves\n$\\Delta\\Delta G$ validation of Pearson correlation at 0.485, while maintaining\nstrong $\\Delta G$ predictions (Pearson: 0.638). While existing approaches\nrequire protein structure data and binding interface information, our model\neliminates these constraints. This provides a critical advantage for the\nnumerous proteins with unknown structures or those challenging to crystallize,\nsuch as viral and intrinsically disordered proteins."}
{"id": "2509.23445", "pdf": "https://arxiv.org/pdf/2509.23445", "abs": "https://arxiv.org/abs/2509.23445", "authors": ["Andre Archer", "Brett J. Palmero", "Charlotte Abrahamson", "Carolyn E. Mills", "Nolan W. Kennedy", "Danielle Tullman-Ercek", "Niall M. Mangan"], "title": "Uncertainty Quantification of Bacterial Microcompartment Permeability", "categories": ["q-bio.QM", "q-bio.SC"], "comment": "30 pages, 7 figures", "summary": "$\\textit{Salmonella}$ expresses bacterial microcompartments (MCPs) upon\n1,2-propanediol exposure. MCPs are nanoscale protein-bound shells that encase\nenzymes for the cofactor-dependent 1,2-propanediol metabolism. They are\nhypothesized to limit exposure to the toxic intermediate, propionaldehyde,\ndecrease cofactor involvement in competing reactions, and enhance flux. We\nconstruct a mass-action mathematical model of purified MCPs and calibrate\nparameters to measured metabolite concentrations. We constrain mass-action\nkinetic parameters to previously estimated Michaelis-Menten parameters. We\nidentified two distinct fits with different dynamics in the pathway product,\npropionate, but similar goodness of fit. Across fits, we inferred that the MCP\n1,2-propanediol and propionaldehyde permeability should be greater than\n$10^{-6}$ and $10^{-8}$ m/s, respectively. Our results identify parameter\nranges consistent with prevailing theories that MCPs impose preferential\ndiffusion to 1,2-propanediol over propionaldehyde, and sequester toxic\npropionaldehyde away from the cell cytosol. The bimodality of the posterior\ndistribution arises from bimodality in the estimated coenzyme-A (CoA)\npermeability and inhibition rates. The MCP permeability to CoA was inferred to\nbe either less than $10^{-8.8}$ m/s or greater than $10^{-7.3}$ m/s. In a high\nCoA permeability environment with low rates of CoA inhibition, enzymes produced\nmetabolites by recycling (NAD+)/(NADH). In a low CoA permeability environment\nwith high rates of CoA inhibition, enzymes required external NAD+/H to produce\nmetabolites. Dynamics are consistent with prevailing hypotheses about MCP\nfunction to sequester toxic propionaldehyde, and additional collection of data\npoints between 6 and 24 hours or characterization of enzyme inhibition rates\ncould further reduce uncertainty and provide better permeability estimates."}
{"id": "2509.23847", "pdf": "https://arxiv.org/pdf/2509.23847", "abs": "https://arxiv.org/abs/2509.23847", "authors": ["Anton Stratmann", "Martin Beyß", "Johann F. Jadebeck", "Wolfgang Wiechert", "Katharina Nöh"], "title": "13CFLUX -- Third-generation high-performance engine for isotopically (non)stationary 13C metabolic flux analysis", "categories": ["q-bio.QM"], "comment": null, "summary": "13C-based metabolic flux analysis (13C-MFA) is a cornerstone of quantitative\nsystems biology, yet its increasing data complexity and methodological\ndiversity place high demands on simulation software. We introduce 13CFLUX(v3),\na third-generation simulation platform that combines a high-performance C++\nengine with a convenient Python interface. The software delivers substantial\nperformance gains across isotopically stationary and nonstationary analysis\nworkflows, while remaining flexible to accommodate diverse labeling strategies\nand analytical platforms. Its open-source availability facilitates seamless\nintegration into computational ecosystems and community-driven extension. By\nsupporting multi-experiment integration, multi-tracer studies, and advanced\nstatistical inference such as Bayesian analysis, 13CFLUX provides a robust and\nextensible framework for modern fluxomics research."}
{"id": "2509.24262", "pdf": "https://arxiv.org/pdf/2509.24262", "abs": "https://arxiv.org/abs/2509.24262", "authors": ["Nimisha Ghosh", "Dheeran Sankaran", "Rahul Balakrishnan Adhi", "Sharath S", "Amrut Anand"], "title": "LAMP-PRo: Label-aware Attention for Multi-label Prediction of DNA- and RNA-binding Proteins using Protein Language Models", "categories": ["q-bio.QM", "cs.AI", "cs.LG"], "comment": null, "summary": "Identifying DNA- (DBPs) and RNA-binding proteins (RBPs) is crucial for the\nunderstanding of cell function, molecular interactions as well as regulatory\nfunctions. Owing to their high similarity, most of the existing approaches face\nchallenges in differentiating between DBPs and RBPs leading to high\ncross-prediction errors. Moreover, identifying proteins which bind to both DNA\nand RNA (DRBPs) is also quite a challenging task. In this regard, we propose a\nnovel framework viz. LAMP-PRo which is based on pre-trained protein language\nmodel (PLM), attention mechanisms and multi-label learning to mitigate these\nissues. First, pre-trained PLM such ESM-2 is used for embedding the protein\nsequences followed by convolutional neural network (CNN). Subsequently\nmulti-head self-attention mechanism is applied for the contextual information\nwhile label-aware attention is used to compute class-specific representations\nby attending to the sequence in a way that is tailored to each label (DBP, RBP\nand non-NABP) in a multi-label setup. We have also included a novel cross-label\nattention mechanism to explicitly capture dependencies between DNA- and\nRNA-binding proteins, enabling more accurate prediction of DRBP. Finally, a\nlinear layer followed by a sigmoid function are used for the final prediction.\nExtensive experiments are carried out to compare LAMP-PRo with the existing\nmethods wherein the proposed model shows consistent competent performance.\nFurthermore, we also provide visualization to showcase model interpretability,\nhighlighting which parts of the sequence are most relevant for a predicted\nlabel. The original datasets are available at http://bliulab.net/iDRBP\\_MMC and\nthe codes are available at https://github.com/NimishaGhosh/LAMP-PRo."}
{"id": "2509.24952", "pdf": "https://arxiv.org/pdf/2509.24952", "abs": "https://arxiv.org/abs/2509.24952", "authors": ["Amandla Mabona", "Jemma Daniel", "Henrik Servais Janssen Knudsen", "Rachel Catzel", "Kevin Michael Eloff", "Erwin M. Schoof", "Nicolas Lopez Carranza", "Timothy P. Jenkins", "Jeroen Van Goey", "Konstantinos Kalogeropoulos"], "title": "De novo peptide sequencing rescoring and FDR estimation with Winnow", "categories": ["q-bio.QM"], "comment": null, "summary": "Machine learning has markedly advanced de novo peptide sequencing (DNS) for\nmass spectrometry-based proteomics. DNS tools offer a reliable way to identify\npeptides without relying on reference databases, extending proteomic analysis\nand unlocking applications into less-charted regions of the proteome. However,\nthey still face a key limitation. DNS tools lack principled methods for\nestimating false discovery rates (FDR) and instead rely on model-specific\nconfidence scores that are often miscalibrated. This limits trust in results,\nhinders cross-model comparisons and reduces validation success. Here we present\nWinnow, a model-agnostic framework for estimating FDR from calibrated DNS\noutputs. Winnow maps raw model scores to calibrated confidences using a neural\nnetwork trained on peptide-spectrum match (PSM)-derived features. From these\ncalibrated scores, Winnow computes PSM-specific error metrics and an\nexperiment-wide FDR estimate using a novel decoy-free FDR estimator. It\nsupports both zero-shot and dataset-specific calibration, enabling flexible\napplication via direct inference, fine-tuning, or training a custom model. We\ndemonstrate that, when applied to InstaNovo predictions, Winnow's calibrator\nimproves recall at fixed FDR thresholds, and its FDR estimator tracks true\nerror rates when benchmarked against reference proteomes and database search.\nWinnow ensures accurate FDR control across datasets, helping unlock the full\npotential of DNS."}
{"id": "2509.22760", "pdf": "https://arxiv.org/pdf/2509.22760", "abs": "https://arxiv.org/abs/2509.22760", "authors": ["Achraf Zinihi"], "title": "Identifying Memory Effects in Epidemics via a Fractional SEIRD Model and Physics-Informed Neural Networks", "categories": ["stat.ML", "cs.LG", "q-bio.QM", "92C60, 26A33, 65L05, 68T07"], "comment": null, "summary": "We develop a physics-informed neural network (PINN) framework for parameter\nestimation in fractional-order SEIRD epidemic models. By embedding the Caputo\nfractional derivative into the network residuals via the L1 discretization\nscheme, our method simultaneously reconstructs epidemic trajectories and infers\nboth epidemiological parameters and the fractional memory order $\\alpha$. The\nfractional formulation extends classical integer-order models by capturing\nlong-range memory effects in disease progression, incubation, and recovery. Our\nframework learns the fractional memory order $\\alpha$ as a trainable parameter\nwhile simultaneously estimating the epidemiological rates $(\\beta, \\sigma,\n\\gamma, \\mu)$. A composite loss combining data misfit, physics residuals, and\ninitial conditions, with constraints on positivity and population conservation,\nensures both accuracy and biological consistency. Tests on synthetic Mpox data\nconfirm reliable recovery of $\\alpha$ and parameters under noise, while\napplications to COVID-19 show that optimal $\\alpha \\in (0, 1]$ captures memory\neffects and improves predictive performance over the classical SEIRD model.\nThis work establishes PINNs as a robust tool for learning memory effects in\nepidemic dynamics, with implications for forecasting, control strategies, and\nthe analysis of non-Markovian epidemic processes."}
{"id": "2509.23552", "pdf": "https://arxiv.org/pdf/2509.23552", "abs": "https://arxiv.org/abs/2509.23552", "authors": ["Md. Saiful Bari Siddiqui", "Nowshin Tarannum"], "title": "Fusing Sequence Motifs and Pan-Genomic Features: Antimicrobial Resistance Prediction using an Explainable Lightweight 1D CNN-XGBoost Ensemble", "categories": ["cs.LG", "cs.AI", "q-bio.GN", "q-bio.QM"], "comment": "Submitted to SCA/HPCAsia 2026. This preprint version has been\n  prepared for open-access distribution and may differ in formatting from the\n  official proceedings. Also available on bioRxiv for visibility to the life\n  sciences community", "summary": "Antimicrobial Resistance (AMR) is a rapidly escalating global health crisis.\nWhile genomic sequencing enables rapid prediction of resistance phenotypes,\ncurrent computational methods have limitations. Standard machine learning\nmodels treat the genome as an unordered collection of features, ignoring the\nsequential context of Single Nucleotide Polymorphisms (SNPs). State-of-the-art\nsequence models like Transformers are often too data-hungry and computationally\nexpensive for the moderately-sized datasets that are typical in this domain. To\naddress these challenges, we propose AMR-EnsembleNet, an ensemble framework\nthat synergistically combines sequence-based and feature-based learning. We\ndeveloped a lightweight, custom 1D Convolutional Neural Network (CNN) to\nefficiently learn predictive sequence motifs from high-dimensional SNP data.\nThis sequence-aware model was ensembled with an XGBoost model, a powerful\ngradient boosting system adept at capturing complex, non-local feature\ninteractions. We trained and evaluated our framework on a benchmark dataset of\n809 E. coli strains, predicting resistance across four antibiotics with varying\nclass imbalance. Our 1D CNN-XGBoost ensemble consistently achieved top-tier\nperformance across all the antibiotics, reaching a Matthews Correlation\nCoefficient (MCC) of 0.926 for Ciprofloxacin (CIP) and the highest Macro\nF1-score of 0.691 for the challenging Gentamicin (GEN) AMR prediction. We also\nshow that our model consistently focuses on SNPs within well-known AMR genes\nlike fusA and parC, confirming it learns the correct genetic signals for\nresistance. Our work demonstrates that fusing a sequence-aware 1D CNN with a\nfeature-based XGBoost model creates a powerful ensemble, overcoming the\nlimitations of using either an order-agnostic or a standalone sequence model."}
{"id": "2509.23942", "pdf": "https://arxiv.org/pdf/2509.23942", "abs": "https://arxiv.org/abs/2509.23942", "authors": ["John N. Daras"], "title": "Efficient Identification of High Similarity Clusters in Polygon Datasets", "categories": ["cs.LG", "cs.DB", "q-bio.QM"], "comment": "11 pages, 3 figures", "summary": "Advancements in tools like Shapely 2.0 and Triton can significantly improve\nthe efficiency of spatial similarity computations by enabling faster and more\nscalable geometric operations. However, for extremely large datasets, these\noptimizations may face challenges due to the sheer volume of computations\nrequired. To address this, we propose a framework that reduces the number of\nclusters requiring verification, thereby decreasing the computational load on\nthese systems. The framework integrates dynamic similarity index thresholding,\nsupervised scheduling, and recall-constrained optimization to efficiently\nidentify clusters with the highest spatial similarity while meeting\nuser-defined precision and recall requirements. By leveraging Kernel Density\nEstimation (KDE) to dynamically determine similarity thresholds and machine\nlearning models to prioritize clusters, our approach achieves substantial\nreductions in computational cost without sacrificing accuracy. Experimental\nresults demonstrate the scalability and effectiveness of the method, offering a\npractical solution for large-scale geospatial analysis."}
{"id": "2509.24063", "pdf": "https://arxiv.org/pdf/2509.24063", "abs": "https://arxiv.org/abs/2509.24063", "authors": ["Lukas Breitwieser", "Ahmad Hesam", "Abdullah Giray Yağlıkçı", "Mohammad Sadrosadati", "Fons Rademakers", "Onur Mutlu"], "title": "TeraAgent: A Distributed Agent-Based Simulation Engine for Simulating Half a Trillion Agents", "categories": ["cs.DC", "cs.CE", "cs.MA", "cs.PF", "q-bio.QM"], "comment": null, "summary": "Agent-based simulation is an indispensable paradigm for studying complex\nsystems. These systems can comprise billions of agents, requiring the computing\nresources of multiple servers to simulate. Unfortunately, the state-of-the-art\nplatform, BioDynaMo, does not scale out across servers due to its\nshared-memory-based implementation.\n  To overcome this key limitation, we introduce TeraAgent, a distributed\nagent-based simulation engine. A critical challenge in distributed execution is\nthe exchange of agent information across servers, which we identify as a major\nperformance bottleneck. We propose two solutions: 1) a tailored serialization\nmechanism that allows agents to be accessed and mutated directly from the\nreceive buffer, and 2) leveraging the iterative nature of agent-based\nsimulations to reduce data transfer with delta encoding.\n  Built on our solutions, TeraAgent enables extreme-scale simulations with half\na trillion agents (an 84x improvement), reduces time-to-result with additional\ncompute nodes, improves interoperability with third-party tools, and provides\nusers with more hardware flexibility."}
{"id": "2509.24933", "pdf": "https://arxiv.org/pdf/2509.24933", "abs": "https://arxiv.org/abs/2509.24933", "authors": ["Sebastian W. Ober", "Calvin McCarter", "Aniruddh Raghu", "Yucen Lily Li", "Alan N. Amin", "Andrew Gordon Wilson", "Hunter Elliott"], "title": "Is Sequence Information All You Need for Bayesian Optimization of Antibodies?", "categories": ["cs.LG", "q-bio.QM"], "comment": "Accepted into the AI for Science Workshop, NeurIPS 2025", "summary": "Bayesian optimization is a natural candidate for the engineering of antibody\ntherapeutic properties, which is often iterative and expensive. However,\nfinding the optimal choice of surrogate model for optimization over the highly\nstructured antibody space is difficult, and may differ depending on the\nproperty being optimized. Moreover, to the best of our knowledge, no prior\nworks have attempted to incorporate structural information into antibody\nBayesian optimization. In this work, we explore different approaches to\nincorporating structural information into Bayesian optimization, and compare\nthem to a variety of sequence-only approaches on two different antibody\nproperties, binding affinity and stability. In addition, we propose the use of\na protein language model-based ``soft constraint,'' which helps guide the\noptimization to promising regions of the space. We find that certain types of\nstructural information improve data efficiency in early optimization rounds for\nstability, but have equivalent peak performance. Moreover, when incorporating\nthe protein language model soft constraint we find that the data efficiency gap\nis diminished for affinity and eliminated for stability, resulting in\nsequence-only methods that match the performance of structure-based methods,\nraising questions about the necessity of structure in Bayesian optimization for\nantibodies."}
