{"id": "2506.22641", "pdf": "https://arxiv.org/pdf/2506.22641", "abs": "https://arxiv.org/abs/2506.22641", "authors": ["Gabriel M. Mejia", "Henry E. Miller", "Francis J. A. Leblanc", "Bo Wang", "Brendan Swain", "Lucas Paulo de Lima Camillo"], "title": "Diversity by Design: Addressing Mode Collapse Improves scRNA-seq Perturbation Modeling on Well-Calibrated Metrics", "categories": ["q-bio.GN", "cs.LG", "q-bio.MN", "stat.ML"], "comment": null, "summary": "Recent benchmarks reveal that models for single-cell perturbation response\nare often outperformed by simply predicting the dataset mean. We trace this\nanomaly to a metric artifact: control-referenced deltas and unweighted error\nmetrics reward mode collapse whenever the control is biased or the biological\nsignal is sparse. Large-scale \\textit{in silico} simulations and analysis of\ntwo real-world perturbation datasets confirm that shared reference shifts, not\ngenuine biological change, drives high performance in these evaluations. We\nintroduce differentially expressed gene (DEG)-aware metrics, weighted\nmean-squared error (WMSE) and weighted delta $R^{2}$ ($R^{2}_{w}(\\Delta)$) with\nrespect to all perturbations, that measure error in niche signals with high\nsensitivity. We further introduce negative and positive performance baselines\nto calibrate these metrics. With these improvements, the mean baseline sinks to\nnull performance while genuine predictors are correctly rewarded. Finally, we\nshow that using WMSE as a loss function reduces mode collapse and improves\nmodel performance."}
{"id": "2506.23496", "pdf": "https://arxiv.org/pdf/2506.23496", "abs": "https://arxiv.org/abs/2506.23496", "authors": ["Praful Gagrani", "Nino Lauber", "Eric Smith", "Christoph Flamm"], "title": "Thermodynamic ranking of pathways in reaction networks", "categories": ["q-bio.MN", "cond-mat.stat-mech", "nlin.AO"], "comment": "52 pages, 10 figures", "summary": "Chemical Reaction Networks (CRNs) provide a powerful framework for modeling\ncomplex systems due to their compositionality, which makes them well-suited for\nanalyzing interactions of subsystems within larger aggregate systems. This work\npresents a thermodynamic formalism for ranking CRN pathways under fixed\nthroughput currents (fixed velocities of species flowing in and out of the\nsystem), where pathways represent subnetworks capable of performing the\nstipulated chemical conversion. We define a thermodynamic cost function for\npathways derived from the large-deviation theory of stochastic CRNs, which\ndecomposes into two components: an ongoing maintenance cost to sustain a\nnon-equilibrium steady state (NESS), and a restriction cost, quantifying the\nongoing improbability of neutralizing reactions outside the specified pathway.\nApplying this formalism to detailed-balanced CRNs in the linear response\nregime, we prove that the resistance of a CRN decreases as reactions are added\nthat support the throughput current, and that the maintenance cost, the\nrestriction cost, and the thermodynamic cost of nested pathways are bounded\nbelow by those of their hosting network. Extending the analysis far from\nequilibrium, we find that while cost is non-decreasing for progressively more\nrestricted nested pathways near equilibrium, multimolecular CRN examples can be\nfound that assign lower costs to more restricted pathways at\nfar-from-equilibrium NESSs. The possibility to reduce the resistance of a\nnetwork at fixed throughput, while also simplifying the network, may have\nimplications for enzyme family evolution, in which novel reaction mechanisms\nmay first lead to a proliferation of pathways through non-specific catalysis,\nbut later selection for specificity may benefit both from species retention,\nand more efficient use of autocatalysts to improve throughput."}
{"id": "2506.22527", "pdf": "https://arxiv.org/pdf/2506.22527", "abs": "https://arxiv.org/abs/2506.22527", "authors": ["Baran Sarac", "Elham Sharifikolouei", "Matej Micusik", "Alessandro Scalia", "Ziba Najmi", "Andrea Cochis", "Lia Rimondini", "Gabriele Barrera", "Marco Coisson", "Selin Gümrükcü", "Eray Yüce", "A. Sezai Sarac"], "title": "Enhanced Mesenchymal Stem Cell Response with Preserved Biocompatibility via (MnZn)Ferrite--Polyacrylonitrile Composite Nanofiber Membranes", "categories": ["q-bio.QM", "cond-mat.mtrl-sci", "q-bio.CB"], "comment": "Original Manuscript: 28 Pages, 9 Figures, 1 Table; Supplementary: 5\n  Pages, 2 Figures, 2 Tables", "summary": "This study focuses on the synthesis and characterization of advanced\npolymeric composite electrospun nanofibers (NFs) containing magnetic oxide\nnanoparticles (NPs). By leveraging the method of electrospinning, the research\naims to investigate polymer composites with enhanced interfacial properties,\nimproved double-layer capacitance, and adequate biocompatibility. Electrospun\npolyacrylonitrile (PAN) NFs embedded with Fe2O3 and MnZn ferrite NPs were\ncomprehensively characterized using advanced techniques, i.e., Fourier\ntransform infrared spectroscopy (FTIR), X-ray photoelectron spectroscopy (XPS),\nhigh-resolution scanning electron microscopy (HR-SEM), X-ray diffraction (XRD),\nand alternating gradient field magnetometry (AGFM). The incorporation of metal\noxide NPs led to significant changes in the thermal, spectroscopic, and\nmorphological properties of the NFs. XPS analysis confirmed increased\noxidation, graphitic carbon content, and the formation of new nitrogen\nfunctionalities after heat treatment. Furthermore, interactions between nitrile\ngroups and metal ions were observed, indicating the influence of nanoparticles\non surface chemistry. Magnetic characterization demonstrated the potential of\nthese composite NFs to generate magnetic fields for biomedical manipulation.\nCytocompatibility studies revealed no significant impact on the viability or\nmorphology of human mesenchymal stromal cells, highlighting their\nbiocompatibility. These findings suggest the promising use of PAN-magnetic NFs\nin applications including targeted drug administration, magnetic resonance\nimaging (MRI), and magnetic hyperthermia for cancer treatment."}
{"id": "2506.22633", "pdf": "https://arxiv.org/pdf/2506.22633", "abs": "https://arxiv.org/abs/2506.22633", "authors": ["Olivier Witteveen", "Samuel J. Rosen", "Ryan S. Lach", "Maxwell Z. Wilson", "Marianne Bauer"], "title": "Optimizing information transmission in the canonical Wnt pathway", "categories": ["physics.bio-ph", "q-bio.MN"], "comment": null, "summary": "Populations of cells regulate gene expression in response to external\nsignals, but their ability to make reliable collective decisions is limited by\nboth intrinsic noise in molecular signaling and variability between individual\ncells. In this work, we use optogenetic control of the canonical Wnt pathway as\nan example to study how reliably information about an external signal is\ntransmitted to a population of cells, and determine an optimal encoding\nstrategy to maximize information transmission from Wnt signals to gene\nexpression. We find that it is possible to reach an information capacity beyond\n1 bit only through an appropriate, discrete encoding of signals. By averaging\nover an increasing number of outputs, we systematically vary the effective\nnoise in the pathway. As the effective noise decreases, the optimal encoding\ncomprises more discrete input signals. These signals do not need to be\nfine-tuned. The optimal code transitions into a continuous code in the\nsmall-noise limit, which can be shown to be consistent with the Jeffreys prior.\nWe visualize the performance of signal encodings using decoding maps. Our\nresults suggest optogenetic Wnt signaling allows for regulatory control beyond\na simple binary switch, and provides a framework to apply ideas from\ninformation processing to single-cell in vitro experiments."}
{"id": "2506.23008", "pdf": "https://arxiv.org/pdf/2506.23008", "abs": "https://arxiv.org/abs/2506.23008", "authors": ["Cong Fu", "Yuchao Lin", "Zachary Krueger", "Wendi Yu", "Xiaoning Qian", "Byung-Jun Yoon", "Raymundo Arróyave", "Xiaofeng Qian", "Toshiyuki Maeda", "Maho Nakata", "Shuiwang Ji"], "title": "A Benchmark for Quantum Chemistry Relaxations via Machine Learning Interatomic Potentials", "categories": ["q-bio.QM"], "comment": null, "summary": "Computational quantum chemistry plays a critical role in drug discovery,\nchemical synthesis, and materials science. While first-principles methods, such\nas density functional theory (DFT), provide high accuracy in modeling\nelectronic structures and predicting molecular properties, they are\ncomputationally expensive. Machine learning interatomic potentials (MLIPs) have\nemerged as promising surrogate models that aim to achieve DFT-level accuracy\nwhile enabling efficient large-scale atomistic simulations. The development of\naccurate and transferable MLIPs requires large-scale, high-quality datasets\nwith both energy and force labels. Critically, MLIPs must generalize not only\nto stable geometries but also to intermediate, non-equilibrium conformations\nencountered during atomistic simulations. In this work, we introduce\nPubChemQCR, a large-scale dataset of molecular relaxation trajectories curated\nfrom the raw geometry optimization outputs of the PubChemQC project. PubChemQCR\nis the largest publicly available dataset of DFT-based relaxation trajectories\nfor small organic molecules, comprising approximately 3.5 million trajectories\nand over 300 million molecular conformations computed at various levels of\ntheory. Each conformation is labeled with both total energy and atomic forces,\nmaking the dataset suitable for training and evaluating MLIPs. To provide\nbaselines for future developments, we benchmark nine representative MLIP models\non the dataset. Our resources are publicly available at\nhttps://huggingface.co/divelab"}
{"id": "2506.22641", "pdf": "https://arxiv.org/pdf/2506.22641", "abs": "https://arxiv.org/abs/2506.22641", "authors": ["Gabriel M. Mejia", "Henry E. Miller", "Francis J. A. Leblanc", "Bo Wang", "Brendan Swain", "Lucas Paulo de Lima Camillo"], "title": "Diversity by Design: Addressing Mode Collapse Improves scRNA-seq Perturbation Modeling on Well-Calibrated Metrics", "categories": ["q-bio.GN", "cs.LG", "q-bio.MN", "stat.ML"], "comment": null, "summary": "Recent benchmarks reveal that models for single-cell perturbation response\nare often outperformed by simply predicting the dataset mean. We trace this\nanomaly to a metric artifact: control-referenced deltas and unweighted error\nmetrics reward mode collapse whenever the control is biased or the biological\nsignal is sparse. Large-scale \\textit{in silico} simulations and analysis of\ntwo real-world perturbation datasets confirm that shared reference shifts, not\ngenuine biological change, drives high performance in these evaluations. We\nintroduce differentially expressed gene (DEG)-aware metrics, weighted\nmean-squared error (WMSE) and weighted delta $R^{2}$ ($R^{2}_{w}(\\Delta)$) with\nrespect to all perturbations, that measure error in niche signals with high\nsensitivity. We further introduce negative and positive performance baselines\nto calibrate these metrics. With these improvements, the mean baseline sinks to\nnull performance while genuine predictors are correctly rewarded. Finally, we\nshow that using WMSE as a loss function reduces mode collapse and improves\nmodel performance."}
{"id": "2506.23857", "pdf": "https://arxiv.org/pdf/2506.23857", "abs": "https://arxiv.org/abs/2506.23857", "authors": ["Javad Noorbakhsh", "Ali Foroughi pour", "Jeffrey Chuang"], "title": "Emerging AI Approaches for Cancer Spatial Omics", "categories": ["q-bio.QM", "q-bio.TO"], "comment": "25 pages, 1 figure", "summary": "Technological breakthroughs in spatial omics and artificial intelligence (AI)\nhave the potential to transform the understanding of cancer cells and the tumor\nmicroenvironment. Here we review the role of AI in spatial omics, discussing\nthe current state-of-the-art and further needs to decipher cancer biology from\nlarge-scale spatial tissue data. An overarching challenge is the development of\ninterpretable spatial AI models, an activity which demands not only improved\ndata integration, but also new conceptual frameworks. We discuss emerging\nparadigms, in particular data-driven spatial AI, constraint-based spatial AI,\nand mechanistic spatial modeling, as well as the importance of integrating AI\nwith hypothesis-driven strategies and model systems to realize the value of\ncancer spatial information."}
{"id": "2506.23182", "pdf": "https://arxiv.org/pdf/2506.23182", "abs": "https://arxiv.org/abs/2506.23182", "authors": ["Robert Frank", "Michael Widrich", "Rahmad Akbar", "Günter Klambauer", "Geir Kjetil Sandve", "Philippe A. Robert", "Victor Greiff"], "title": "Attribution assignment for deep-generative sequence models enables interpretability analysis using positive-only data", "categories": ["cs.LG", "q-bio.QM"], "comment": null, "summary": "Generative machine learning models offer a powerful framework for therapeutic\ndesign by efficiently exploring large spaces of biological sequences enriched\nfor desirable properties. Unlike supervised learning methods, which require\nboth positive and negative labeled data, generative models such as LSTMs can be\ntrained solely on positively labeled sequences, for example, high-affinity\nantibodies. This is particularly advantageous in biological settings where\nnegative data are scarce, unreliable, or biologically ill-defined. However, the\nlack of attribution methods for generative models has hindered the ability to\nextract interpretable biological insights from such models. To address this\ngap, we developed Generative Attribution Metric Analysis (GAMA), an attribution\nmethod for autoregressive generative models based on Integrated Gradients. We\nassessed GAMA using synthetic datasets with known ground truths to characterize\nits statistical behavior and validate its ability to recover biologically\nrelevant features. We further demonstrated the utility of GAMA by applying it\nto experimental antibody-antigen binding data. GAMA enables model\ninterpretability and the validation of generative sequence design strategies\nwithout the need for negative training data."}
{"id": "2506.23287", "pdf": "https://arxiv.org/pdf/2506.23287", "abs": "https://arxiv.org/abs/2506.23287", "authors": ["Zelin Zang", "WenZhe Li", "Fei Chen", "Yongjie Xu", "Chang Yu", "Zhen Lei", "Stan Z. Li"], "title": "Hierarchical Quantized Diffusion Based Tree Generation Method for Hierarchical Representation and Lineage Analysis", "categories": ["cs.LG", "q-bio.QM"], "comment": "9 pages, 6 figures, under review", "summary": "In single-cell research, tracing and analyzing high-throughput single-cell\ndifferentiation trajectories is crucial for understanding complex biological\nprocesses. Key to this is the modeling and generation of hierarchical data that\nrepresents the intrinsic structure within datasets. Traditional methods face\nlimitations in terms of computational cost, performance, generative capacity,\nand stability. Recent VAEs based approaches have made strides in addressing\nthese challenges but still require specialized network modules for each tree\nbranch, limiting their stability and ability to capture deep hierarchical\nrelationships. To overcome these challenges, we introduce diffusion-based\napproach called HDTree. HDTree captures tree relationships within a\nhierarchical latent space using a unified hierarchical codebook and quantized\ndiffusion processes to model tree node transitions. This method improves\nstability by eliminating branch-specific modules and enhancing generative\ncapacity through gradual hierarchical changes simulated by the diffusion\nprocess. HDTree's effectiveness is demonstrated through comparisons on both\ngeneral-purpose and single-cell datasets, where it outperforms existing methods\nin terms of accuracy and performance. These contributions provide a new tool\nfor hierarchical lineage analysis, enabling more accurate and efficient\nmodeling of cellular differentiation paths and offering insights for downstream\nbiological tasks. The code of HDTree is available at anonymous link\nhttps://anonymous.4open.science/r/code_HDTree_review-A8DB."}
{"id": "2506.23339", "pdf": "https://arxiv.org/pdf/2506.23339", "abs": "https://arxiv.org/abs/2506.23339", "authors": ["Malikussaid", "Hilal Hudan Nuha"], "title": "VALID-Mol: a Systematic Framework for Validated LLM-Assisted Molecular Design", "categories": ["cs.LG", "cs.AI", "physics.chem-ph", "q-bio.QM"], "comment": "16 pages, 1 figure, 5 algorithms, 7 tables, to be published in ICSECS\n  Conference 2025, unabridged version", "summary": "Large Language Models (LLMs) demonstrate remarkable potential for scientific\ndiscovery, but their application in domains requiring factual accuracy and\ndomain-specific constraints remains challenging. In molecular design for drug\ndiscovery, LLMs can suggest creative molecular modifications but often produce\nchemically invalid or impractical structures. We present VALID-Mol, a\nsystematic framework for integrating chemical validation with LLM-driven\nmolecular design that increases the rate of generating valid chemical\nstructures from 3% to 83%. Our approach combines methodical prompt engineering,\nautomated chemical validation, and a fine-tuned domain-adapted LLM to ensure\nreliable generation of synthesizable molecules with improved properties. Beyond\nthe specific implementation, we contribute a generalizable methodology for\nscientifically-constrained LLM applications, with quantifiable reliability\nimprovements. Computational predictions suggest our framework can generate\npromising candidates for synthesis with up to 17-fold computationally predicted\nimprovements in target affinity while maintaining synthetic accessibility. We\nprovide a detailed analysis of our prompt engineering process, validation\narchitecture, and fine-tuning approach, offering a reproducible blueprint for\napplying LLMs to other scientific domains where domain-specific validation is\nessential."}
{"id": "2506.23380", "pdf": "https://arxiv.org/pdf/2506.23380", "abs": "https://arxiv.org/abs/2506.23380", "authors": ["Pradeep Pillai", "Tarik C. Gouhier"], "title": "Time-structured models of population growth in fluctuating environments", "categories": ["q-bio.PE", "q-bio.QM"], "comment": null, "summary": "1. Although environmental variability is expected to play a more prominent\nrole under climate change, current demographic models that ignore the\ndifferential environmental histories of cohorts across generations are unlikely\nto accurately predict population dynamics and growth. The use of these\napproaches, which we collectively refer to as non time-structured models or\nnTSMs, will instead yield error-prone estimates by giving rise to a form of\necological memory loss due to their inability to account for the historical\neffects of past environmental exposure on subsequent growth rates.\n  2. To address this important issue, we introduce a new class of\ntime-structured models or TSMs that accurately depict growth under variable\nenvironments by splitting seemingly homogeneous populations into distinct\ndemographic cohorts based on their past exposure to environmental fluctuations.\nBy accounting for this cryptic population structure, TSMs accurately simulate\nthe historical effects of environmental variability, even when individuals\nexhibit different degrees of phenotypic plasticity.\n  3. Here, we provide a conceptual framework, the mathematical tools needed to\nsimulate any TSM, and a closed form solution for simple exponential growth. We\nthen show that traditional nTSMs yield large errors compared to TSMs when\nestimating population dynamics under fluctuating temperatures. Overall, TSMs\nrepresent a critical tool for predicting population growth in a variable world."}
{"id": "2506.23612", "pdf": "https://arxiv.org/pdf/2506.23612", "abs": "https://arxiv.org/abs/2506.23612", "authors": ["Xu Pin", "Cui Jingyu", "Cheng Zhi", "Simon Chi-Chin Shiu", "Cui Jingxian", "Li Yujian", "Liu Yifan", "Wang Lin", "Ryan Ho Ping Siu", "Julian A. Tanner", "Yu Changyuan"], "title": "Nanoplasmonic Optical Fiber Sensing of SARS-CoV-2 Nucleocapsid Protein Using an Aptamer-DNA Tetrahedron Interface", "categories": ["physics.optics", "q-bio.QM"], "comment": null, "summary": "Optical fiber sensing carries a number of potential advantages for\ndiagnostics and biomarker detection and monitoring, yet particular challenges\npersist in linking molecular recognition events to a change in the refractive\nindex. DNA aptamers carry particular advantages as functional surface molecules\non optical fibers to tailor detection of specific biomolecules, yet challenges\npersist around sensitivity and specificity. Diagnosis of COVID-19 through\ndetection of nucleocapsid protein (N protein) of SARS-CoV-2 provides a classic\ndiagnostic challenge where optical fiber-based sensing could complement and\nimprove on typical detection methods such as RT-PCR and rapid antigen testing.\nIn this study, a plasmonic gold-coated tilted fiber Bragg grating (TFBG)-based\noptical biosensing platform was developed for ultrasensitive detection of\nSARS-CoV-2 N protein. By functionalizing the optical fiber surface with\naptamers for the molecular recognition of N protein, changes in refractive\nindex measured biomolecular binding, thereby achieving real-time, label-free\ndetection. Additionally, integrating DNA nanostructures such as the DNA\ntetrahedron with aptamers significantly enhanced detection sensitivity,\nincreasing signal intensity ~2.5 times compared to aptamers alone. This study\nprovides new insights into the development of high-performance optical fiber\nsensing platforms which integrate DNA nanostructure interfaces to facilitate\nbiomarker recognition and sensing."}
