{"id": "2509.07357", "pdf": "https://arxiv.org/pdf/2509.07357", "abs": "https://arxiv.org/abs/2509.07357", "authors": ["Heng Li", "Brian Li"], "title": "Finding low-complexity DNA sequences with longdust", "categories": ["q-bio.GN"], "comment": "4 pages, 1 figure", "summary": "Motivation: Low-complexity (LC) DNA sequences are compositionally repetitive\nsequences that are often associated with increased variant density and variant\ncalling artifacts. While algorithms for identifying LC sequences exist, they\neither lack rigorous mathematical foundation or are inefficient with long\ncontext windows.\n  Results: Longdust is a new algorithm that efficiently identifies long LC\nsequences including centromeric satellite and tandem repeats with moderately\nlong motifs. It defines string complexity by statistically modeling the k-mer\ncount distribution with the parameters: the k-mer length, the context window\nsize and a threshold on complexity. Longdust exhibits high performance on real\ndata and high consistency with existing methods.\n  Availability and implementation: https://github.com/lh3/longdust"}
{"id": "2509.07204", "pdf": "https://arxiv.org/pdf/2509.07204", "abs": "https://arxiv.org/abs/2509.07204", "authors": ["Adrien Couetoux", "Thomas Devenyns", "Lise Diagne", "David Champagne", "Pierre-Yves Mousset", "Chris Anagnostopoulos"], "title": "Predicting effect of novel treatments using molecular pathways and real-world data", "categories": ["cs.LG", "q-bio.QM", "I.2.6; I.2.4; J.3"], "comment": null, "summary": "In pharmaceutical R&D, predicting the efficacy of a pharmaceutical in\ntreating a particular disease prior to clinical testing or any real-world use\nhas been challenging. In this paper, we propose a flexible and modular machine\nlearning-based approach for predicting the efficacy of an untested\npharmaceutical for treating a disease. We train a machine learning model using\nsets of pharmaceutical-pathway weight impact scores and patient data, which can\ninclude patient characteristics and observed clinical outcomes. The resulting\nmodel then analyses weighted impact scores of an untested pharmaceutical across\nhuman biological molecule-protein pathways to generate a predicted efficacy\nvalue. We demonstrate how the method works on a real-world dataset with patient\ntreatments and outcomes, with two different weight impact score algorithms We\ninclude methods for evaluating the generalisation performance on unseen\ntreatments, and to characterise conditions under which the approach can be\nexpected to be most predictive. We discuss specific ways in which our approach\ncan be iterated on, making it an initial framework to support future work on\npredicting the effect of untested drugs, leveraging RWD clinical data and drug\nembeddings."}
{"id": "2509.07723", "pdf": "https://arxiv.org/pdf/2509.07723", "abs": "https://arxiv.org/abs/2509.07723", "authors": ["Bo Yu", "Zhixiu Hua", "Bo Zhao"], "title": "BDPM: A Machine Learning-Based Feature Extractor for Parkinson's Disease Classification via Gut Microbiota Analysis", "categories": ["cs.AI", "cs.LG", "q-bio.QM"], "comment": "11 pages, 7 figures", "summary": "Background: Parkinson's disease remains a major neurodegenerative disorder\nwith high misdiagnosis rates, primarily due to reliance on clinical rating\nscales. Recent studies have demonstrated a strong association between gut\nmicrobiota and Parkinson's disease, suggesting that microbial composition may\nserve as a promising biomarker. Although deep learning models based ongut\nmicrobiota show potential for early prediction, most approaches rely on single\nclassifiers and often overlook inter-strain correlations or temporal dynamics.\nTherefore, there is an urgent need for more robust feature extraction methods\ntailored to microbiome data. Methods: We proposed BDPM (A Machine\nLearning-Based Feature Extractor for Parkinson's Disease Classification via Gut\nMicrobiota Analysis). First, we collected gut microbiota profiles from 39\nParkinson's patients and their healthy spouses to identify differentially\nabundant taxa. Second, we developed an innovative feature selection framework\nnamed RFRE (Random Forest combined with Recursive Feature Elimination),\nintegrating ecological knowledge to enhance biological interpretability.\nFinally, we designed a hybrid classification model to capture temporal and\nspatial patterns in microbiome data."}
