{"id": "2510.03359", "pdf": "https://arxiv.org/pdf/2510.03359", "abs": "https://arxiv.org/abs/2510.03359", "authors": ["Yongjian He", "Vered Klein", "Orr Levy", "Xu-Wen Wang"], "title": "Predicting cell-specific gene expression profile and knockout impact through deep learning", "categories": ["q-bio.GN"], "comment": null, "summary": "Gene expression data is essential for understanding how genes are regulated\nand interact within biological systems, providing insights into disease\npathways and potential therapeutic targets. Gene knockout has proven to be a\nfundamental technique in molecular biology, allowing the investigation of the\nfunction of specific genes in an organism, as well as in specific cell types.\nHowever, gene expression patterns are quite heterogeneous in single-cell\ntranscriptional data from a uniform environment, representing different cell\nstates, which produce cell-type and cell-specific gene knockout impacts. A\ncomputational method that can predict the single-cell resolution knockout\nimpact is still lacking. Here, we present a data-driven framework for learning\nthe mapping between gene expression profiles derived from gene assemblages,\nenabling the accurate prediction of perturbed expression profiles following\nknockout (KO) for any cell, without relying on prior perturbed data. We\nsystematically validated our framework using synthetic data generated from gene\nregulatory dynamics models, two mouse knockout single-cell datasets, and\nhigh-throughput in vitro CRISPRi Perturb-seq data. Our results demonstrate that\nthe framework can accurately predict both expression profiles and KO effects at\nthe single-cell level. Our approach provides a generalizable tool for inferring\ngene function at single-cell resolution, offering new opportunities to study\ngenetic perturbations in contexts where large-scale experimental screens are\ninfeasible."}
{"id": "2510.03629", "pdf": "https://arxiv.org/pdf/2510.03629", "abs": "https://arxiv.org/abs/2510.03629", "authors": ["Furkan Eris", "Ulysse McConnell", "Can Firtina", "Onur Mutlu"], "title": "RawBench: A Comprehensive Benchmarking Framework for Raw Nanopore Signal Analysis Techniques", "categories": ["q-bio.GN", "q-bio.QM"], "comment": "Accepted in ACM BCB 2025", "summary": "Nanopore sequencing technologies continue to advance rapidly, offering\ncritical benefits such as real-time analysis, the ability to sequence extremely\nlong DNA fragments (up to millions of bases in a single read), and the option\nto selectively stop sequencing a molecule before completion. Traditionally, the\nraw electrical signals generated during sequencing are converted into DNA\nsequences through a process called basecalling, which typically relies on large\nneural network models. Raw signal analysis has emerged as a promising\nalternative to these resource-intensive approaches. While attempts have been\nmade to benchmark conventional basecalling methods, existing evaluation\nframeworks 1) overlook raw signal analysis techniques, 2) lack the flexibility\nto accommodate new raw signal analysis tools easily, and 3) fail to include the\nlatest improvements in nanopore datasets. Our goal is to provide an extensible\nbenchmarking framework that enables designing and comparing new methods for raw\nsignal analysis. To this end, we introduce RawBench, the first flexible\nframework for evaluating raw nanopore signal analysis techniques. RawBench\nprovides modular evaluation of three core pipeline components: 1) reference\ngenome encoding (using different pore models), 2) signal encoding (through\nvarious segmentation methods), and 3) representation matching (via different\ndata structures). We extensively evaluate raw signal analysis techniques in\nterms of 1) quality and performance for read mapping, 2) quality and\nperformance for read classification, and 3) quality of raw signal\nanalysis-assisted basecalling. Our evaluations show that raw signal analysis\ncan achieve competitive quality while significantly reducing resource\nrequirements, particularly in settings where real-time processing or edge\ndeployment is necessary."}
{"id": "2510.03370", "pdf": "https://arxiv.org/pdf/2510.03370", "abs": "https://arxiv.org/abs/2510.03370", "authors": ["Junde Xu", "Yapin Shi", "Lijun Lang", "Taoyong Cui", "Zhiming Zhang", "Guangyong Chen", "Jiezhong Qiu", "Pheng-Ann Heng"], "title": "InstructPLM-mu: 1-Hour Fine-Tuning of ESM2 Beats ESM3 in Protein Mutation Predictions", "categories": ["q-bio.QM", "cs.AI", "cs.CE"], "comment": "preprint", "summary": "Multimodal protein language models deliver strong performance on\nmutation-effect prediction, but training such models from scratch demands\nsubstantial computational resources. In this paper, we propose a fine-tuning\nframework called InstructPLM-mu and try to answer a question: \\textit{Can\nmultimodal fine-tuning of a pretrained, sequence-only protein language model\nmatch the performance of models trained end-to-end? } Surprisingly, our\nexperiments show that fine-tuning ESM2 with structural inputs can reach\nperformance comparable to ESM3. To understand how this is achieved, we\nsystematically compare three different feature-fusion designs and fine-tuning\nrecipes. Our results reveal that both the fusion method and the tuning strategy\nstrongly affect final accuracy, indicating that the fine-tuning process is not\ntrivial. We hope this work offers practical guidance for injecting structure\ninto pretrained protein language models and motivates further research on\nbetter fusion mechanisms and fine-tuning protocols."}
{"id": "2510.03958", "pdf": "https://arxiv.org/pdf/2510.03958", "abs": "https://arxiv.org/abs/2510.03958", "authors": ["Théo Michelot", "Emma Storey"], "title": "Scale dependence in hidden Markov models for animal movement", "categories": ["q-bio.QM", "stat.AP"], "comment": null, "summary": "Hidden Markov models (HMMs) have been used increasingly to understand how\nmovement patterns of animals arise from behavioural states. An animal is\nassumed to transition between behavioural states through time, as described by\ntransition probabilities. Within each state, the movement typically follows a\ndiscrete-time random walk, where steps between successive observed locations\nare described in terms of step lengths (related to speed) and turning angles\n(related to tortuosity). HMMs are discrete-time models, and most of their\noutputs strongly depend on the temporal resolution of data. We compile known\ntheoretical results about scale dependence in Markov chains and correlated\nrandom walks, which are the most common components of HMMs for animal movement.\nWe also illustrate this phenomenon using simulations covering a wide range of\nbiological scenarios. The scale dependence affects not only all model\nparameters, i.e., the transition probabilities and the movement parameters\nwithin each behavioural state, but also the overall classification of movement\npatterns into states. This highlights the importance of carefully considering\nthe time resolution when drawing conclusions from the results of analysis. In\naddition, scale dependence generally precludes the analysis of tracking data\ncollected at irregular time intervals, and the comparison (or combination) of\ndata sets with different sampling rates. HMMs remain a valuable tool to answer\nquestions about animal movement and behaviour, as long as these limitations are\nwell understood."}
{"id": "2510.04193", "pdf": "https://arxiv.org/pdf/2510.04193", "abs": "https://arxiv.org/abs/2510.04193", "authors": ["Simon F. Martina-Perez"], "title": "Inverse statistics of active matter trajectories to distinguish interaction kernel anisotropy from emergent correlations", "categories": ["q-bio.QM"], "comment": null, "summary": "High-resolution imaging provides dense trajectories of migrating cells,\nflocking animals, and synthetic active particles, from which interaction laws\ncan be determined with a wide variety of methods. Yet, distinguishing whether\nfront-back or lateral biases seen in such data reflect intrinsic anisotropy in\nthe interaction kernel or emergent correlations that are nevertheless produced\nby isotropic pairwise interaction forces remains an open challenge. We resolve\nthis ambiguity by deriving a linear partial differential equation that connects\nmeasurable two-point velocity correlations to an unknown, distance- and\nangle-dependent interaction kernel. Turing-like instabilities can occur which\nallows for dipolar or quadrupolar patterns to arise even when agents interact\naccording to an underlying attraction-repulsion law that is angle-independent.\nWe then show that incorporating a weak velocity-alignment force can interfere\nwith anisotropic pattern formation by suppressing dipolar patterns. We validate\nthese predictions with agent-based simulations and provide design guidance for\nexperiments that seek to discriminate intrinsic anisotropy from emergent\neffects."}
{"id": "2510.04377", "pdf": "https://arxiv.org/pdf/2510.04377", "abs": "https://arxiv.org/abs/2510.04377", "authors": ["Jiarui Li", "Zixiang Yin", "Zhengming Ding", "Samuel J. Landry", "Ramgopal R. Mettu"], "title": "TCR-EML: Explainable Model Layers for TCR-pMHC Prediction", "categories": ["q-bio.QM", "cs.CE", "cs.LG"], "comment": null, "summary": "T cell receptor (TCR) recognition of peptide-MHC (pMHC) complexes is a\ncentral component of adaptive immunity, with implications for vaccine design,\ncancer immunotherapy, and autoimmune disease. While recent advances in machine\nlearning have improved prediction of TCR-pMHC binding, the most effective\napproaches are black-box transformer models that cannot provide a rationale for\npredictions. Post-hoc explanation methods can provide insight with respect to\nthe input but do not explicitly model biochemical mechanisms (e.g. known\nbinding regions), as in TCR-pMHC binding. ``Explain-by-design'' models (i.e.,\nwith architectural components that can be examined directly after training)\nhave been explored in other domains, but have not been used for TCR-pMHC\nbinding. We propose explainable model layers (TCR-EML) that can be incorporated\ninto protein-language model backbones for TCR-pMHC modeling. Our approach uses\nprototype layers for amino acid residue contacts drawn from known TCR-pMHC\nbinding mechanisms, enabling high-quality explanations for predicted TCR-pMHC\nbinding. Experiments of our proposed method on large-scale datasets demonstrate\ncompetitive predictive accuracy and generalization, and evaluation on the\nTCR-XAI benchmark demonstrates improved explainability compared with existing\napproaches."}
{"id": "2510.04897", "pdf": "https://arxiv.org/pdf/2510.04897", "abs": "https://arxiv.org/abs/2510.04897", "authors": ["Ana Milinski", "Annick Dejaegere", "Roland Stote"], "title": "Impact of Force Field Polarization on Correlated Motions of Proteins", "categories": ["q-bio.QM", "q-bio.BM"], "comment": null, "summary": "Correlated motions of proteins underpin many physiological mechanisms, such\nas substrate binding, signal transduction, enzymatic activity and allostery.\nThese motions arise from low frequency collective movements of biomolecules and\nhave mostly been studied using molecular dynamics simulations. Here, we present\nthe effects of two different empirical energy force fields used for molecular\ndynamics simulations on correlated motions -- the non-polarizable CHARMM 36m\nadditive force field and the polarizable Drude-2019 force field. The study was\nconducted on two proteins, ubiquitin - a small protein with a well-described\ndynamic - and the nuclear receptor protein PPAR___. The ligand binding domain\nof PPAR___ was of particular interest since its function is to regulate\ntranscription through ligand and coregulator protein binding. It has been\npreviously shown that a dynamical network of correlated motions ensures the\ntransmission of information related to PPAR___ ligand binding. We present the\nresults of classical MD simulations where we analyze the results in terms of\nresidue fluctuations, residue correlation maps, community network analysis and\nhydrophobic cluster analysis. We find that RMS fluctuations tend to be greater\nand correlated motions are less intense with Drude-2019 force field than with\nthe non-polarizable all atom additive force field. Analysis of large\nhydrophobic clusters in the respective proteins show a greater loss of native\ncontacts in the simulations using the Drude-2019 force field than in the\nsimulations using the all atom force additive force field. Our results provide\nthe first quantification of the impact of using a polarizable force field in\ncomputational studies that focus on correlated motions."}
{"id": "2510.04969", "pdf": "https://arxiv.org/pdf/2510.04969", "abs": "https://arxiv.org/abs/2510.04969", "authors": ["Satrio Pambudi", "Filippo Menolascina"], "title": "Bridging Clinical Narratives and ACR Appropriateness Guidelines: A Multi-Agent RAG System for Medical Imaging Decisions", "categories": ["q-bio.QM"], "comment": null, "summary": "The selection of appropriate medical imaging procedures is a critical and\ncomplex clinical decision, guided by extensive evidence-based standards such as\nthe ACR Appropriateness Criteria (ACR-AC). However, the underutilization of\nthese guidelines, stemming from the difficulty of mapping unstructured patient\nnarratives to structured criteria, contributes to suboptimal patient outcomes\nand increased healthcare costs. To bridge this gap, we introduce a multi-agent\ncognitive architecture that automates the translation of free-text clinical\nscenarios into specific, guideline-adherent imaging recommendations. Our system\nleverages a novel, domain-adapted dense retrieval model, ColBERT, fine-tuned on\na synthetically generated dataset of 8,840 clinical scenario-recommendation\npairs to achieve highly accurate information retrieval from the ACR-AC\nknowledge base. This retriever identifies candidate guidelines with a 93.9%\ntop-10 recall, which are then processed by a sequence of LLM-based agents for\nselection and evidence-based synthesis. We evaluate our architecture using\nGPT-4.1 and MedGemma agents, demonstrating a state-of-the-art exact match\naccuracy of 81%, meaning that in 81% of test cases the predicted procedure set\nwas identical to the guideline's reference set, and an F1-score of 0.879. This\nrepresents a 67-percentage-point absolute improvement in accuracy over a strong\nstandalone GPT-4.1 baseline, underscoring the contribution that our\narchitecture makes to a frontier model. These results were obtained on a\nchallenging test set with substantial lexical divergence from the source\nguidelines. Our code is available at\nhttps://anonymous.4open.science/r/demo-iclr-B567/"}
{"id": "2510.05083", "pdf": "https://arxiv.org/pdf/2510.05083", "abs": "https://arxiv.org/abs/2510.05083", "authors": ["Loan Vulliard", "Teresa Glauner", "Sven Truxa", "Miray Cetin", "Yu-Le Wu", "Ronald Simon", "Laura Behm", "Jovan Tanevski", "Julio Saez-Rodriguez", "Guido Sauter", "Felix J. Hartmann"], "title": "Robust multicellular programs dissect the complex tumor microenvironment and track disease progression in colorectal adenocarcinomas", "categories": ["q-bio.QM", "q-bio.MN", "q-bio.TO"], "comment": null, "summary": "Colorectal cancer (CRC) is highly heterogeneous, with five-year survival\nrates dropping from $\\sim$90% in localized disease to $\\sim$15% with distant\nmetastases. Disease progression is shaped not only by tumor-intrinsic\nalterations but also by the reorganization of the tumor microenvironment (TME).\nMetabolic, compositional, and spatial changes contribute to this progression,\nbut considered individually they lack context and often fail as therapeutic\ntargets. Understanding their coordination could reveal processes to alter the\ndisease course. Here, we combined multiplexed ion beam imaging (MIBI) with\nmachine learning to profile metabolic, functional and spatial states of 522\ncolorectal lesions with single-cell resolution. We observed recurrent\nstage-specific remodeling marked by a lymphoid-to-myeloid shift, stromal-cancer\ncooperation, and malignant metabolic shifts. Spatial organization of\nepithelial, stromal, and immune compartments provided stronger stratification\nof disease stage than tumor-intrinsic changes or bulk immune infiltration\nalone. To systematically model these coordinated changes, we condensed\nmultimodal features into 10 latent factors of TME organization. These factors\ntracked disease progression, were conserved across cohorts, and revealed\nfrequent multicellular metabolic niches and distinct, non-exclusive TME\ntrajectories. Our framework MuVIcell exposes the elements that together drive\nCRC progression by grouping co-occurring changes across cell types and feature\nclasses into coordinated multicellular programs. This creates a rational basis\nto therapeutically target TME reorganization. Importantly, the framework is\nscalable and flexible, offering a resource for studying multicellular\norganization in other solid tumors."}
{"id": "2510.03629", "pdf": "https://arxiv.org/pdf/2510.03629", "abs": "https://arxiv.org/abs/2510.03629", "authors": ["Furkan Eris", "Ulysse McConnell", "Can Firtina", "Onur Mutlu"], "title": "RawBench: A Comprehensive Benchmarking Framework for Raw Nanopore Signal Analysis Techniques", "categories": ["q-bio.GN", "q-bio.QM"], "comment": "Accepted in ACM BCB 2025", "summary": "Nanopore sequencing technologies continue to advance rapidly, offering\ncritical benefits such as real-time analysis, the ability to sequence extremely\nlong DNA fragments (up to millions of bases in a single read), and the option\nto selectively stop sequencing a molecule before completion. Traditionally, the\nraw electrical signals generated during sequencing are converted into DNA\nsequences through a process called basecalling, which typically relies on large\nneural network models. Raw signal analysis has emerged as a promising\nalternative to these resource-intensive approaches. While attempts have been\nmade to benchmark conventional basecalling methods, existing evaluation\nframeworks 1) overlook raw signal analysis techniques, 2) lack the flexibility\nto accommodate new raw signal analysis tools easily, and 3) fail to include the\nlatest improvements in nanopore datasets. Our goal is to provide an extensible\nbenchmarking framework that enables designing and comparing new methods for raw\nsignal analysis. To this end, we introduce RawBench, the first flexible\nframework for evaluating raw nanopore signal analysis techniques. RawBench\nprovides modular evaluation of three core pipeline components: 1) reference\ngenome encoding (using different pore models), 2) signal encoding (through\nvarious segmentation methods), and 3) representation matching (via different\ndata structures). We extensively evaluate raw signal analysis techniques in\nterms of 1) quality and performance for read mapping, 2) quality and\nperformance for read classification, and 3) quality of raw signal\nanalysis-assisted basecalling. Our evaluations show that raw signal analysis\ncan achieve competitive quality while significantly reducing resource\nrequirements, particularly in settings where real-time processing or edge\ndeployment is necessary."}
{"id": "2510.03811", "pdf": "https://arxiv.org/pdf/2510.03811", "abs": "https://arxiv.org/abs/2510.03811", "authors": ["Aya Laajil", "Abduragim Shtanchaev", "Sajan Muhammad", "Eric Moulines", "Salem Lahlou"], "title": "Curriculum-Augmented GFlowNets For mRNA Sequence Generation", "categories": ["cs.LG", "q-bio.QM"], "comment": null, "summary": "Designing mRNA sequences is a major challenge in developing next-generation\ntherapeutics, since it involves exploring a vast space of possible nucleotide\ncombinations while optimizing sequence properties like stability, translation\nefficiency, and protein expression. While Generative Flow Networks are\npromising for this task, their training is hindered by sparse, long-horizon\nrewards and multi-objective trade-offs. We propose Curriculum-Augmented\nGFlowNets (CAGFN), which integrate curriculum learning with multi-objective\nGFlowNets to generate de novo mRNA sequences. CAGFN integrates a length-based\ncurriculum that progressively adapts the maximum sequence length guiding\nexploration from easier to harder subproblems. We also provide a new mRNA\ndesign environment for GFlowNets which, given a target protein sequence and a\ncombination of biological objectives, allows for the training of models that\ngenerate plausible mRNA candidates. This provides a biologically motivated\nsetting for applying and advancing GFlowNets in therapeutic sequence design. On\ndifferent mRNA design tasks, CAGFN improves Pareto performance and biological\nplausibility, while maintaining diversity. Moreover, CAGFN reaches\nhigher-quality solutions faster than a GFlowNet trained with random sequence\nsampling (no curriculum), and enables generalization to out-of-distribution\nsequences."}
{"id": "2510.04101", "pdf": "https://arxiv.org/pdf/2510.04101", "abs": "https://arxiv.org/abs/2510.04101", "authors": ["Ben Ansbacher", "Malachy Guzman", "Jordi Garcia-Ojalvo", "Arjendu K Pattanayak"], "title": "Mapping gene expression dynamics to developmental phenotypes with information entropy analysis", "categories": ["physics.bio-ph", "q-bio.QM"], "comment": "19 pages, 11 figures", "summary": "The development of multicellular organisms entails a deep connection between\ntime-dependent biochemical processes taking place at the subcellular level, and\nthe resulting macroscopic phenotypes that arise in populations of up to\ntrillions of cells. A statistical mechanics of developmental processes would\nhelp to understand how microscopic genotypes map onto macroscopic phenotypes, a\ngeneral goal across biology. Here we follow this approach, hypothesizing that\ndevelopment should be understood as a thermodynamic transition between\nnon-equilibrium states. We test this hypothesis in the context of the fruit\nfly, Drosophila melanogaster, a model organism used widely in genetics and\ndevelopmental biology for over a century. Applying a variety of\ninformation-theoretic measures to public transcriptomics datasets of whole fly\nembryos during development, we show that the global temporal dynamics of gene\nexpression can be understood as a process that probabilistically guides\nembryonic dynamics across macroscopic phenotypic stages. In particular, we\ndemonstrate signatures of irreversibility in the information complexity of\ntranscriptomic dynamics, as measured mainly by the permutation entropy of\nindexed ensembles (PI entropy). Our results show that the dynamics of PI\nentropy correlate strongly with developmental stages. Overall, this is a test\ncase in applying information complexity analysis to relate the statistical\nmechanics of biomarkers to macroscopic developmental dynamics."}
{"id": "2510.04757", "pdf": "https://arxiv.org/pdf/2510.04757", "abs": "https://arxiv.org/abs/2510.04757", "authors": ["Eduardo Martínez Rivera", "Filippo Menolascina"], "title": "ModernBERT + ColBERT: Enhancing biomedical RAG through an advanced re-ranking retriever", "categories": ["cs.CL", "q-bio.QM"], "comment": null, "summary": "Retrieval-Augmented Generation (RAG) is a powerful technique for enriching\nLarge Language Models (LLMs) with external knowledge, allowing for factually\ngrounded responses, a critical requirement in high-stakes domains such as\nhealthcare. However, the efficacy of RAG systems is fundamentally restricted by\nthe performance of their retrieval module, since irrelevant or semantically\nmisaligned documents directly compromise the accuracy of the final generated\nresponse. General-purpose dense retrievers can struggle with the nuanced\nlanguage of specialised domains, while the high accuracy of in-domain models is\noften achieved at prohibitive computational costs. In this work, we aim to\naddress this trade-off by developing and evaluating a two-stage retrieval\narchitecture that combines a lightweight ModernBERT bidirectional encoder for\nefficient initial candidate retrieval with a ColBERTv2 late-interaction model\nfor fine-grained re-ranking. We conduct comprehensive evaluations of our\nretriever module performance and RAG system performance in the biomedical\ncontext, fine-tuning the IR module using 10k question-passage pairs from\nPubMedQA. Our analysis of the retriever module confirmed the positive impact of\nthe ColBERT re-ranker, which improved Recall@3 by up to 4.2 percentage points\ncompared to its retrieve-only counterpart. When integrated into the biomedical\nRAG, our IR module leads to a state-of-the-art average accuracy of 0.4448 on\nthe five tasks of the MIRAGE question-answering benchmark, outperforming strong\nbaselines such as MedCPT (0.4436). Our ablation studies reveal that this\nperformance is critically dependent on a joint fine-tuning process that aligns\nthe retriever and re-ranker; otherwise, the re-ranker might degrade the\nperformance."}
{"id": "2510.04859", "pdf": "https://arxiv.org/pdf/2510.04859", "abs": "https://arxiv.org/abs/2510.04859", "authors": ["Elena Corbetta", "Thomas Bocklitz"], "title": "μDeepIQA: deep learning-based fast and robust image quality assessment with local predictions for optical microscopy", "categories": ["cs.CV", "physics.data-an", "q-bio.QM"], "comment": "16 pages, 6 figures. \\mu DeepIQA is publicly available at\n  https://git.photonicdata.science/elena.corbetta/udeepiqa", "summary": "Optical microscopy is one of the most widely used techniques in research\nstudies for life sciences and biomedicine. These applications require reliable\nexperimental pipelines to extract valuable knowledge from the measured samples\nand must be supported by image quality assessment (IQA) to ensure correct\nprocessing and analysis of the image data. IQA methods are implemented with\nvariable complexity. However, while most quality metrics have a straightforward\nimplementation, they might be time consuming and computationally expensive when\nevaluating a large dataset. In addition, quality metrics are often designed for\nwell-defined image features and may be unstable for images out of the ideal\ndomain.\n  To overcome these limitations, recent works have proposed deep learning-based\nIQA methods, which can provide superior performance, increased generalizability\nand fast prediction. Our method, named $\\mathrm{\\mu}$DeepIQA, is inspired by\nprevious studies and applies a deep convolutional neural network designed for\nIQA on natural images to optical microscopy measurements. We retrained the same\narchitecture to predict individual quality metrics and global quality scores\nfor optical microscopy data. The resulting models provide fast and stable\npredictions of image quality by generalizing quality estimation even outside\nthe ideal range of standard methods. In addition, $\\mathrm{\\mu}$DeepIQA\nprovides patch-wise prediction of image quality and can be used to visualize\nspatially varying quality in a single image. Our study demonstrates that\noptical microscopy-based studies can benefit from the generalizability of deep\nlearning models due to their stable performance in the presence of outliers,\nthe ability to assess small image patches, and rapid predictions."}
{"id": "2510.04878", "pdf": "https://arxiv.org/pdf/2510.04878", "abs": "https://arxiv.org/abs/2510.04878", "authors": ["Xiangyang Xu", "Hongyang Gao"], "title": "Flow-Matching Based Refiner for Molecular Conformer Generation", "categories": ["cs.LG", "q-bio.QM"], "comment": null, "summary": "Low-energy molecular conformers generation (MCG) is a foundational yet\nchallenging problem in drug discovery. Denoising-based methods include\ndiffusion and flow-matching methods that learn mappings from a simple base\ndistribution to the molecular conformer distribution. However, these approaches\noften suffer from error accumulation during sampling, especially in the low SNR\nsteps, which are hard to train. To address these challenges, we propose a\nflow-matching refiner for the MCG task. The proposed method initializes\nsampling from mixed-quality outputs produced by upstream denoising models and\nreschedules the noise scale to bypass the low-SNR phase, thereby improving\nsample quality. On the GEOM-QM9 and GEOM-Drugs benchmark datasets, the\ngenerator-refiner pipeline improves quality with fewer total denoising steps\nwhile preserving diversity."}
