{"id": "2510.12384", "pdf": "https://arxiv.org/pdf/2510.12384", "abs": "https://arxiv.org/abs/2510.12384", "authors": ["Huifa Li", "Feilong Tang", "Haochen Xue", "Yulong Li", "Xinlin Zhuang", "Bin Zhang", "Eran Segal", "Imran Razzak"], "title": "Phenome-Wide Multi-Omics Integration Uncovers Distinct Archetypes of Human Aging", "categories": ["q-bio.GN", "cs.AI"], "comment": null, "summary": "Aging is a highly complex and heterogeneous process that progresses at\ndifferent rates across individuals, making biological age (BA) a more accurate\nindicator of physiological decline than chronological age. While previous\nstudies have built aging clocks using single-omics data, they often fail to\ncapture the full molecular complexity of human aging. In this work, we\nleveraged the Human Phenotype Project, a large-scale cohort of 12,000 adults\naged 30--70 years, with extensive longitudinal profiling that includes\nclinical, behavioral, environmental, and multi-omics datasets -- spanning\ntranscriptomics, lipidomics, metabolomics, and the microbiome. By employing\nadvanced machine learning frameworks capable of modeling nonlinear biological\ndynamics, we developed and rigorously validated a multi-omics aging clock that\nrobustly predicts diverse health outcomes and future disease risk. Unsupervised\nclustering of the integrated molecular profiles from multi-omics uncovered\ndistinct biological subtypes of aging, revealing striking heterogeneity in\naging trajectories and pinpointing pathway-specific alterations associated with\ndifferent aging patterns. These findings demonstrate the power of multi-omics\nintegration to decode the molecular landscape of aging and lay the groundwork\nfor personalized healthspan monitoring and precision strategies to prevent\nage-related diseases."}
{"id": "2510.12617", "pdf": "https://arxiv.org/pdf/2510.12617", "abs": "https://arxiv.org/abs/2510.12617", "authors": ["Davide Greco", "Konrad Rawlik"], "title": "Same model, better performance: the impact of shuffling on DNA Language Models benchmarking", "categories": ["q-bio.GN", "cs.LG"], "comment": null, "summary": "Large Language Models are increasingly popular in genomics due to their\npotential to decode complex biological sequences. Hence, researchers require a\nstandardized benchmark to evaluate DNA Language Models (DNA LMs) capabilities.\nHowever, evaluating DNA LMs is a complex task that intersects genomic's\ndomain-specific challenges and machine learning methodologies, where seemingly\nminor implementation details can significantly compromise benchmark validity.\nWe demonstrate this through BEND (Benchmarking DNA Language Models), where\nhardware-dependent hyperparameters -- number of data loading workers and buffer\nsizes -- create spurious performance variations of up to 4% for identical\nmodels. The problem stems from inadequate data shuffling interacting with\ndomain specific data characteristics. Experiments with three DNA language\nmodels (HyenaDNA, DNABERT-2, ResNet-LM) show these artifacts affect both\nabsolute performance and relative model rankings. We propose a simple solution:\npre-shuffling data before storage eliminates hardware dependencies while\nmaintaining efficiency. This work highlights how standard ML practices can\ninteract unexpectedly with domain-specific data characteristics, with broader\nimplications for benchmark design in specialized domains."}
{"id": "2510.11726", "pdf": "https://arxiv.org/pdf/2510.11726", "abs": "https://arxiv.org/abs/2510.11726", "authors": ["Zhaokang Liang", "Shuyang Zhuang", "Xiaoran Jiao", "Weian Mao", "Hao Chen", "Chunhua Shen"], "title": "scPPDM: A Diffusion Model for Single-Cell Drug-Response Prediction", "categories": ["q-bio.QM", "cs.LG"], "comment": null, "summary": "This paper introduces the Single-Cell Perturbation Prediction Diffusion Model\n(scPPDM), the first diffusion-based framework for single-cell drug-response\nprediction from scRNA-seq data. scPPDM couples two condition channels,\npre-perturbation state and drug with dose, in a unified latent space via\nnon-concatenative GD-Attn. During inference, factorized classifier-free\nguidance exposes two interpretable controls for state preservation and\ndrug-response strength and maps dose to guidance magnitude for tunable\nintensity. Evaluated on the Tahoe-100M benchmark under two stringent regimes,\nunseen covariate combinations (UC) and unseen drugs (UD), scPPDM sets new\nstate-of-the-art results across log fold-change recovery, delta correlations,\nexplained variance, and DE-overlap. Representative gains include\n+36.11%/+34.21% on DEG logFC-Spearman/Pearson in UD over the second-best model.\nThis control interface enables transparent what-if analyses and dose tuning,\nreducing experimental burden while preserving biological specificity."}
{"id": "2510.11743", "pdf": "https://arxiv.org/pdf/2510.11743", "abs": "https://arxiv.org/abs/2510.11743", "authors": ["Timo Jakumeit", "Bastian Heinlein", "Leonie Richter", "Sebastian Lotter", "Robert Schober", "Maximilian Schäfer"], "title": "Mixture of Inverse Gaussians for Hemodynamic Transport (MIGHT) in Vascular Networks", "categories": ["q-bio.QM", "cs.ET"], "comment": "8 pages, 5 figures. Submitted to IEEE International Conference on\n  Communications (ICC) 2026. This version includes extended proofs compared to\n  the conference submission", "summary": "Synthetic molecular communication (MC) in the cardiovascular system (CVS) is\na key enabler for many envisioned medical applications in the human body, such\nas targeted drug delivery, early cancer detection, and continuous health\nmonitoring. The design of MC systems for such applications requires suitable\nmodels for the signaling molecule propagation through complex vessel networks\n(VNs). Existing theoretical models offer limited analytical tractability and\nlack closed-form solutions, making the analysis of large-scale VNs either\ninfeasible or not insightful. To overcome these limitations, in this paper, we\npropose a novel closed-form physical model, termed MIGHT, for\nadvection-diffusion-driven transport of signaling molecules through complex\nVNs. The model represents the received molecule flux as a weighted sum of\ninverse Gaussian (IG) distributions, parameterized by physical properties of\nthe network. The proposed model is validated by comparison with an existing\nconvolution-based model and finite-element simulations. Further, we show that\nthe model can be applied for the reduction of large VNs to simplified\nrepresentations preserving the essential transport dynamics and for estimating\nrepresentative VN based on received signals from unknown VNs."}
{"id": "2510.11750", "pdf": "https://arxiv.org/pdf/2510.11750", "abs": "https://arxiv.org/abs/2510.11750", "authors": ["Sazan Mahbub", "Souvik Kundu", "Eric P. Xing"], "title": "PRISM: Enhancing Protein Inverse Folding through Fine-Grained Retrieval on Structure-Sequence Multimodal Representations", "categories": ["q-bio.QM", "cs.LG"], "comment": null, "summary": "Designing protein sequences that fold into a target three-dimensional\nstructure, known as the inverse folding problem, is central to protein\nengineering but remains challenging due to the vast sequence space and the\nimportance of local structural constraints. Existing deep learning approaches\nachieve strong recovery rates, yet they lack explicit mechanisms to reuse\nfine-grained structure-sequence patterns that are conserved across natural\nproteins. We present PRISM, a multimodal retrieval-augmented generation\nframework for inverse folding that retrieves fine-grained representations of\npotential motifs from known proteins and integrates them with a hybrid\nself-cross attention decoder. PRISM is formulated as a latent-variable\nprobabilistic model and implemented with an efficient approximation, combining\ntheoretical grounding with practical scalability. Across five benchmarks\n(CATH-4.2, TS50, TS500, CAMEO 2022, and the PDB date split), PRISM establishes\nnew state of the art in both perplexity and amino acid recovery, while also\nimproving foldability metrics (RMSD, TM-score, pLDDT), demonstrating that\nfine-grained multimodal retrieval is a powerful and efficient paradigm for\nprotein sequence design."}
{"id": "2510.11752", "pdf": "https://arxiv.org/pdf/2510.11752", "abs": "https://arxiv.org/abs/2510.11752", "authors": ["Zhiyu Wang", "Bingxin Zhou", "Jing Wang", "Yang Tan", "Weishu Zhao", "Pietro Liò", "Liang Hong"], "title": "Fast and Interpretable Protein Substructure Alignment via Optimal Transport", "categories": ["q-bio.QM", "cs.AI", "cs.LG"], "comment": null, "summary": "Proteins are essential biological macromolecules that execute life functions.\nLocal motifs within protein structures, such as active sites, are the most\ncritical components for linking structure to function and are key to\nunderstanding protein evolution and enabling protein engineering. Existing\ncomputational methods struggle to identify and compare these local structures,\nwhich leaves a significant gap in understanding protein structures and\nharnessing their functions. This study presents PLASMA, the first deep learning\nframework for efficient and interpretable residue-level protein substructure\nalignment. We reformulate the problem as a regularized optimal transport task\nand leverage differentiable Sinkhorn iterations. For a pair of input protein\nstructures, PLASMA outputs a clear alignment matrix with an interpretable\noverall similarity score. Through extensive quantitative evaluations and three\nbiological case studies, we demonstrate that PLASMA achieves accurate,\nlightweight, and interpretable residue-level alignment. Additionally, we\nintroduce PLASMA-PF, a training-free variant that provides a practical\nalternative when training data are unavailable. Our method addresses a critical\ngap in protein structure analysis tools and offers new opportunities for\nfunctional annotation, evolutionary studies, and structure-based drug design.\nReproducibility is ensured via our official implementation at\nhttps://github.com/ZW471/PLASMA-Protein-Local-Alignment.git."}
{"id": "2510.11756", "pdf": "https://arxiv.org/pdf/2510.11756", "abs": "https://arxiv.org/abs/2510.11756", "authors": ["Shudong Sun", "Aki Hara", "Laurel Johnstone", "Brian Hallmark", "Joseph C. Watkins", "Cynthia A. Thomson", "Susan M. Schembre", "Susan Sergeant", "Jason Umans", "Guang Yao", "Hao Helen Zhang", "Floyd H. Chilton"], "title": "Optimal Pair Matching Combined with Machine Learning Predicts a Significant Reduction in Myocardial Infarction Risk in African Americans following Omega-3 Fatty Acid Supplementation", "categories": ["q-bio.QM", "stat.AP"], "comment": null, "summary": "Conflicting clinical trial results on omega-3 highly unsaturated fatty acids\n(n-3 HUFA) have prompted uncertainty about their cardioprotective effects.\nWhile the VITAL trial found no overall cardiovascular benefit from n-3 HUFA\nsupplementation, its substantial African American (AfAm) enrollment provided a\nunique opportunity to explore racial differences in response to n-3 HUFA\nsupplementation. The current observational study aimed to simulate randomized\nclinical trial (RCT) conditions by matching 3,766 AfAm and 15,553 non-Hispanic\nWhite (NHW) individuals from the VITAL trial utilizing propensity score\nmatching to address the limitations related to differences in confounding\nvariables between the two groups. Within matched groups (3,766 AfAm and 3,766\nNHW), n-3 HUFA supplementation's impact on myocardial infarction (MI), stroke,\nand cardiovascular disease (CVD) mortality was assessed. A weighted decision\ntree analysis revealed belonging to the n-3 supplementation group as the most\nsignificant predictor of MI among AfAm but not NHW. Further logistic regression\nusing the LASSO method and bootstrap estimation of standard errors indicated\nn-3 supplementation significantly lowered MI risk in AfAm (OR 0.17, 95% CI\n[0.048, 0.60]), with no such effect in NHW. This study underscores the critical\nneed for future RCT to explore racial disparities in MI risk associated with\nn-3 HUFA supplementation and highlights potential causal differences between\nsupplementation health outcomes in AfAm versus NHW populations."}
{"id": "2510.11959", "pdf": "https://arxiv.org/pdf/2510.11959", "abs": "https://arxiv.org/abs/2510.11959", "authors": ["Allison Powell", "Paramahansa Pramanik"], "title": "Genomic Influence of a Key Transcription Factor in Male Glandular Malignancy", "categories": ["q-bio.QM"], "comment": "36 pages, 13 figures, 1 table", "summary": "Prostate cancer (PCa) remains a significant global health concern among men,\nparticularly due to the lethality of its more aggressive variants. Despite\ntherapeutic advancements that have enhanced survival for many patients, high\ngrade PCa continues to contribute substantially to cancer related mortality.\nEmerging evidence points to the MYB proto-oncogene as a critical factor in\npromoting tumor progression, therapeutic resistance, and disease relapse.\nNotably, differential expression patterns have been observed, with markedly\nelevated MYB levels in tumor tissues from Black men relative to their White\ncounterparts potentially offering insight into documented racial disparities in\nclinical outcomes. This study investigates the association between MYB\nexpression and key oncogenic features, including androgen receptor (AR)\nsignaling, disease progression, and the risk of biochemical recurrence.\nEmploying a multimodal approach that integrates histopathological examination,\nquantitative digital imaging, and analyses of public transcriptomic datasets,\nour findings suggest that MYB overexpression is strongly linked to adverse\nprognosis. These results underscore MYB's potential as a prognostic biomarker\nand as a candidate for the development of individualized therapeutic\nstrategies."}
{"id": "2510.12772", "pdf": "https://arxiv.org/pdf/2510.12772", "abs": "https://arxiv.org/abs/2510.12772", "authors": ["Sergio Serrano de Haro Iváñez", "Joshua W. Moore", "Lucile Grzesiak", "Eoghan J. Mullholand", "Heather Harrington", "Simon J. Leedham", "Helen M. Byrne"], "title": "TopROI: A topology-informed network approach for tissue partitioning", "categories": ["q-bio.QM", "math.AT"], "comment": "28 pages, 11 Figures", "summary": "Mammalian tissue architecture is central to biological function, and its\ndisruption is a hallmark of disease. Medical imaging techniques can generate\nlarge point cloud datasets that capture changes in the cellular composition of\nsuch tissues with disease progression. However, regions of interest (ROIs) are\nusually defined by quadrat-based methods that ignore intrinsic structure and\nrisk fragmenting meaningful features. Here, we introduce TopROI, a\ntopology-informed, network-based method for partitioning point clouds into ROIs\nthat preserves both local geometry and higher-order architecture. TopROI\nintegrates geometry-informed networks with persistent homology, combining cell\nneighbourhoods and multiscale cycles to guide community detection. Applied to\nsynthetic point clouds that mimic glandular structure, TopROI outperforms\nquadrat-based and purely geometric partitions by maintaining biologically\nplausible ROI geometry and better preserving ground-truth structures. Applied\nto cellular point clouds obtained from human colorectal cancer biopsies, TopROI\ngenerates ROIs that preserve crypt-like structures and enable persistent\nhomology analysis of individual regions. This study reveals a continuum of\narchitectural changes from healthy mucosa to carcinoma, reflecting progressive\ndisorganisation in tissue structure. TopROI thus provides a principled and\nflexible framework for defining biologically meaningful ROIs in large point\nclouds, enabling more accurate quantification of tissue organization and new\ninsights into structural changes associated with disease progression."}
{"id": "2510.12776", "pdf": "https://arxiv.org/pdf/2510.12776", "abs": "https://arxiv.org/abs/2510.12776", "authors": ["Selim Romero", "Vignesh Kumar", "Robert S. Chapkin", "James J. Cai"], "title": "A Quantum Generative Framework for Modeling Single-Cell Transcriptomes with Gene-Gene and Cell-Cell Interactions", "categories": ["q-bio.QM", "cs.ET", "physics.bio-ph", "q-bio.GN"], "comment": null, "summary": "Single-cell RNA sequencing (scRNA-seq) data simulation is limited by\nclassical methods that rely on linear correlations, failing to capture the\nintrinsic, nonlinear dependencies and the simultaneous gene-gene and cell-cell\ninteractions. We introduce qSimCells, a novel hybrid quantum-classical\nsimulator that leverages quantum entanglement to model single-cell\ntranscriptomes. The core innovation is a quantum kernel that uses a\nparameterized quantum circuit with CNOT gates to encode complex, nonlinear gene\nregulatory network (GRN) and cell-cell communication topologies with explicit\ndirectionality (causality). The synthetic data exhibits non-classical\ndependencies that challenge standard analysis. We demonstrated that classical\ncorrelation methods (Pearson and Spearman) failed to reconstruct the complete\nprogrammed quantum causal paths, instead reporting spurious statistical\nartifacts driven by high base-gene expression probabilities. Applying\nCellChat2.0 to the simulated cell-cell communication validated the true\nmechanistic links by showing a robust, relative increase in communication\nprobability (up to 75-fold) only when the quantum entanglement was active. This\nwork confirms that the quantum kernel is essential for creating high-fidelity\nground truth data, highlighting the need for advanced inference techniques to\ncapture the complex, non-classical dependencies inherent in gene regulation."}
{"id": "2510.12577", "pdf": "https://arxiv.org/pdf/2510.12577", "abs": "https://arxiv.org/abs/2510.12577", "authors": ["Hasi Hays", "William Richardson"], "title": "ECMSim: A high-performance web simulation of cardiac ECM remodeling through integrated ODE-based signaling and diffusion", "categories": ["q-bio.MN", "cs.ET", "physics.bio-ph", "q-bio.QM"], "comment": null, "summary": "Extracellular matrix (ECM) remodeling is central to a wide variety of healthy\nand diseased tissue processes. Unfortunately, predicting ECM remodeling under\nvarious chemical and mechanical conditions has proven to be excessively\nchallenging, due in part to its complex regulation by intracellular and\nextracellular molecular reaction networks that are spatially and temporally\ndynamic. We introduce ECMSim, which is a highly interactive, real-time, and web\napplication designed to simulate heterogeneous matrix remodeling. The current\nmodel simulates cardiac scar tissue with configurable input conditions using a\nlarge-scale model of the cardiac fibroblast signaling network. Cardiac fibrosis\nis a major component of many forms of heart failure. ECMSim simulates over 1.3\nmillion equations simultaneously in real time that include more than 125\nspecies and more than 200 edges in each cell in a 100*100 spatial array (10,000\ncells), which accounts for inputs, receptors, intracellular signaling cascades,\nECM production, and feedback loops, as well as molecular diffusion. The\nalgorithm is represented by a set of ordinary differential equations (ODEs)\nthat are coupled with ECM molecular diffusion. The equations are solved on\ndemand using compiled C++ and the WebAssembly standard. The platform includes\nbrush-style cell selection to target a subset of cells with adjustable input\nmolecule concentrations, parameter sliders to adjust parameters on demand, and\nmultiple coupled real-time visualizations of network dynamics at multiple\nscales. Implementing ECMSim in standard web technologies enables a fully\nfunctional application that combines real-time simulation, visual interaction,\nand model editing. The software enables the investigation of pathological or\nexperimental conditions, hypothetical scenarios, matrix remodeling, or the\ntesting of the effects of an experimental drug(s) with a target receptor."}
{"id": "2510.12719", "pdf": "https://arxiv.org/pdf/2510.12719", "abs": "https://arxiv.org/abs/2510.12719", "authors": ["Matthew Adrian", "Yunsie Chung", "Kevin Boyd", "Saee Paliwal", "Srimukh Prasad Veccham", "Alan C. Cheng"], "title": "Multitask finetuning and acceleration of chemical pretrained models for small molecule drug property prediction", "categories": ["cs.LG", "q-bio.QM"], "comment": null, "summary": "Chemical pretrained models, sometimes referred to as foundation models, are\nreceiving considerable interest for drug discovery applications. The general\nchemical knowledge extracted from self-supervised training has the potential to\nimprove predictions for critical drug discovery endpoints, including on-target\npotency and ADMET properties. Multi-task learning has previously been\nsuccessfully leveraged to improve predictive models. Here, we show that\nenabling multitasking in finetuning of chemical pretrained graph neural network\nmodels such as Kinetic GROVER Multi-Task (KERMT), an enhanced version of the\nGROVER model, and Knowledge-guided Pre-training of Graph Transformer (KGPT)\nsignificantly improves performance over non-pretrained graph neural network\nmodels. Surprisingly, we find that the performance improvement from finetuning\nKERMT in a multitask manner is most significant at larger data sizes.\nAdditionally, we publish two multitask ADMET data splits to enable more\naccurate benchmarking of multitask deep learning methods for drug property\nprediction. Finally, we provide an accelerated implementation of the KERMT\nmodel on GitHub, unlocking large-scale pretraining, finetuning, and inference\nin industrial drug discovery workflows."}
{"id": "2510.12763", "pdf": "https://arxiv.org/pdf/2510.12763", "abs": "https://arxiv.org/abs/2510.12763", "authors": ["Saurabh Sihag", "Gonzalo Mateos", "Alejandro Ribeiro"], "title": "Disentangling Neurodegeneration with Brain Age Gap Prediction Models: A Graph Signal Processing Perspective", "categories": ["eess.SP", "cs.AI", "q-bio.QM"], "comment": "Accepted for publication in IEEE Signal Processing Magazine", "summary": "Neurodegeneration, characterized by the progressive loss of neuronal\nstructure or function, is commonly assessed in clinical practice through\nreductions in cortical thickness or brain volume, as visualized by structural\nMRI. While informative, these conventional approaches lack the statistical\nsophistication required to fully capture the spatially correlated and\nheterogeneous nature of neurodegeneration, which manifests both in healthy\naging and in neurological disorders. To address these limitations, brain age\ngap has emerged as a promising data-driven biomarker of brain health. The brain\nage gap prediction (BAGP) models estimate the difference between a person's\npredicted brain age from neuroimaging data and their chronological age. The\nresulting brain age gap serves as a compact biomarker of brain health, with\nrecent studies demonstrating its predictive utility for disease progression and\nseverity. However, practical adoption of BAGP models is hindered by their\nmethodological obscurities and limited generalizability across diverse clinical\npopulations. This tutorial article provides an overview of BAGP and introduces\na principled framework for this application based on recent advancements in\ngraph signal processing (GSP). In particular, we focus on graph neural networks\n(GNNs) and introduce the coVariance neural network (VNN), which leverages the\nanatomical covariance matrices derived from structural MRI. VNNs offer strong\ntheoretical grounding and operational interpretability, enabling robust\nestimation of brain age gap predictions. By integrating perspectives from GSP,\nmachine learning, and network neuroscience, this work clarifies the path\nforward for reliable and interpretable BAGP models and outlines future research\ndirections in personalized medicine."}
