{"id": "2509.18207", "pdf": "https://arxiv.org/pdf/2509.18207", "abs": "https://arxiv.org/abs/2509.18207", "authors": ["Zaixi Zhang", "Ruofan Jin", "Le Cong", "Mengdi Wang"], "title": "Securing the Language of Life: Inheritable Watermarks from DNA Language Models to Proteins", "categories": ["q-bio.GN"], "comment": "Accepted by NeurIPS 2025", "summary": "DNA language models have revolutionized our ability to understand and design\nDNA sequences--the fundamental language of life--with unprecedented precision,\nenabling transformative applications in therapeutics, synthetic biology, and\ngene editing. However, this capability also poses substantial dual-use risks,\nincluding the potential for creating pathogens, viruses, and even bioweapons.\nTo address these biosecurity challenges, we introduce two innovative\nwatermarking techniques to reliably track the designed DNA: DNAMark and\nCentralMark. DNAMark employs synonymous codon substitutions to embed watermarks\nin DNA sequences while preserving the original function. CentralMark further\nadvances this by creating inheritable watermarks that transfer from DNA to\ntranslated proteins, leveraging protein embeddings to ensure detection across\nthe central dogma. Both methods utilize semantic embeddings to generate\nwatermark logits, enhancing robustness against natural mutations, synthesis\nerrors, and adversarial attacks. Evaluated on our therapeutic DNA benchmark,\nDNAMark and CentralMark achieve F1 detection scores above 0.85 under various\nconditions, while maintaining over 60% sequence similarity to ground truth and\ndegeneracy scores below 15%. A case study on the CRISPR-Cas9 system underscores\nCentralMark's utility in real-world settings. This work establishes a vital\nframework for securing DNA language models, balancing innovation with\naccountability to mitigate biosecurity risks."}
{"id": "2509.18529", "pdf": "https://arxiv.org/pdf/2509.18529", "abs": "https://arxiv.org/abs/2509.18529", "authors": ["Mingqian Ma"], "title": "Reverse-Complement Consistency for DNA Language Models", "categories": ["cs.LG", "q-bio.GN"], "comment": null, "summary": "A fundamental property of DNA is that the reverse complement (RC) of a\nsequence often carries identical biological meaning. However, state-of-the-art\nDNA language models frequently fail to capture this symmetry, producing\ninconsistent predictions for a sequence and its RC counterpart, which\nundermines their reliability. In this work, we introduce Reverse-Complement\nConsistency Regularization (RCCR), a simple and model-agnostic fine-tuning\nobjective that directly penalizes the divergence between a model's prediction\non a sequence and the aligned prediction on its reverse complement. We evaluate\nRCCR across three diverse backbones (Nucleotide Transformer, HyenaDNA,\nDNABERT-2) on a wide range of genomic tasks, including sequence classification,\nscalar regression, and profile prediction. Our experiments show that RCCR\nsubstantially improves RC robustness by dramatically reducing prediction flips\nand errors, all while maintaining or improving task accuracy compared to\nbaselines such as RC data augmentation and test-time averaging. By integrating\na key biological prior directly into the learning process, RCCR produces a\nsingle, intrinsically robust, and computationally efficient model fine-tuning\nrecipe for diverse biology tasks."}
{"id": "2509.18220", "pdf": "https://arxiv.org/pdf/2509.18220", "abs": "https://arxiv.org/abs/2509.18220", "authors": ["Saurabh Bhardwaj", "Gaurav Kumar", "Haochen Yang", "Shaurya Bhardwaj", "Qun Wang", "Minjie Shen", "Yizhi Wang", "Cristabelle Madona De Souza"], "title": "Virtual Cells: From Conceptual Frameworks to Biomedical Applications", "categories": ["q-bio.QM"], "comment": "54 Pages, 7 Figures", "summary": "The challenge of translating vast, multimodal biological data into predictive\nand mechanistic understanding of cellular function is a central theme in modern\nbiology. Virtual cells, or digital cellular twins, have emerged as a critical\nparadigm to meet this challenge by creating integrative computational models of\ncellular processes. This review synthesizes the evolution and current state of\nthe virtual cell, from foundational mechanistic frameworks like the Virtual\nCell that employ deterministic and stochastic simulations to the recent\ntransformative impact of artificial intelligence and foundation models. We\nexamine the core technological pillars required to build these models,\nincluding the integration of various data types, such as single-cell and\nspatial omics, the spectrum of modeling approaches, and the bioengineering\nprinciples that connect simulation to application. We further discuss key\napplications, frameworks for model benchmarking and validation, and the\nsignificant hurdles that remain, including computational scalability, parameter\ninference, and ethical considerations, which provides a roadmap for development\nof predictive virtual cells that promise to revolutionize biomedical research\nand clinical practice."}
{"id": "2509.18225", "pdf": "https://arxiv.org/pdf/2509.18225", "abs": "https://arxiv.org/abs/2509.18225", "authors": ["Julien Mocq", "George Ruck", "Michaël Demortier", "Flavie Brun", "Romain Coulaud", "Olivier Geffard", "Arnaud Chaumot"], "title": "Rank Ordering of Species Sensitivities to Chemicals: Discrepancies between Behavioral and Lethal Responses in Freshwater and Marine Invertebrates", "categories": ["q-bio.QM"], "comment": null, "summary": "Locomotor behavioural responses are increasingly recognized as sensitive and\necologically relevant indicators for assessing aquatic organism exposure to\ncontaminants. They often occur at concentrations lower than those causing\nphysiological damage, yet their consequences for organisms' fitness and\npopulation dynamics remain unclear. Moreover, it is still uncertain how these\nbehavioural endpoints align with traditional toxicological apical endpoints\nused to assess species sensitivities in risk assessment. This study evaluates\nthe correlation between thresholds triggering locomotor reactions with LC50\nvalues across 19 freshwater and 12 marine invertebrate species exposed to the\ninsecticide imidacloprid and the metal copper. Behavioural responses were\nmeasured via videotracking during pulse exposure assays, while 96h acute tests\nprovided species-specific LC50 values for copper. Results reveal strong\ndiscrepancies: some highly sensitive species showed no locomotor changes,\nwhereas others tolerant to lethality displayed strong movement responses. For\ninstance, freshwater annelids and gastropods responded markedly to\nimidacloprid, while marine shrimps exhibited hyperactivity under low copper\nlevels. These findings indicate that relying solely on lethality-based data may\nunderestimate the fraction of species affected by contamination. Integrating\nbehavioural endpoints into population risk assessment frameworks is therefore\ncrucial to better protect aquatic biodiversity."}
{"id": "2509.18228", "pdf": "https://arxiv.org/pdf/2509.18228", "abs": "https://arxiv.org/abs/2509.18228", "authors": ["Abdulhakim M. Abdi", "Fan Wang"], "title": "Forest tree species classification and entropy-derived uncertainty mapping using extreme gradient boosting and Sentinel-1/2 data", "categories": ["q-bio.QM", "stat.ML"], "comment": "24 pages, 6 figures, 2 tables", "summary": "We present a new 10-meter map of dominant tree species in Swedish forests\naccompanied by pixel-level uncertainty estimates. The tree species\nclassification is based on spatiotemporal metrics derived from Sentinel-1 and\nSentinel-2 satellite data, combined with field observations from the Swedish\nNational Forest Inventory. We apply an extreme gradient boosting model with\nBayesian optimization to relate field observations to satellite-derived\nfeatures and generate the final species map. Classification uncertainty is\nquantified using Shannon's entropy of the predicted class probabilities, which\nprovide a spatially explicit measure of model confidence. The final model\nachieved an overall accuracy of 85% (F1 score = 0.82, Matthews correlation\ncoefficient = 0.81), and mapped species distributions showed strong agreement\nwith official forest statistics (r = 0.96)."}
{"id": "2509.18408", "pdf": "https://arxiv.org/pdf/2509.18408", "abs": "https://arxiv.org/abs/2509.18408", "authors": ["Sarwan Ali"], "title": "Explicit Path CGR: Maintaining Sequence Fidelity in Geometric Representations", "categories": ["cs.LG", "q-bio.QM"], "comment": "Accepted to CIKM 2025 as Short paper", "summary": "We present a novel information-preserving Chaos Game Representation (CGR)\nmethod, also called Reverse-CGR (R-CGR), for biological sequence analysis that\naddresses the fundamental limitation of traditional CGR approaches - the loss\nof sequence information during geometric mapping. Our method introduces\ncomplete sequence recovery through explicit path encoding combined with\nrational arithmetic precision control, enabling perfect sequence reconstruction\nfrom stored geometric traces. Unlike purely geometric approaches, our\nreversibility is achieved through comprehensive path storage that maintains\nboth positional and character information at each step. We demonstrate the\neffectiveness of R-CGR on biological sequence classification tasks, achieving\ncompetitive performance compared to traditional sequence-based methods while\nproviding interpretable geometric visualizations. The approach generates\nfeature-rich images suitable for deep learning while maintaining complete\nsequence information through explicit encoding, opening new avenues for\ninterpretable bioinformatics analysis where both accuracy and sequence recovery\nare essential."}
{"id": "2509.18480", "pdf": "https://arxiv.org/pdf/2509.18480", "abs": "https://arxiv.org/abs/2509.18480", "authors": ["Yuyang Wang", "Jiarui Lu", "Navdeep Jaitly", "Josh Susskind", "Miguel Angel Bautista"], "title": "SimpleFold: Folding Proteins is Simpler than You Think", "categories": ["cs.LG", "q-bio.QM"], "comment": "28 pages, 11 figures, 13 tables", "summary": "Protein folding models have achieved groundbreaking results typically via a\ncombination of integrating domain knowledge into the architectural blocks and\ntraining pipelines. Nonetheless, given the success of generative models across\ndifferent but related problems, it is natural to question whether these\narchitectural designs are a necessary condition to build performant models. In\nthis paper, we introduce SimpleFold, the first flow-matching based protein\nfolding model that solely uses general purpose transformer blocks. Protein\nfolding models typically employ computationally expensive modules involving\ntriangular updates, explicit pair representations or multiple training\nobjectives curated for this specific domain. Instead, SimpleFold employs\nstandard transformer blocks with adaptive layers and is trained via a\ngenerative flow-matching objective with an additional structural term. We scale\nSimpleFold to 3B parameters and train it on approximately 9M distilled protein\nstructures together with experimental PDB data. On standard folding benchmarks,\nSimpleFold-3B achieves competitive performance compared to state-of-the-art\nbaselines, in addition SimpleFold demonstrates strong performance in ensemble\nprediction which is typically difficult for models trained via deterministic\nreconstruction objectives. Due to its general-purpose architecture, SimpleFold\nshows efficiency in deployment and inference on consumer-level hardware.\nSimpleFold challenges the reliance on complex domain-specific architectures\ndesigns in protein folding, opening up an alternative design space for future\nprogress."}
{"id": "2509.18599", "pdf": "https://arxiv.org/pdf/2509.18599", "abs": "https://arxiv.org/abs/2509.18599", "authors": ["Eva Guttmann-Flury", "Shan Zhao", "Jian Zhao", "Mohamad Sawan"], "title": "From Noise to Insight: Visualizing Neural Dynamics with Segmented SNR Topographies for Improved EEG-BCI Performance", "categories": ["q-bio.NC", "q-bio.QM"], "comment": null, "summary": "Electroencephalography (EEG)-based wearable brain-computer interfaces (BCIs)\nface challenges due to low signal-to-noise ratio (SNR) and non-stationary\nneural activity. We introduce in this manuscript a mathematically rigorous\nframework that combines data-driven noise interval evaluation with advanced SNR\nvisualization to address these limitations. Analysis of the publicly available\nEye-BCI multimodal dataset demonstrates the method's ability to recover\ncanonical P300 characteristics across frequency bands (delta: 0.5-4 Hz, theta:\n4-7.5 Hz, broadband: 1-15 Hz), with precise spatiotemporal localization of both\nP3a (frontocentral) and P3b (parietal) subcomponents. To the best of our\nknowledge, this is the first study to systematically assess the impact of noise\ninterval selection on EEG signal quality. Cross-session correlations for four\ndifferent choices of noise intervals spanning from early to late pre-stimulus\nphases also indicate that alertness and task engagement states modulate noise\ninterval sensitivity, suggesting broader applications for adaptive BCI systems.\nWhile validated in healthy participants, our results represent a first step\ntowards providing clinicians with an interpretable tool for detecting\nneurophysiological abnormalities and provides quantifiable metrics for system\noptimization."}
{"id": "2509.18998", "pdf": "https://arxiv.org/pdf/2509.18998", "abs": "https://arxiv.org/abs/2509.18998", "authors": ["Christina Schenk", "Jacobo Ayensa Jiménez", "Ignacio Romero"], "title": "Bayesian Calibration and Model Assessment of Cell Migration Dynamics with Surrogate Model Integration", "categories": ["math.AP", "cs.LG", "q-bio.CB", "q-bio.QM"], "comment": "31 pages, 13 figures, 1 table", "summary": "Computational models provide crucial insights into complex biological\nprocesses such as cancer evolution, but their mechanistic nature often makes\nthem nonlinear and parameter-rich, complicating calibration. We systematically\nevaluate parameter probability distributions in cell migration models using\nBayesian calibration across four complementary strategies: parametric and\nsurrogate models, each with and without explicit model discrepancy. This\napproach enables joint analysis of parameter uncertainty, predictive\nperformance, and interpretability. Applied to a real data experiment of\nglioblastoma progression in microfluidic devices, surrogate models achieve\nhigher computational efficiency and predictive accuracy, whereas parametric\nmodels yield more reliable parameter estimates due to their mechanistic\ngrounding. Incorporating model discrepancy exposes structural limitations,\nclarifying where model refinement is necessary. Together, these comparisons\noffer practical guidance for calibrating and improving computational models of\ncomplex biological systems."}
