{"id": "2508.16128", "pdf": "https://arxiv.org/pdf/2508.16128", "abs": "https://arxiv.org/abs/2508.16128", "authors": ["Xizhe Zhang", "Weixiong Zhang"], "title": "From Cancer Drivers to Cancer Keepers: Paradigm Shift and Clinical Implications", "categories": ["q-bio.MN"], "comment": null, "summary": "Cancer research has traditionally focused on identifying driver genes, those\nwith mutations that initiate tumorigenesis. The Cancer Driver Gene (CDG)\nparadigm, further supported by the observation of oncogene addiction in tumors,\nhas successfully guided the development of targeted therapies. However, the\nlimitations of this driver-centric view, highlighted by the broad emergence of\nfrequent therapeutic resistance, the presence of driver mutations in healthy\ntissues or individuals, and the lack of identifiable drivers in many tumors,\ncall for a shift in perspective and clinical practice. The latest network\ncontrollability perspective on cancer cells introduced the concept of Cancer\nKeeper Genes (CKGs) and a CKG-based paradigm for cancer therapeutics. The new\nconcept encompasses the concept of non-oncogene addiction, emphasizing reliance\non non-mutated pathways crucial for maintaining oncogenic cellular states.\nHere, we explore the transition towards a system-level understanding of cancer\nbased on the CKG paradigm, emphasizing the essential role of genes required for\ntumor maintenance, irrespective of their initiating function or mutational\ncapacity. We discuss clinical implications of this paradigm shift, highlighting\nthe progress made so far and potential of targeting non-driver CKGs, genes\ninvolved in processes like DNA damage response, proteostasis, and metabolism,\nas a promising strategy to overcome therapeutic challenges and achieve more\ndurable cancer control. Targeting these maintenance vulnerabilities represents\na critical evolution in precision oncology, moving towards therapies designed\nto dismantle the networks sustaining malignancies."}
{"id": "2508.16548", "pdf": "https://arxiv.org/pdf/2508.16548", "abs": "https://arxiv.org/abs/2508.16548", "authors": ["Daria Stepanova", "Helen M. Byrne", "Tomás Alarcón"], "title": "Stochastic modelling reveals that chromatin folding buffers epigenetic landscapes against sirtuin depletion during DNA damage", "categories": ["q-bio.QM"], "comment": "Main text: 19 pages, 6 figures; Supplementary Material: 16 pages, 6\n  figures, 1 table", "summary": "Epigenetic landscapes, represented by patterns of chemical modifications on\nhistone tails, are essential for maintaining cell identity and tissue\nhomeostasis. These landscapes are shaped by multiple factors, including local\nbiochemical signals and the three-dimensional organisation of chromatin.\nHowever, their response to genomic stress, such as DNA double-strand breaks\n(DSBs), remains incompletely understood. Here, we use a stochastic model of\nhistone modification dynamics integrated with chromatin architecture to\ninvestigate how local depletion of sirtuins, histone deacetylases involved in\nDSB repair, destabilises epigenetic patterns. Our simulations recapitulate\nexperimental findings in which sirtuin relocalisation to DSB sites leads to the\nepigenetic erosion and suggest that the resulting landscape depends on enzyme\nlevels and chromatin geometry. Importantly, chromatin regions with large\ndomains of long-range contacts are more resilient to epigenetic\ndestabilisation. These findings suggest that chromatin folding can buffer\nagainst relocation of histone-modifying enzymes, highlighting a structural\nmechanism for preserving epigenetic integrity under stress."}
