{"id": "2509.15664", "pdf": "https://arxiv.org/pdf/2509.15664", "abs": "https://arxiv.org/abs/2509.15664", "authors": ["Honggen Zhang", "Xiangrui Gao", "Lipeng Lai"], "title": "siDPT: siRNA Efficacy Prediction via Debiased Preference-Pair Transformer", "categories": ["q-bio.GN", "eess.SP", "q-bio.QM"], "comment": null, "summary": "Small interfering RNA (siRNA) is a short double-stranded RNA molecule (about\n21-23 nucleotides) with the potential to cure diseases by silencing the\nfunction of target genes. Due to its well-understood mechanism, many\nsiRNA-based drugs have been evaluated in clinical trials. However, selecting\neffective binding regions and designing siRNA sequences requires extensive\nexperimentation, making the process costly. As genomic resources and publicly\navailable siRNA datasets continue to grow, data-driven models can be leveraged\nto better understand siRNA-mRNA interactions. To fully exploit such data,\ncurating high-quality siRNA datasets is essential to minimize experimental\nerrors and noise. We propose siDPT: siRNA efficacy Prediction via Debiased\nPreference-Pair Transformer, a framework that constructs a preference-pair\ndataset and designs an siRNA-mRNA interactive transformer with debiased ranking\nobjectives to improve siRNA inhibition prediction and generalization. We\nevaluate our approach using two public datasets and one newly collected patent\ndataset. Our model demonstrates substantial improvement in Pearson correlation\nand strong performance across other metrics."}
{"id": "2509.15371", "pdf": "https://arxiv.org/pdf/2509.15371", "abs": "https://arxiv.org/abs/2509.15371", "authors": ["Jeffrey Roskes"], "title": "KoMbine: Propagating Statistical and Systematic Errors to Kaplan--Meier Curves", "categories": ["stat.ME", "q-bio.QM"], "comment": "submitted to JSS", "summary": "Kaplan--Meier curves are widely used in medical research to evaluate the\nperformance of biomarkers and predict patient outcomes. These curves are often\nshown without error bands, and even when error bands are provided, they\ntypically only account for the statistical uncertainty resulting from the\nfinite number of patients in the study. In reality, other sources of\nuncertainty affect the measurements as well. As datasets grow, the statistical\nuncertainty on the number of patients no longer dominates the overall\nuncertainty, and other uncertainties are increasingly important to model. The\nKoMbine package, developed based on procedures used in particle physics,\nprovides the first method to propagate both statistical and systematic\nuncertainties through the Kaplan--Meier curve estimation processes."}
{"id": "2509.15429", "pdf": "https://arxiv.org/pdf/2509.15429", "abs": "https://arxiv.org/abs/2509.15429", "authors": ["Victor Chardès"], "title": "Random Matrix Theory-guided sparse PCA for single-cell RNA-seq data", "categories": ["cs.LG", "physics.bio-ph", "q-bio.QM"], "comment": "16 figures", "summary": "Single-cell RNA-seq provides detailed molecular snapshots of individual cells\nbut is notoriously noisy. Variability stems from biological differences, PCR\namplification bias, limited sequencing depth, and low capture efficiency,\nmaking it challenging to adapt computational pipelines to heterogeneous\ndatasets or evolving technologies. As a result, most studies still rely on\nprincipal component analysis (PCA) for dimensionality reduction, valued for its\ninterpretability and robustness. Here, we improve upon PCA with a Random Matrix\nTheory (RMT)-based approach that guides the inference of sparse principal\ncomponents using existing sparse PCA algorithms. We first introduce a novel\nbiwhitening method, inspired by the Sinkhorn-Knopp algorithm, that\nsimultaneously stabilizes variance across genes and cells. This enables the use\nof an RMT-based criterion to automatically select the sparsity level, rendering\nsparse PCA nearly parameter-free. Our mathematically grounded approach retains\nthe interpretability of PCA while enabling robust, hands-off inference of\nsparse principal components. Across seven single-cell RNA-seq technologies and\nfour sparse PCA algorithms, we show that this method systematically improves\nthe reconstruction of the principal subspace and consistently outperforms PCA-,\nautoencoder-, and diffusion-based methods in cell-type classification tasks."}
{"id": "2509.15664", "pdf": "https://arxiv.org/pdf/2509.15664", "abs": "https://arxiv.org/abs/2509.15664", "authors": ["Honggen Zhang", "Xiangrui Gao", "Lipeng Lai"], "title": "siDPT: siRNA Efficacy Prediction via Debiased Preference-Pair Transformer", "categories": ["q-bio.GN", "eess.SP", "q-bio.QM"], "comment": null, "summary": "Small interfering RNA (siRNA) is a short double-stranded RNA molecule (about\n21-23 nucleotides) with the potential to cure diseases by silencing the\nfunction of target genes. Due to its well-understood mechanism, many\nsiRNA-based drugs have been evaluated in clinical trials. However, selecting\neffective binding regions and designing siRNA sequences requires extensive\nexperimentation, making the process costly. As genomic resources and publicly\navailable siRNA datasets continue to grow, data-driven models can be leveraged\nto better understand siRNA-mRNA interactions. To fully exploit such data,\ncurating high-quality siRNA datasets is essential to minimize experimental\nerrors and noise. We propose siDPT: siRNA efficacy Prediction via Debiased\nPreference-Pair Transformer, a framework that constructs a preference-pair\ndataset and designs an siRNA-mRNA interactive transformer with debiased ranking\nobjectives to improve siRNA inhibition prediction and generalization. We\nevaluate our approach using two public datasets and one newly collected patent\ndataset. Our model demonstrates substantial improvement in Pearson correlation\nand strong performance across other metrics."}
{"id": "2509.16070", "pdf": "https://arxiv.org/pdf/2509.16070", "abs": "https://arxiv.org/abs/2509.16070", "authors": ["Dominic Boutet", "Sylvain Baillet"], "title": "A Hypothesis-First Framework for Mechanistic Model Evaluation and Selection in Neuroimaging", "categories": ["q-bio.NC", "q-bio.QM"], "comment": "20 pages, 7 figures, 5 supplemental figures", "summary": "Neuroimaging provides rich measurements of brain structure and neural\nactivity, but turning these data into mechanistic insight remains difficult.\nStatistical models quantify associations without much considerations for how\nthey arise, whereas bio-realistic models directly embody candidate mechanisms\nbut remain hard to deploy rigorously without specialized training. We present a\nframework that recasts modeling choices as testable mechanistic hypotheses and\nsupplies a simple protocol for rejecting inappropriate model specifications,\nsuch as under-/over-parameterization or invalid simplifying assumptions, based\non predefined criteria before any parameter inference. The key idea is expected\nmodel behavior under feature generalization constraints: instead of judging a\nmodel solely by how well it fits a specific target feature of interest Y at an\noptimal parameter set, we evaluate the model's expected Y output when the model\nis constrained to reproduce a broader, or distinct, feature Z over the entire\nparameter space. We then assess whether a mirror statistical model, derived\nfrom the model's expected Y outputs, to the empirical statistical model using\nstandard statistics. In synthetic experiments with known ground truth (Wilson\nCowan dynamics), the framework correctly rejects mis-specified hypotheses,\npenalizes unnecessary degrees of freedom, and preserves valid specifications.\nThis provides a practical, hypothesis-first route to using mechanistic models\nfor neuroimaging without requiring expert-level methodology."}
