{"id": "2509.11023", "pdf": "https://arxiv.org/pdf/2509.11023", "abs": "https://arxiv.org/abs/2509.11023", "authors": ["Nour Khoudari", "John Nardini", "Alexandria Volkening"], "title": "Quantifying topological features and irregularities in zebrafish patterns using the sweeping-plane filtration", "categories": ["q-bio.QM", "55N31"], "comment": "40 pages, 17 figures", "summary": "Complex patterns emerge across a wide range of biological systems. While such\npatterns often exhibit remarkable robustness, variation and irregularity exist\nat multiple scales and can carry important information about the underlying\nagent interactions driving collective dynamics. Many methods for quantifying\nbiological patterns focus on large-scale, characteristic features (such as\nstripe width or spot number), but questions remain on how to characterize messy\npatterns. In the case of cellular patterns that emerge during development or\nregeneration, understanding where patterns are most susceptible to variability\nmay help shed light on cell behavior and the tissue environment. Motivated by\nthese challenges, we introduce methods based on topological data analysis to\nclassify and quantify messy patterns arising from agent-based interactions, by\nextracting meaningful biological interpretations from persistence barcode\nsummaries. To compute persistent homology, our methods rely on a sweeping-plane\nfiltration which, in comparison to the Vietoris--Rips filtration, is more\nrarely applied to biological systems. We demonstrate how results from the\nsweeping-plane filtration can be interpreted to quantify stripe patterns (with\nand without interruptions) by analyzing in silico zebrafish skin patterns, and\nwe generate new quantitative predictions about which pattern features may be\nmost robust or variable. Our work provides an automated framework for\nquantifying features and irregularities in spot and stripe patterns and\nhighlights how different approaches to persistent homology can provide\ncomplementary insight into biological systems."}
{"id": "2509.11083", "pdf": "https://arxiv.org/pdf/2509.11083", "abs": "https://arxiv.org/abs/2509.11083", "authors": ["Daniel Strömbom", "Catherine Futterman"], "title": "An Alignment-Free Explanation for Collective Predator Evasion in Moving Animal Groups", "categories": ["q-bio.QM"], "comment": "12 pages, 6 figures", "summary": "Moving animal groups consist of many distinct individuals but can operate and\nfunction as one unit when performing different tasks. Effectively evading\nunexpected predator attacks is one primary task for many moving groups. The\ncurrent explanation for predator evasion responses in moving animal groups\nrequire the individuals in the groups interact via (velocity) alignment.\nHowever, experiments have shown that some animals do not use alignment. This\nsuggests that another explanation for the predator evasion capacity in at least\nthese species is needed. Here we establish that effective collective predator\nevasion does not require alignment, it can be induced via attraction and\nrepulsion alone. We also show that speed differences between individuals that\nhave directly observed the predator and those that have not influence evasion\nsuccess and the speed of the collective evasion process, but are not required\nto induce the phenomenon. Our work here adds collective predator evasion to a\nnumber of phenomena previously thought to require alignment interactions that\nhave recently been shown to emerge from attraction and repulsion alone. Based\non our findings we suggest experiments and make predictions that may lead to a\ndeeper understanding of not only collective predator evasion, but also\ncollective motion in general."}
{"id": "2509.11354", "pdf": "https://arxiv.org/pdf/2509.11354", "abs": "https://arxiv.org/abs/2509.11354", "authors": ["Surajit Das", "Pavel Zun"], "title": "Introduction to a Low-Cost AI-Powered GUI for Unstained Cell Culture Analysis", "categories": ["q-bio.QM", "cs.CV", "eess.IV", "q-bio.CB"], "comment": null, "summary": "This article presents a novel microscopy image analysis framework designed\nfor low-budget labs equipped with a standard CPU desktop. The Python-based\nprogram enables cytometric analysis of live, unstained cells in culture through\nan advanced computer vision and machine learning pipeline. Crucially, the\nframework operates on label-free data, requiring no manually annotated training\ndata or training phase. It is accessible via a user-friendly, cross-platform\nGUI that requires no programming skills, while also providing a scripting\ninterface for programmatic control and integration by developers. The\nend-to-end workflow performs semantic and instance segmentation, feature\nextraction, analysis, evaluation, and automated report generation. Its modular\narchitecture supports easy maintenance and flexible integration while\nsupporting both single-image and batch processing. Validated on several\nunstained cell types from the public dataset of livecells, the framework\ndemonstrates superior accuracy and reproducibility compared to contemporary\ntools like Cellpose and StarDist. Its competitive segmentation speed on a\nCPU-based platform highlights its significant potential for basic research and\nclinical applications -- particularly in cell transplantation for personalized\nmedicine and muscle regeneration therapies."}
{"id": "2509.12131", "pdf": "https://arxiv.org/pdf/2509.12131", "abs": "https://arxiv.org/abs/2509.12131", "authors": ["Radek Erban"], "title": "Neural networks for learning macroscopic chemotactic sensitivity from microscopic models", "categories": ["q-bio.QM", "physics.bio-ph"], "comment": null, "summary": "The macroscopic (population-level) dynamics of chemotactic cell movement --\narising from underlying microscopic (individual-based) models -- are often\ndescribed by parabolic partial differential equations (PDEs) governing the\nspatio-temporal evolution of cell concentrations. In certain cases, these\nmacroscopic PDEs can be analytically derived from microscopic models, thereby\nelucidating the dependence of PDE coefficients on the parameters of the\nunderlying individual-based dynamics. However, such analytical derivations are\nnot always feasible, particularly for more complex or nonlinear microscopic\nmodels. In these instances, neural networks offer a promising alternative for\nestimating the coefficients of macroscopic PDEs directly from data generated by\nmicroscopic simulations. In this work, three microscopic models of chemotaxis\nare investigated. The macroscopic chemotaxis sensitivity is estimated using\nneural networks, thereby bridging the gap between individual-level behaviours\nand population-level descriptions. The results are compared with macroscopic\nPDEs, which can be derived for each model in certain parameter regimes."}
{"id": "2509.10502", "pdf": "https://arxiv.org/pdf/2509.10502", "abs": "https://arxiv.org/abs/2509.10502", "authors": ["Sujatha Kotte", "Vangala Govindakrishnan Saipradeep", "Vidushi Walia", "Dhandapani Nandagopal", "Thomas Joseph", "Naveen Sivadasan", "Bhagat Singh Lali"], "title": "MIDOG 2025 Track 2: A Deep Learning Model for Classification of Atypical and Normal Mitotic Figures under Class and Hardness Imbalances", "categories": ["eess.IV", "cs.CV", "q-bio.QM"], "comment": "MIDOG 2025 Track 2 submission", "summary": "Motivation: Accurate classification of mitotic figures into normal and\natypical types is crucial for tumor prognostication in digital pathology.\nHowever, developing robust deep learning models for this task is challenging\ndue to the subtle morphological differences, as well as significant class and\nhardness imbalances in real-world histopathology datasets. Methods: We propose\na novel deep learning approach based on a ResNet backbone with specialized\nclassification heads. Our architecture uniquely models both the mitotic figure\nphenotype and the instance difficulty simultaneously. This method is\nspecifically designed to handle the challenges of diverse tissue types, scanner\nvariability, and imbalanced data. We employed focal loss to effectively\nmitigate the pronounced class imbalance, and a comprehensive data augmentation\npipeline was implemented to enhance the model's robustness and\ngeneralizability. Results: Our approach demonstrated strong and consistent\nperformance. In a 5-fold cross-validation on the MIDOG 2025 Track 2 dataset, it\nachieved a mean balanced accuracy of 0.8744 +/- 0.0093 and an ROC AUC of 0.9505\n+/- 0.029. The model showed robust generalization across preliminary\nleaderboard evaluations, achieving an overall balanced accuracy of 0.8736 +/-\n0.0204. Conclusion: The proposed method offers a reliable and generalizable\nsolution for the classification of atypical and normal mitotic figures. By\naddressing the inherent challenges of real world data, our approach has the\npotential to support precise prognostic assessments in clinical practice and\nimprove consistency in pathological diagnosis."}
{"id": "2509.11493", "pdf": "https://arxiv.org/pdf/2509.11493", "abs": "https://arxiv.org/abs/2509.11493", "authors": ["Luke Delzer", "Robert Kroleski", "Ali K. AlShami", "Jugal Kalita"], "title": "Drug Repurposing Using Deep Embedded Clustering and Graph Neural Networks", "categories": ["cs.LG", "q-bio.QM"], "comment": "Accepted at the 2025 International Conference on Machine Learning and\n  Applications (ICMLA)", "summary": "Drug repurposing has historically been an economically infeasible process for\nidentifying novel uses for abandoned drugs. Modern machine learning has enabled\nthe identification of complex biochemical intricacies in candidate drugs;\nhowever, many studies rely on simplified datasets with known drug-disease\nsimilarities. We propose a machine learning pipeline that uses unsupervised\ndeep embedded clustering, combined with supervised graph neural network link\nprediction to identify new drug-disease links from multi-omic data.\nUnsupervised autoencoder and cluster training reduced the dimensionality of\nomic data into a compressed latent embedding. A total of 9,022 unique drugs\nwere partitioned into 35 clusters with a mean silhouette score of 0.8550. Graph\nneural networks achieved strong statistical performance, with a prediction\naccuracy of 0.901, receiver operating characteristic area under the curve of\n0.960, and F1-Score of 0.901. A ranked list comprised of 477 per-cluster link\nprobabilities exceeding 99 percent was generated. This study could provide new\ndrug-disease link prospects across unrelated disease domains, while advancing\nthe understanding of machine learning in drug repurposing studies."}
{"id": "2509.12073", "pdf": "https://arxiv.org/pdf/2509.12073", "abs": "https://arxiv.org/abs/2509.12073", "authors": ["Kah Keng Wong"], "title": "Generalized Additive Modeling of TRPM4-Ribo Transcriptional Space in Prostate Cancer", "categories": ["q-bio.GN", "q-bio.QM"], "comment": "39 pages, 10 figures, 13 supplementary tables, 3 supplementary\n  figures", "summary": "TRPM4 is overexpressed in prostate cancer (PCa) associated with metastasis or\nrecurrence. There is paucity of information pertaining to TRPM4\ncharacterization and functions at single-cell level in PCa. In this study,\ngeneralized additive model (GAM) was utilized to model the relationship between\nTRPM4 and genes shortlisted using Spearman-Kendall dual-filter in aggressive\nPCa and benign prostate (BP) control cells derived from scRNA-seq dataset.\nSeven ribosomal genes (RPL10, RPL27, RPL28, RPS2, RPS8, RPS12, and RPS26;\naveraged into Ribo as the gene set), passed the dual-filter specifically in PCa\ncells. GAM modeling of TRPM4-Ribo significantly outperformed TRPM4 modeling\nwith alternative cancer gene sets (GSK-3B, mTOR, NF-KB, PI3K/AKT, and Wnt).\nCell explanatory power (CEP) classification was devised and verified by\ncross-validation to identify individual PCa cells most well-predicted by the\nmodel. CEP classification binarized PCa cells into top-ranked explanatory power\n(TREP; more well-predicted by the model) and non-TREP cells. In TRPM4-Ribo GAM\nplots, distribution pattern of TREP cells shifted at an inflection point (IP)\ni.e., the specific TRPM4 expression value that further binarized the plot into\npre-IP (TRPM4 values below IP) and post-IP (TRPM4 values above IP) regions,\nproducing a quadrant of TREP versus non-TREP cells for each PCa patient. Gene\nOntology (GO) enrichment analysis showed that pre-IP TREP cells enriched for\nimmune-related GOs, while post-IP TREP cells enriched for ribosomal,\ntranslation, and cell adhesion GOs. In conclusion, the CEP-IP framework based\non pairwise genes produces quadrants of cancer cell subpopulations, enabling\nthe identification of distinctive biology with potential therapeutic\nimplications."}
