{"id": "2507.15912", "pdf": "https://arxiv.org/pdf/2507.15912", "abs": "https://arxiv.org/abs/2507.15912", "authors": ["Narges Zarnaghinaghsh", "Byung-Jun Yoon"], "title": "Efficient design of rna sequences with desired properties, structure, and motifs using a grammar variational autoencoder", "categories": ["q-bio.QM"], "comment": null, "summary": "Designing structurally stable RNA sequences with specific motifs and other\ndesirable properties is an important challenge in bioinformatics. The potential\ndesign space increases exponentially with the length of the RNA to be\nengineered, which makes this a difficult combinatorial optimization problem. In\nthis paper, we propose an RNA grammar variational autoencoder (RGVAE) that can\nefficiently generate novel RNA sequences with specific target properties. The\nproposed RGVAE builds on the recently proposed grammar VAE, where we\nincorporate the stochastic context-free grammar (SCFG) to design strutural RNAs\nwith desired motifs and characteristics. Using the SCFG can ensure that the\ngenerated RNA sequence can form a thermodynamically stable secondary structure.\nGiven a RNA sequence, the SCFT is used to find the parse tree, which is\nrepresented in a continuous low-dimensional latent space by the RGVAE encoder.\nWe can optimize the RNA in the latent space, where the latent representation\ncan be decoded by the RGVAE decoder to reconstruct the RNA sequence. Based on a\nnumber of practical uses cases, we demonstrate that RGVAE can be used to\nefficiently design structurally stable RNAs with specific target properties,\nwhich significantly outperform other alternatives such as randomized design and\nregular VAEs that do not utilize the SCFG. Code availability: the source code\nof RGVAE and the data used in this study are provided in\nhttps://github.com/nzarnaghinaghsh/RGVAE/tree/main, DOI\n10.5281/zenodo.15569206."}
{"id": "2507.16801", "pdf": "https://arxiv.org/pdf/2507.16801", "abs": "https://arxiv.org/abs/2507.16801", "authors": ["Yuxi Lin", "Yaxue Fang", "Zehong Zhang", "Zhouwu Liu", "Siyun Zhong", "Fulong Yu"], "title": "Decoding Translation-Related Functional Sequences in 5'UTRs Using Interpretable Deep Learning Models", "categories": ["q-bio.QM", "cs.AI"], "comment": null, "summary": "Understanding how 5' untranslated regions (5'UTRs) regulate mRNA translation\nis critical for controlling protein expression and designing effective\ntherapeutic mRNAs. While recent deep learning models have shown promise in\npredicting translational efficiency from 5'UTR sequences, most are constrained\nby fixed input lengths and limited interpretability. We introduce UTR-STCNet, a\nTransformer-based architecture for flexible and biologically grounded modeling\nof variable-length 5'UTRs. UTR-STCNet integrates a Saliency-Aware Token\nClustering (SATC) module that iteratively aggregates nucleotide tokens into\nmulti-scale, semantically meaningful units based on saliency scores. A\nSaliency-Guided Transformer (SGT) block then captures both local and distal\nregulatory dependencies using a lightweight attention mechanism. This combined\narchitecture achieves efficient and interpretable modeling without input\ntruncation or increased computational cost. Evaluated across three benchmark\ndatasets, UTR-STCNet consistently outperforms state-of-the-art baselines in\npredicting mean ribosome load (MRL), a key proxy for translational efficiency.\nMoreover, the model recovers known functional elements such as upstream AUGs\nand Kozak motifs, highlighting its potential for mechanistic insight into\ntranslation regulation."}
{"id": "2507.15871", "pdf": "https://arxiv.org/pdf/2507.15871", "abs": "https://arxiv.org/abs/2507.15871", "authors": ["Arya Adyasha", "Anushka Sanjay Shelke", "Haroon R Lone"], "title": "Autonomic Arousal in Social Anxiety: An Electrodermal Activity Study During an Emotionally Salient Cognitive Task", "categories": ["q-bio.NC", "q-bio.QM"], "comment": null, "summary": "Social anxiety disorder (SAD) is associated with heightened physiological\narousal in social-evaluative contexts, but it remains unclear whether such\nautonomic reactivity extends to non-evaluative cognitive stressors. This study\ninvestigated electrodermal activity (EDA) patterns in socially anxious (SA) and\nnon-socially anxious (NSA) individuals during an emotionally salient 2-back\nworking memory task using facial expressions. 50 participants (25 SA, 25 NSA)\ncompleted both a baseline rest period and the task while EDA data were\ncollected via the Shimmer3 GSR+ sensor. A range of EDA features, such as tonic\nand phasic components, number and amplitude of skin conductance responses, and\nsympathetic activation estimates, were analyzed using a standardized,\ninterval-based approach. Results revealed significant increases in EDA across\nall participants from baseline to task, indicating elevated autonomic arousal\nduring cognitive load. However, no significant group differences were found\nbetween SA and NSA individuals. These findings suggest that cognitive-emotional\nstress, in the absence of social-evaluative threat, elicits comparable\nphysiological responses regardless of social anxiety status. The results\nunderscore the context-dependent nature of anxiety-related autonomic reactivity\nand advocate for the inclusion of social-evaluative or recovery phases in\nfuture research to detect more nuanced group effects."}
{"id": "2507.16148", "pdf": "https://arxiv.org/pdf/2507.16148", "abs": "https://arxiv.org/abs/2507.16148", "authors": ["Jindong Wang", "Yutong Mao", "Xiao Liu", "Wenrui Hao"], "title": "Learning Patient-Specific Spatial Biomarker Dynamics via Operator Learning for Alzheimer's Disease Progression", "categories": ["cs.LG", "q-bio.QM"], "comment": null, "summary": "Alzheimer's disease (AD) is a complex, multifactorial neurodegenerative\ndisorder with substantial heterogeneity in progression and treatment response.\nDespite recent therapeutic advances, predictive models capable of accurately\nforecasting individualized disease trajectories remain limited. Here, we\npresent a machine learning-based operator learning framework for personalized\nmodeling of AD progression, integrating longitudinal multimodal imaging,\nbiomarker, and clinical data. Unlike conventional models with prespecified\ndynamics, our approach directly learns patient-specific disease operators\ngoverning the spatiotemporal evolution of amyloid, tau, and neurodegeneration\nbiomarkers. Using Laplacian eigenfunction bases, we construct geometry-aware\nneural operators capable of capturing complex brain dynamics. Embedded within a\ndigital twin paradigm, the framework enables individualized predictions,\nsimulation of therapeutic interventions, and in silico clinical trials. Applied\nto AD clinical data, our method achieves high prediction accuracy exceeding 90%\nacross multiple biomarkers, substantially outperforming existing approaches.\nThis work offers a scalable, interpretable platform for precision modeling and\npersonalized therapeutic optimization in neurodegenerative diseases."}
{"id": "2507.16223", "pdf": "https://arxiv.org/pdf/2507.16223", "abs": "https://arxiv.org/abs/2507.16223", "authors": ["Alexander Mihalcea"], "title": "Aligned Manifold Property and Topology Point Clouds for Learning Molecular Properties", "categories": ["cs.LG", "q-bio.QM"], "comment": "13 pages, 6 figures", "summary": "Machine learning models for molecular property prediction generally rely on\nrepresentations -- such as SMILES strings and molecular graphs -- that overlook\nthe surface-local phenomena driving intermolecular behavior. 3D-based\napproaches often reduce surface detail or require computationally expensive\nSE(3)-equivariant architectures to manage spatial variance. To overcome these\nlimitations, this work introduces AMPTCR (Aligned Manifold Property and\nTopology Cloud Representation), a molecular surface representation that\ncombines local quantum-derived scalar fields and custom topological descriptors\nwithin an aligned point cloud format. Each surface point includes a chemically\nmeaningful scalar, geodesically derived topology vectors, and coordinates\ntransformed into a canonical reference frame, enabling efficient learning with\nconventional SE(3)-sensitive architectures. AMPTCR is evaluated using a DGCNN\nframework on two tasks: molecular weight and bacterial growth inhibition. For\nmolecular weight, results confirm that AMPTCR encodes physically meaningful\ndata, with a validation R^2 of 0.87. In the bacterial inhibition task, AMPTCR\nenables both classification and direct regression of E. coli inhibition values\nusing Dual Fukui functions as the electronic descriptor and Morgan Fingerprints\nas auxiliary data, achieving an ROC AUC of 0.912 on the classification task,\nand an R^2 of 0.54 on the regression task. These results help demonstrate that\nAMPTCR offers a compact, expressive, and architecture-agnostic representation\nfor modeling surface-mediated molecular properties."}
