{"id": "2510.17920", "pdf": "https://arxiv.org/pdf/2510.17920", "abs": "https://arxiv.org/abs/2510.17920", "authors": ["Bishal Chhetri", "B. V. Rathish Kumar"], "title": "CBINNS: Cancer Biology-Informed Neural Network for Unknown Parameter Estimation and Missing Physics Identification", "categories": ["q-bio.QM", "cs.AI"], "comment": "29 pages, 24 figures", "summary": "The dynamics of tumor-immune interactions within a complex tumor\nmicroenvironment are typically modeled using a system of ordinary differential\nequations or partial differential equations. These models introduce some\nunknown parameters that need to be estimated accurately and efficiently from\nthe limited and noisy experimental data. Moreover, due to the intricate\nbiological complexity and limitations in experimental measurements,\ntumor-immune dynamics are not fully understood, and therefore, only partial\nknowledge of the underlying physics may be available, resulting in unknown or\nmissing terms within the system of equations. In this study, we develop a\ncancer biology-informed neural network model(CBINN) to infer the unknown\nparameters in the system of equations as well as to discover the missing\nphysics from sparse and noisy measurements. We test the performance of the\nCBINN model on three distinct nonlinear compartmental tumor-immune models and\nevaluate its robustness across multiple synthetic noise levels. By harnessing\nthese highly nonlinear dynamics, our CBINN framework effectively estimates the\nunknown model parameters and uncovers the underlying physical laws or\nmathematical structures that govern these biological systems, even from\nscattered and noisy measurements. The models chosen here represent the dynamic\npatterns commonly observed in compartmental models of tumor-immune\ninteractions, thereby validating the generalizability and efficacy of our\nmethodology."}
{"id": "2510.18790", "pdf": "https://arxiv.org/pdf/2510.18790", "abs": "https://arxiv.org/abs/2510.18790", "authors": ["Kevin Michalewicz", "Chen Jin", "Philip Alexander Teare", "Tom Diethe", "Mauricio Barahona", "Barbara Bravi", "Asher Mullokandov"], "title": "Protein generation with embedding learning for motif diversification", "categories": ["q-bio.QM", "physics.bio-ph", "stat.ML"], "comment": null, "summary": "A fundamental challenge in protein design is the trade-off between generating\nstructural diversity while preserving motif biological function. Current\nstate-of-the-art methods, such as partial diffusion in RFdiffusion, often fail\nto resolve this trade-off: small perturbations yield motifs nearly identical to\nthe native structure, whereas larger perturbations violate the geometric\nconstraints necessary for biological function. We introduce Protein Generation\nwith Embedding Learning (PGEL), a general framework that learns\nhigh-dimensional embeddings encoding sequence and structural features of a\ntarget motif in the representation space of a diffusion model's frozen\ndenoiser, and then enhances motif diversity by introducing controlled\nperturbations in the embedding space. PGEL is thus able to loosen geometric\nconstraints while satisfying typical design metrics, leading to more diverse\nyet viable structures. We demonstrate PGEL on three representative cases: a\nmonomer, a protein-protein interface, and a cancer-related transcription factor\ncomplex. In all cases, PGEL achieves greater structural diversity, better\ndesignability, and improved self-consistency, as compared to partial diffusion.\nOur results establish PGEL as a general strategy for embedding-driven protein\ngeneration allowing for systematic, viable diversification of functional\nmotifs."}
{"id": "2510.18870", "pdf": "https://arxiv.org/pdf/2510.18870", "abs": "https://arxiv.org/abs/2510.18870", "authors": ["Jeffrey Ouyang-Zhang", "Pranav Murugan", "Daniel J. Diaz", "Gianluca Scarpellini", "Richard Strong Bowen", "Nate Gruver", "Adam Klivans", "Philipp Krähenbühl", "Aleksandra Faust", "Maruan Al-Shedivat"], "title": "Triangle Multiplication Is All You Need For Biomolecular Structure Representations", "categories": ["q-bio.QM"], "comment": "Preprint", "summary": "AlphaFold has transformed protein structure prediction, but emerging\napplications such as virtual ligand screening, proteome-wide folding, and de\nnovo binder design demand predictions at a massive scale, where runtime and\nmemory costs become prohibitive. A major bottleneck lies in the Pairformer\nbackbone of AlphaFold3-style models, which relies on computationally expensive\ntriangular primitives-especially triangle attention-for pairwise reasoning. We\nintroduce Pairmixer, a streamlined alternative that eliminates triangle\nattention while preserving higher-order geometric reasoning capabilities that\nare critical for structure prediction. Pairmixer substantially improves\ncomputational efficiency, matching state-of-the-art structure predictors across\nfolding and docking benchmarks, delivering up to 4x faster inference on long\nsequences while reducing training cost by 34%. Its efficiency alleviates the\ncomputational burden of downstream applications such as modeling large protein\ncomplexes, high-throughput ligand and binder screening, and hallucination-based\ndesign. Within BoltzDesign, for example, Pairmixer delivers over 2x faster\nsampling and scales to sequences ~30% longer than the memory limits of\nPairformer."}
{"id": "2510.18103", "pdf": "https://arxiv.org/pdf/2510.18103", "abs": "https://arxiv.org/abs/2510.18103", "authors": ["Nursultan Mamatov", "Philipp Kellmeyer"], "title": "Enhancing mortality prediction in cardiac arrest ICU patients through meta-modeling of structured clinical data from MIMIC-IV", "categories": ["cs.LG", "cs.AI", "q-bio.QM", "68T07, 92C50", "I.2.6; I.5.1; J.3"], "comment": "38 pages, 5 figures, 2 tables, 3 appendices", "summary": "Accurate early prediction of in-hospital mortality in intensive care units\n(ICUs) is essential for timely clinical intervention and efficient resource\nallocation. This study develops and evaluates machine learning models that\nintegrate both structured clinical data and unstructured textual information,\nspecifically discharge summaries and radiology reports, from the MIMIC-IV\ndatabase. We used LASSO and XGBoost for feature selection, followed by a\nmultivariate logistic regression trained on the top features identified by both\nmodels. Incorporating textual features using TF-IDF and BERT embeddings\nsignificantly improved predictive performance. The final logistic regression\nmodel, which combined structured and textual input, achieved an AUC of 0.918,\ncompared to 0.753 when using structured data alone, a relative improvement 22%.\nThe analysis of the decision curve demonstrated a superior standardized net\nbenefit in a wide range of threshold probabilities (0.2-0.8), confirming the\nclinical utility of the model. These results underscore the added prognostic\nvalue of unstructured clinical notes and support their integration into\ninterpretable feature-driven risk prediction models for ICU patients."}
{"id": "2510.18571", "pdf": "https://arxiv.org/pdf/2510.18571", "abs": "https://arxiv.org/abs/2510.18571", "authors": ["Gokturk Aytug Akarlar"], "title": "A Multi-Evidence Framework Rescues Low-Power Prognostic Signals and Rejects Statistical Artifacts in Cancer Genomics", "categories": ["q-bio.GN", "cs.LG", "92B15, 62P10, 62F10, 62H17", "J.3; I.2.6; G.3"], "comment": "17 pages (main text), 4 figures (main text), 7 supplementary figures,\n  4 supplementary tables. Focuses on a computational framework using causal\n  inference and biological validation for underpowered cancer genomic studies", "summary": "Motivation: Standard genome-wide association studies in cancer genomics rely\non statistical significance with multiple testing correction, but\nsystematically fail in underpowered cohorts. In TCGA breast cancer (n=967, 133\ndeaths), low event rates (13.8%) create severe power limitations, producing\nfalse negatives for known drivers and false positives for large passenger\ngenes. Results: We developed a five-criteria computational framework\nintegrating causal inference (inverse probability weighting, doubly robust\nestimation) with orthogonal biological validation (expression, mutation\npatterns, literature evidence). Applied to TCGA-BRCA mortality analysis,\nstandard Cox+FDR detected zero genes at FDR<0.05, confirming complete failure\nin underpowered settings. Our framework correctly identified RYR2 -- a cardiac\ngene with no cancer function -- as a false positive despite nominal\nsignificance (p=0.024), while identifying KMT2C as a complex candidate\nrequiring validation despite marginal significance (p=0.047, q=0.954). Power\nanalysis revealed median power of 15.1% across genes, with KMT2C achieving only\n29.8% power (HR=1.55), explaining borderline statistical significance despite\nstrong biological evidence. The framework distinguished true signals from\nartifacts through mutation pattern analysis: RYR2 showed 29.8% silent mutations\n(passenger signature) with no hotspots, while KMT2C showed 6.7% silent\nmutations with 31.4% truncating variants (driver signature). This\nmulti-evidence approach provides a template for analyzing underpowered cohorts,\nprioritizing biological interpretability over purely statistical significance.\n  Availability: All code and analysis pipelines available at\ngithub.com/akarlaraytu/causal-inference-for-cancer-genomics"}
{"id": "2510.18387", "pdf": "https://arxiv.org/pdf/2510.18387", "abs": "https://arxiv.org/abs/2510.18387", "authors": ["Silvère Ségaud", "Charlie Budd", "Matthew Elliot", "Graeme Stasiuk", "Jonathan Shapey", "Yijing Xie", "Tom Vercauteren"], "title": "Quantification of dual-state 5-ALA-induced PpIX fluorescence: Methodology and validation in tissue-mimicking phantoms", "categories": ["physics.med-ph", "eess.IV", "eess.SP", "q-bio.QM"], "comment": null, "summary": "Quantification of protoporphyrin IX (PpIX) fluorescence in human brain\ntumours has the potential to significantly improve patient outcomes in\nneuro-oncology, but represents a formidable imaging challenge. Protoporphyrin\nis a biological molecule which interacts with the tissue micro-environment to\nform two photochemical states in glioma. Each exhibits markedly different\nquantum efficiencies, with distinct but overlapping emission spectra that also\noverlap with tissue autofluorescence. Fluorescence emission is known to be\ndistorted by the intrinsic optical properties of tissue, coupled with marked\nintra-tumoural heterogeneity as a hallmark of glioma tumours. Existing\nquantitative fluorescence systems are developed and validated using simplified\nphantoms that do not simultaneously mimic the complex interactions between\nfluorophores and tissue optical properties or micro-environment. Consequently,\nexisting systems risk introducing systematic errors into PpIX quantification\nwhen used in tissue. In this work, we introduce a novel pipeline for\nquantification of PpIX in glioma, which robustly differentiates both emission\nstates from background autofluorescence without reliance on a priori spectral\ninformation, and accounts for variations in their quantum efficiency. Unmixed\nPpIX emission forms are then corrected for wavelength-dependent optical\ndistortions and weighted for accurate quantification. Significantly, this\npipeline is developed and validated using novel tissue-mimicking phantoms\nreplicating the optical properties of glioma tissues and photochemical\nvariability of PpIX fluorescence in glioma. Our workflow achieves strong\ncorrelation with ground-truth PpIX concentrations (R2 = 0.918+-0.002),\ndemonstrating its potential for robust, quantitative PpIX fluorescence imaging\nin clinical settings."}
{"id": "2510.18575", "pdf": "https://arxiv.org/pdf/2510.18575", "abs": "https://arxiv.org/abs/2510.18575", "authors": ["Yusi Fan", "Tian Wang", "Zhiying Yan", "Chang Liu", "Qiong Zhou", "Qi Lu", "Zhehao Guo", "Ziqi Deng", "Wenyu Zhu", "Ruochi Zhang", "Fengfeng Zhou"], "title": "HeFS: Helper-Enhanced Feature Selection via Pareto-Optimized Genetic Search", "categories": ["cs.LG", "q-bio.QM"], "comment": null, "summary": "Feature selection is a combinatorial optimization problem that is NP-hard.\nConventional approaches often employ heuristic or greedy strategies, which are\nprone to premature convergence and may fail to capture subtle yet informative\nfeatures. This limitation becomes especially critical in high-dimensional\ndatasets, where complex and interdependent feature relationships prevail. We\nintroduce the HeFS (Helper-Enhanced Feature Selection) framework to refine\nfeature subsets produced by existing algorithms. HeFS systematically searches\nthe residual feature space to identify a Helper Set - features that complement\nthe original subset and improve classification performance. The approach\nemploys a biased initialization scheme and a ratio-guided mutation mechanism\nwithin a genetic algorithm, coupled with Pareto-based multi-objective\noptimization to jointly maximize predictive accuracy and feature\ncomplementarity. Experiments on 18 benchmark datasets demonstrate that HeFS\nconsistently identifies overlooked yet informative features and achieves\nsuperior performance over state-of-the-art methods, including in challenging\ndomains such as gastric cancer classification, drug toxicity prediction, and\ncomputer science applications. The code and datasets are available at\nhttps://healthinformaticslab.org/supp/."}
