{"id": "2506.06413", "pdf": "https://arxiv.org/pdf/2506.06413", "abs": "https://arxiv.org/abs/2506.06413", "authors": ["Shi Qiru"], "title": "Antibody Consumption-Driven Dynamic Competition: A Systems Hypothesis for the Transition from Acute Immune Response to Post-Infection Sequelae", "categories": ["q-bio.QM"], "comment": null, "summary": "The mechanisms underlying the formation of post-infection sequelae are\ncomplex and remain controversial. This hypothesis integrates Bystryn's antibody\nfeedback phenomenon and Imbiakha's immune cost theory, proposing for the first\ntime a \"Consumption-Driven Dynamic Competition of Antibody Clones\" mechanism.\nThis mechanism posits that the immune system may regulate the proliferation and\ndifferentiation of corresponding B cell clones by sensing and responding to the\nconsumption rate of specific antibodies. This competition, driven by\ndifferences in consumption rates, might not only influence pathogen clearance\nefficiency and associated acute pathology during the antigen growth phase but\nalso critically mediate the onset, development, and even resolution of\npost-infection sequelae during the antigen decay and homeostasis\nre-establishment phases. The proposed three-phase \"consumption-driven dynamic\ncompetition\" model provides a unified and dynamic explanatory framework for\nunderstanding the significant individual variability and dynamic evolution of\npost-infection immune outcomes (including the emergence and self-limitation of\nacute symptoms, the formation and persistence of chronic sequelae, and symptom\nfluctuations or resolution). It emphasizes not just specific molecules but the\nmacroscopic dynamics of competition and selection within the immune system,\noffering a theoretical basis for exploring new intervention strategies for\nsequelae (e.g., by regulating the balance of antibody competition)."}
{"id": "2506.07793", "pdf": "https://arxiv.org/pdf/2506.07793", "abs": "https://arxiv.org/abs/2506.07793", "authors": ["Shoichiro Nakanishi"], "title": "Novel software for continuous wavelet analysis enable EEG real-time analysis on portable computers", "categories": ["q-bio.QM"], "comment": "17 pages, 4 figures, 2 tables", "summary": "Continuous Wavelet Transform (CWT) is frequently used for waveform analysis.\nFor example, in the field of neuroscience research, CWT is performed to analyze\nelectroencephalograms (EEG) and calculate the index of brain activity. Recent\nadvancements in computer technology, such as general-purpose computing on\nGraphics Processing Units (GPGPU), have enabled the application of CWT to\nreal-time waveform analysis. However, the computational complexity of CWT is\nlarge, and it is challenging to employ CWT as a real-time analysis method, such\nas in brain-machine interfaces (BMI), which require small size and cost.\nTherefore, a fast calculation method suitable for small and lightweight\ncomputers is desired. In this study, Python-based software for the CWT was\ndeveloped and tested on portable computers. Using this software, real-time\nanalysis of 64-electrode EEG data based on CWT was simulated and demonstrated\nadequate speed for the real-time analysis. Furthermore, it exhibited\nflexibility in performing CWT with various parameters. This software can\ncontribute to the development of compact and lightweight BMI devices. Since CWT\nis a mathematical method, it may be used as a tool for other purposes."}
{"id": "2506.06514", "pdf": "https://arxiv.org/pdf/2506.06514", "abs": "https://arxiv.org/abs/2506.06514", "authors": ["Viacheslav Dubovitskii", "Aritra Bose", "Filippo Utro", "Laxmi Pardia"], "title": "On Quantum Random Walks in Biomolecular Networks", "categories": ["quant-ph", "q-bio.MN", "q-bio.QM"], "comment": null, "summary": "Biomolecular networks, such as protein-protein interactions, gene-gene\nassociations, and cell-cell interactions, offer valuable insights into the\ncomplex organization of biological systems. These networks are key to\nunderstanding cellular functions, disease mechanisms, and identifying\ntherapeutic targets. However, their analysis is challenged by the high\ndimensionality, heterogeneity, and sparsity of multi-omics data. Random walk\nalgorithms are widely used to propagate information through disease modules,\nhelping to identify disease-associated genes and uncover relevant biological\npathways. In this work, we investigate the limitations of classical random\nwalks and explore the potential of quantum random walks (QRWs) for biomolecular\nnetwork analysis. We evaluate QRWs in two network-based applications. First, in\na gene-gene interaction network associated with asthma, autism, and\nschizophrenia, QRWs more accurately rank disease-associated genes compared to\nclassical methods. Second, in a structured multi-partite cell-cell interaction\nnetwork derived from mouse brown adipose tissue, QRWs identify key driver genes\nin malignant cells that are overlooked by classical random walks. Our findings\nsuggest that quantum random walks offer a promising alternative to classical\napproaches, with improved sensitivity to network structure and better\nperformance in identifying biologically relevant features. This highlights\ntheir potential in advancing network medicine and systems biology."}
{"id": "2506.07459", "pdf": "https://arxiv.org/pdf/2506.07459", "abs": "https://arxiv.org/abs/2506.07459", "authors": ["Ziwen Wang", "Jiajun Fan", "Ruihan Guo", "Thao Nguyen", "Heng Ji", "Ge Liu"], "title": "ProteinZero: Self-Improving Protein Generation via Online Reinforcement Learning", "categories": ["cs.LG", "q-bio.QM"], "comment": null, "summary": "Protein generative models have shown remarkable promise in protein design but\nstill face limitations in success rate, due to the scarcity of high-quality\nprotein datasets for supervised pretraining. We present ProteinZero, a novel\nframework that enables scalable, automated, and continuous self-improvement of\nthe inverse folding model through online reinforcement learning. To achieve\ncomputationally tractable online feedback, we introduce efficient proxy reward\nmodels based on ESM-fold and a novel rapid ddG predictor that significantly\naccelerates evaluation speed. ProteinZero employs a general RL framework\nbalancing multi-reward maximization, KL-divergence from a reference model, and\na novel protein-embedding level diversity regularization that prevents mode\ncollapse while promoting higher sequence diversity. Through extensive\nexperiments, we demonstrate that ProteinZero substantially outperforms existing\nmethods across every key metric in protein design, achieving significant\nimprovements in structural accuracy, designability, thermodynamic stability,\nand sequence diversity. Most impressively, ProteinZero reduces design failure\nrates by approximately 36% - 48% compared to widely-used methods like\nProteinMPNN, ESM-IF and InstructPLM, consistently achieving success rates\nexceeding 90% across diverse and complex protein folds. Notably, the entire RL\nrun on CATH-4.3 can be done with a single 8 X GPU node in under 3 days,\nincluding reward computation. Our work establishes a new paradigm for protein\ndesign where models evolve continuously from their own generated outputs,\nopening new possibilities for exploring the vast protein design space."}
{"id": "2506.06514", "pdf": "https://arxiv.org/pdf/2506.06514", "abs": "https://arxiv.org/abs/2506.06514", "authors": ["Viacheslav Dubovitskii", "Aritra Bose", "Filippo Utro", "Laxmi Pardia"], "title": "On Quantum Random Walks in Biomolecular Networks", "categories": ["quant-ph", "q-bio.MN", "q-bio.QM"], "comment": null, "summary": "Biomolecular networks, such as protein-protein interactions, gene-gene\nassociations, and cell-cell interactions, offer valuable insights into the\ncomplex organization of biological systems. These networks are key to\nunderstanding cellular functions, disease mechanisms, and identifying\ntherapeutic targets. However, their analysis is challenged by the high\ndimensionality, heterogeneity, and sparsity of multi-omics data. Random walk\nalgorithms are widely used to propagate information through disease modules,\nhelping to identify disease-associated genes and uncover relevant biological\npathways. In this work, we investigate the limitations of classical random\nwalks and explore the potential of quantum random walks (QRWs) for biomolecular\nnetwork analysis. We evaluate QRWs in two network-based applications. First, in\na gene-gene interaction network associated with asthma, autism, and\nschizophrenia, QRWs more accurately rank disease-associated genes compared to\nclassical methods. Second, in a structured multi-partite cell-cell interaction\nnetwork derived from mouse brown adipose tissue, QRWs identify key driver genes\nin malignant cells that are overlooked by classical random walks. Our findings\nsuggest that quantum random walks offer a promising alternative to classical\napproaches, with improved sensitivity to network structure and better\nperformance in identifying biologically relevant features. This highlights\ntheir potential in advancing network medicine and systems biology."}
{"id": "2506.07553", "pdf": "https://arxiv.org/pdf/2506.07553", "abs": "https://arxiv.org/abs/2506.07553", "authors": ["Jingchao Wang", "Haote Yang", "Jiang Wu", "Yifan He", "Xingjian Wei", "Yinfan Wang", "Chengjin Liu", "Lingli Ge", "Lijun Wu", "Bin Wang", "Dahua Lin", "Conghui He"], "title": "GTR-CoT: Graph Traversal as Visual Chain of Thought for Molecular Structure Recognition", "categories": ["cs.AI", "q-bio.QM"], "comment": null, "summary": "Optical Chemical Structure Recognition (OCSR) is crucial for digitizing\nchemical knowledge by converting molecular images into machine-readable\nformats. While recent vision-language models (VLMs) have shown potential in\nthis task, their image-captioning approach often struggles with complex\nmolecular structures and inconsistent annotations. To overcome these\nchallenges, we introduce GTR-Mol-VLM, a novel framework featuring two key\ninnovations: (1) the \\textit{Graph Traversal as Visual Chain of Thought}\nmechanism that emulates human reasoning by incrementally parsing molecular\ngraphs through sequential atom-bond predictions, and (2) the data-centric\nprinciple of \\textit{Faithfully Recognize What You've Seen}, which addresses\nthe mismatch between abbreviated structures in images and their expanded\nannotations. To support model development, we constructed GTR-CoT-1.3M, a\nlarge-scale instruction-tuning dataset with meticulously corrected annotations,\nand introduced MolRec-Bench, the first benchmark designed for a fine-grained\nevaluation of graph-parsing accuracy in OCSR. Comprehensive experiments\ndemonstrate that GTR-Mol-VLM achieves superior results compared to specialist\nmodels, chemistry-domain VLMs, and commercial general-purpose VLMs. Notably, in\nscenarios involving molecular images with functional group abbreviations,\nGTR-Mol-VLM outperforms the second-best baseline by approximately 14 percentage\npoints, both in SMILES-based and graph-based metrics. We hope that this work\nwill drive OCSR technology to more effectively meet real-world needs, thereby\nadvancing the fields of cheminformatics and AI for Science. We will release\nGTR-CoT at https://github.com/opendatalab/GTR-CoT."}
{"id": "2506.07591", "pdf": "https://arxiv.org/pdf/2506.07591", "abs": "https://arxiv.org/abs/2506.07591", "authors": ["Shang Qu", "Ning Ding", "Linhai Xie", "Yifei Li", "Zaoqu Liu", "Kaiyan Zhang", "Yibai Xiong", "Yuxin Zuo", "Zhangren Chen", "Ermo Hua", "Xingtai Lv", "Youbang Sun", "Yang Li", "Dong Li", "Fuchu He", "Bowen Zhou"], "title": "Automating Exploratory Multiomics Research via Language Models", "categories": ["cs.AI", "q-bio.QM"], "comment": null, "summary": "This paper introduces PROTEUS, a fully automated system that produces\ndata-driven hypotheses from raw data files. We apply PROTEUS to clinical\nproteogenomics, a field where effective downstream data analysis and hypothesis\nproposal is crucial for producing novel discoveries. PROTEUS uses separate\nmodules to simulate different stages of the scientific process, from open-ended\ndata exploration to specific statistical analysis and hypothesis proposal. It\nformulates research directions, tools, and results in terms of relationships\nbetween biological entities, using unified graph structures to manage complex\nresearch processes. We applied PROTEUS to 10 clinical multiomics datasets from\npublished research, arriving at 360 total hypotheses. Results were evaluated\nthrough external data validation and automatic open-ended scoring. Through\nexploratory and iterative research, the system can navigate high-throughput and\nheterogeneous multiomics data to arrive at hypotheses that balance reliability\nand novelty. In addition to accelerating multiomic analysis, PROTEUS represents\na path towards tailoring general autonomous systems to specialized scientific\ndomains to achieve open-ended hypothesis generation from data."}
{"id": "2506.07619", "pdf": "https://arxiv.org/pdf/2506.07619", "abs": "https://arxiv.org/abs/2506.07619", "authors": ["Toby Boyne", "Juan S. Campos", "Becky D. Langdon", "Jixiang Qing", "Yilin Xie", "Shiqiang Zhang", "Calvin Tsay", "Ruth Misener", "Daniel W. Davies", "Kim E. Jelfs", "Sarah Boyall", "Thomas M. Dixon", "Linden Schrecker", "Jose Pablo Folch"], "title": "The Catechol Benchmark: Time-series Solvent Selection Data for Few-shot Machine Learning", "categories": ["cs.LG", "q-bio.QM"], "comment": null, "summary": "Machine learning has promised to change the landscape of laboratory\nchemistry, with impressive results in molecular property prediction and\nreaction retro-synthesis. However, chemical datasets are often inaccessible to\nthe machine learning community as they tend to require cleaning, thorough\nunderstanding of the chemistry, or are simply not available. In this paper, we\nintroduce a novel dataset for yield prediction, providing the first-ever\ntransient flow dataset for machine learning benchmarking, covering over 1200\nprocess conditions. While previous datasets focus on discrete parameters, our\nexperimental set-up allow us to sample a large number of continuous process\nconditions, generating new challenges for machine learning models. We focus on\nsolvent selection, a task that is particularly difficult to model theoretically\nand therefore ripe for machine learning applications. We showcase benchmarking\nfor regression algorithms, transfer-learning approaches, feature engineering,\nand active learning, with important applications towards solvent replacement\nand sustainable manufacturing."}
