{"id": "2506.05769", "pdf": "https://arxiv.org/pdf/2506.05769", "abs": "https://arxiv.org/abs/2506.05769", "authors": ["Matteo Fraschini", "Matteo Demuru", "Daniele Marinazzo", "Luca Didaci"], "title": "Connectome brain fingerprinting: terminology, measures, and target properties", "categories": ["q-bio.QM", "q-bio.NC"], "comment": null, "summary": "Distinguishing one person from another (what biometricians call recognition)\nis extremely relevant for different aspects of life. Traditional biometric\nmodalities (fingerprint, face, iris, voice) rely on unique, stable features\nthat reliably differentiate individuals. Recently, the term fingerprinting has\ngained popularity in neuroscience, with a growing number of studies adopting\nthe term to describe various brain based metrics derived from different\ntechniques. However, we think there is a mismatch between its widely accepted\nmeaning in the biometric community and some brain based metrics. Many of these\nmeasures do not satisfy the strict definition of a biometric fingerprint that\nis, a stable trait that uniquely identifies an individual. In this study we\ndiscuss some issues that may generate confusion in this context and suggest how\nto treat the question in the future. In particular, we review how fingerprint\nis currently used in the neuroscience literature, highlight mismatches with the\nbiometric community definition, and offer clear guidelines for distinguishing\ngenuine biometric fingerprints from exploratory similarity metrics. By\nclarifying terminology and criteria, we aim to align practices and facilitate\ncommunication across fields."}
{"id": "2506.05992", "pdf": "https://arxiv.org/pdf/2506.05992", "abs": "https://arxiv.org/abs/2506.05992", "authors": ["Frank Bastian", "Hassan Alkhayuon", "Kieran Mulchrone", "Micheal O'Riordain", "Sebastian Wieczorek"], "title": "Cancer model with moving extinction threshold reproduces real cancer data", "categories": ["q-bio.QM", "math.DS"], "comment": null, "summary": "We propose a simple dynamic model of cancer development that captures\ncarcinogenesis and subsequent cancer progression. A central idea of the model\nis to include the immune system as an extinction threshold, similar to the\nstrong Allee effect in population biology. We first identify the limitations of\ncommonly used Allee effect models in reproducing typical cancer progression. We\nthen address these limitations by deriving a new model that incorporates: (i)\nrandom mutations of stem cells at a rate that increases with age and (ii)\nimmune response whose strength may also vary over time.\n  Our model accurately reproduces a wide range of real-world cancer data: the\ntypical age-specific cumulative risk of most human cancers, the progression of\nbreast cancer in mice, and the unusual age-specific cumulative risk of breast\ncancer in women. In the last case, we use a moving extinction threshold to\nreflect the different immune response at different phases of the menstrual\ncycle and menopausal treatment. This provides new insights into the effects of\nhormone replacement therapy and menstrual cycle length. This moving threshold\napproach can be applied to a variety of other cancer scenarios where the immune\nresponse or other important factors may vary over time."}
{"id": "2506.05549", "pdf": "https://arxiv.org/pdf/2506.05549", "abs": "https://arxiv.org/abs/2506.05549", "authors": ["Greta Grassmann", "Mattia Miotto", "Francesca Alessandrini", "Leonardo Bo'", "Giancarlo Ruocco", "Edoardo Milanetti", "Andrea Giansanti"], "title": "Insights into the role of dynamical features in protein complex formation: the case of SARS-CoV-2 spike binding with ACE2", "categories": ["q-bio.BM", "physics.bio-ph", "q-bio.QM"], "comment": "20 pages, 10 figures, 4 tables", "summary": "The functionality of protein-protein complexes is closely tied to the\nstrength of their interactions, making the evaluation of binding affinity a\ncentral focus in structural biology. However, the molecular determinants\nunderlying binding affinity are still not fully understood. In particular, the\nentropic contributions, especially those arising from conformational dynamics,\nremain poorly characterized. In this study, we explore the relationship between\nprotein motion and binding stability and its role in protein function. To gain\ndeeper insight into how protein complexes modulate their stability, we\ninvestigated a model system with a well-characterized and fast evolutionary\nhistory: a set of SARS-CoV-2 spike protein variants bound to the human ACE2\nreceptor, for which experimental binding affinity data are available. Through\nMolecular Dynamics simulations, we analyzed both structural and dynamical\ndifferences between the unbound (apo) and bound (holo) forms of the spike\nprotein across several variants of concern. Our findings indicate that a more\nstable binding is associated with proteins that exhibit higher rigidity in\ntheir unbound state and display dynamical patterns similar to that observed\nafter binding to ACE2. The increase of binding stability is not the sole\ndriving force of SARS-CoV-2 evolution. More recent variants are characterized\nby a more dynamical behavior that determines a less efficient viral entry but\ncould optimize other traits, such as antibody escape. These results suggest\nthat to fully understand the strength of the binding between two proteins, the\nstability of the two isolated partners should be investigated."}
{"id": "2506.05916", "pdf": "https://arxiv.org/pdf/2506.05916", "abs": "https://arxiv.org/abs/2506.05916", "authors": ["Arián Ferrero-Fernández", "Paula Prondzinsky", "Lucia Gastoldi", "David A. Fike", "Harrison B. Smith", "Daniele De Martino", "Andrea De Martino", "Shawn Erin McGlynn"], "title": "Single-cell metabolic flux analysis reveals coexisting optimal sub-groups, cross-feeding, and mixotrophy in a cyanobacterial population", "categories": ["q-bio.PE", "physics.bio-ph", "q-bio.MN"], "comment": "submitted; 15+14 pages, 5+12 figures", "summary": "We derive a single-cell level understanding of metabolism in an isogenic\ncyanobacterial population by integrating secondary ion mass spectrometry (SIMS)\nderived multi-isotope uptake measurements of Synechocystis sp. PCC6803 with a\nstatistical inference protocol based on Liebig's law of the minimum, the\nmaximum entropy principle, and constraint-based modeling. We find the\npopulation is structured in two metabolically distinct clusters: cells\noptimizing carbon yield while excessively turning over nitrogen, and cells\nwhich act reciprocally, optimizing nitrogen yield and excessively turning over\ncarbon. This partition enables partial heterotrophy within the population via\nmetabolic exchange, likely in the form of organic acids. Exchange increases the\nfeasible metabolic space, and mixotrophic cells achieve the fastest growth\nrates. Metabolic flux analysis at the single-cell level reveals heterogeneity\nin carbon fixation rates, Rubisco specificity, and nitrogen assimilation. Our\nresults provide a necessary foundation for understanding how population level\nphenotypes arise from the collective contributions of distinct individuals."}
{"id": "2506.06191", "pdf": "https://arxiv.org/pdf/2506.06191", "abs": "https://arxiv.org/abs/2506.06191", "authors": ["Kent M. Lee", "Joshua Rodriguez", "Ludger Hartley", "Philip A. Kragel", "Lorena Chanes", "Tor D. Wager", "Karen S. Quigley", "Lawrence L. Wald", "Marta Bianciardi", "Lisa Feldman Barrett", "Jordan E. Theriault", "Ajay B. Satpute"], "title": "Functional Architecture of the Human Hypothalamus: Cortical Coupling and Subregional Organization Using 7-Tesla fMRI", "categories": ["q-bio.NC", "q-bio.QM"], "comment": "36 pages, 1 table, 4 figures, 1 supplementary figure", "summary": "The hypothalamus plays an important role in the regulation of the bodys\nmetabolic state and behaviors related to survival. Despite its importance\nhowever, many questions exist regarding the intrinsic and extrinsic connections\nof the hypothalamus in humans, especially its relationship with the cortex. As\na heterogeneous structure, it is possible that the hypothalamus is composed of\ndifferent subregions, which have their own distinct relationships with the\ncortex. Previous work on functional connectivity in the human hypothalamus have\neither treated it as a unitary structure or relied on methodological approaches\nthat are limited in modeling its intrinsic functional architecture. Here, we\nused resting state data from ultrahigh field 7 Tesla fMRI and a data driven\nanalytical approach to identify functional subregions of the human\nhypothalamus. Our approach identified four functional hypothalamic subregions\nbased on intrinsic functional connectivity, which in turn showed distinct\npatterns of functional connectivity with cortex. Overall, all hypothalamic\nsubregions showed stronger connectivity with a cortical network, Cortical\nNetwork 1 composed primarily of frontal, midline, and limbic cortical areas and\nweaker connectivity with a second cortical network composed largely of\nposterior sensorimotor regions, Cortical Network 2. Of the hypothalamic\nsubregions, the anterior hypothalamus showed the strongest connection to\nCortical Network 1, while a more ventral subregion containing the anterior\nhypothalamus extending to the tuberal region showed the weakest connectivity.\nThe findings support the use of ultrahigh field, high resolution imaging in\nproviding a more incisive investigation of the human hypothalamus that respects\nits complex internal structure and extrinsic functional architecture."}
{"id": "2506.06233", "pdf": "https://arxiv.org/pdf/2506.06233", "abs": "https://arxiv.org/abs/2506.06233", "authors": ["Yunqi Yang", "Karl Tayeb", "Peter Carbonetto", "Xiaoyuan Zhong", "Carole Ober", "Matthew Stephens"], "title": "Bayesian variable selection in a Cox proportional hazards model with the \"Sum of Single Effects\" prior", "categories": ["stat.ME", "q-bio.QM", "stat.AP"], "comment": null, "summary": "Motivated by genetic fine-mapping applications, we introduce a new approach\nto Bayesian variable selection regression (BVSR) for time-to-event (TTE)\noutcomes. This new approach is designed to deal with the specific challenges\nthat arise in genetic fine-mapping, including: the presence of very strong\ncorrelations among the covariates, often exceeding 0.99; very large data sets\ncontaining potentially thousands of covariates and hundreds of thousands of\nsamples. We accomplish this by extending the \"Sum of Single Effects\" (SuSiE)\nmethod to the Cox proportional hazards (CoxPH) model. We demonstrate the\nbenefits of the new method, \"CoxPH-SuSiE\", over existing BVSR methods for TTE\noutcomes in simulated fine-mapping data sets. We also illustrate CoxPH-SuSiE on\nreal data by fine-mapping asthma loci using data from UK Biobank. This\nfine-mapping identified 14 asthma risk SNPs in 8 asthma risk loci, among which\n6 had strong evidence for being causal (posterior inclusion probability greater\nthan 50%). Two of the 6 putatively causal variants are known to be pathogenic,\nand others lie within a genomic sequence that is known to regulate the\nexpression of GATA3."}
