{"id": "2508.11783", "pdf": "https://arxiv.org/pdf/2508.11783", "abs": "https://arxiv.org/abs/2508.11783", "authors": ["Kyle R. Allison"], "title": "Multicellular control of gene networks", "categories": ["q-bio.MN"], "comment": "17 pages, 5 figures", "summary": "Biological organisms are simple at heart: cells, their basic units, perform a\nvariety of behaviors by expressing proteins from DNA-encoded genes. Gene\nexpression though depends on sets of often-convoluted regulatory interactions\nknown as gene networks, contributing to biology's apparent complexity. Even in\nEscherichia coli K-12, the pioneering model organism of molecular biology, gene\nnetworks are complicated and inconsistent with gene expression data. Recent\ndiscoveries of multicellular self-organization in E. coli suggest a new model\nfor gene regulation that may help in many cases: control of gene networks by\nmulticellular interaction networks, i.e. the changing physical and chemical\ninteractions between cells in communities. E. coli's observed dynamics indicate\nmulticellular interactions serve as inputs for key gene networks, thereby\nproducing robust expression of otherwise noisy genes. In turn, multicellular\ninteraction networks are dynamically generated as outputs of gene networks\nduring self-organization. Thus, multicellular self-organization enables\nuniquely-biological control mechanisms that are not available to individual\ncells. As further suggested by E. coli self-organization, the gene-network\noutputs from one multicellular stage can be linked, via multicellular\ninteraction networks, to serve as the gene-network inputs for later stages,\nthereby creating multicellular daisy chains. Daisy chains are a general model\nfor reliably propagating multicellular communities and, therefore, for\npredictably determining the gene-network inputs of each cell throughout\nmulticellular self-organization and development. Considerations for several\nfields are briefly discussed and suggest multicellular daisy chains are a\ngeneral mechanism for biological organisms to control cell behavior and to be\nsimpler than the sum of their parts."}
{"id": "2508.12731", "pdf": "https://arxiv.org/pdf/2508.12731", "abs": "https://arxiv.org/abs/2508.12731", "authors": ["Ruiqi Chen", "Liang Hang", "Fengyun Wang"], "title": "Mechanism of Quercetin in Inhibiting Triple-Negative Breast Cancer by Regulating T Cell-Related Targets: An Analysis Based on Single-Cell Sequencing and Network Pharmacology", "categories": ["q-bio.MN", "q-bio.GN"], "comment": null, "summary": "Objective: To investigate the mechanism by which quercetin inhibits\ntriple-negative breast cancer (TNBC) through regulating T-cell-related targets,\nproviding a novel strategy for TNBC immunotherapy.Methods: Single-cell RNA\nsequencing (GSE161529 dataset) and network pharmacology were integrated. PCA\nand UMAP clustering identified T-cell subsets and differentially expressed\ngenes in TNBC microenvironment. TNBC-related targets were screened via CTD and\nOMIM databases, with functional pathways analyzed by GO/KEGG enrichment.\nMolecular docking and PPI networks validated interactions between quercetin and\ncore targets.Results: Quercetin intersected with 79 TNBC targets, including\nAKT1, EGFR, and MMP9, enriched in EGFR inhibitor resistance and endocrine\nresistance pathways. Molecular docking revealed the highest affinity between\nquercetin and GSK3B (-13.2 kJ/mol). AKT1 and MMP9 expression correlated with\npatient survival.Conclusion: Quercetin may reverse TNBC immunosuppression by\nmulti-target modulation of T-cell function, but clinical application requires\nsolutions for its low bioavailability, such as delivery systems or combination\ntherapies."}
{"id": "2508.11724", "pdf": "https://arxiv.org/pdf/2508.11724", "abs": "https://arxiv.org/abs/2508.11724", "authors": ["Jake Turley", "Ryan A. Palmer", "Isaac V. Chenchiah", "Daniel Robert"], "title": "BeeNet: Reconstructing Flower Shapes from Electric Fields using Deep Learning", "categories": ["q-bio.QM", "cs.CV"], "comment": "14 pages, 4 figures", "summary": "Arthropods, including pollinators, respond to environmental electrical\nfields. Here, we show that electric field information can be decoded to\nreconstruct environmental features. We develop an algorithm capable of\ninferring the shapes of polarisable flowers from the electric field generated\nby a nearby charged bee. We simulated electric fields arising from bee flower\ninteractions for flowers with varying petal geometries. These simulated data\nwere used to train a deep learning UNet model to recreate petal shapes. The\nmodel accurately reconstructed diverse flower shapes including more complex\nflower shapes not included in training. Reconstruction performance peaked at an\noptimal bee flower distance, indicating distance-dependent encoding of shape\ninformation. These findings show that electroreception can impart rich spatial\ndetail, offering insights into arthropod environmental perception."}
{"id": "2508.12742", "pdf": "https://arxiv.org/pdf/2508.12742", "abs": "https://arxiv.org/abs/2508.12742", "authors": ["Theodoros Bermperidis", "Joe Vero", "Elizabeth B Torres"], "title": "On the Importance of Behavioral Nuances: Amplifying Non-Obvious Motor Noise Under True Empirical Considerations May Lead to Briefer Assays and Faster Classification Processes", "categories": ["q-bio.QM", "cs.CV", "cs.LG", "eess.SP", "nlin.CD"], "comment": "This paper is under review in IEEE Transactions on Affective\n  Computing", "summary": "There is a tradeoff between attaining statistical power with large, difficult\nto gather data sets, and producing highly scalable assays that register brief\ndata samples. Often, as grand-averaging techniques a priori assume\nnormally-distributed parameters and linear, stationary processes in\nbiorhythmic, time series data, important information is lost, averaged out as\ngross data. We developed an affective computing platform that enables taking\nbrief data samples while maintaining personalized statistical power. This is\nachieved by combining a new data type derived from the micropeaks present in\ntime series data registered from brief (5-second-long) face videos with recent\nadvances in AI-driven face-grid estimation methods. By adopting geometric and\nnonlinear dynamical systems approaches to analyze the kinematics, especially\nthe speed data, the new methods capture all facial micropeaks. These include as\nwell the nuances of different affective micro expressions. We offer new ways to\ndifferentiate dynamical and geometric patterns present in autistic individuals\nfrom those found more commonly in neurotypical development."}
{"id": "2508.11741", "pdf": "https://arxiv.org/pdf/2508.11741", "abs": "https://arxiv.org/abs/2508.11741", "authors": ["Habibolla Latifizadeh", "Anika C. Pirkey", "Alanna Gould", "David J. Klinke II"], "title": "BaMANI: Bayesian Multi-Algorithm causal Network Inference", "categories": ["stat.ML", "cs.LG", "q-bio.QM"], "comment": "12 pages, 6 figures", "summary": "Improved computational power has enabled different disciplines to predict\ncausal relationships among modeled variables using Bayesian network inference.\nWhile many alternative algorithms have been proposed to improve the efficiency\nand reliability of network prediction, the predicted causal networks reflect\nthe generative process but also bear an opaque imprint of the specific\ncomputational algorithm used. Following a ``wisdom of the crowds\" strategy, we\ndeveloped an ensemble learning approach to marginalize the impact of a single\nalgorithm on Bayesian causal network inference. To introduce the approach, we\nfirst present the theoretical foundation of this framework. Next, we present a\ncomprehensive implementation of the framework in terms of a new software tool\ncalled BaMANI (Bayesian Multi-Algorithm causal Network Inference). Finally, we\ndescribe a BaMANI use-case from biology, particularly within human breast\ncancer studies."}
{"id": "2508.12212", "pdf": "https://arxiv.org/pdf/2508.12212", "abs": "https://arxiv.org/abs/2508.12212", "authors": ["Chuanliu Fan", "Zicheng Ma", "Jun Gao", "Nan Yu", "Jun Zhang", "Ziqiang Cao", "Yi Qin Gao", "Guohong Fu"], "title": "ProtTeX-CC: Activating In-Context Learning in Protein LLM via Two-Stage Instruction Compression", "categories": ["cs.LG", "cs.AI", "q-bio.QM"], "comment": null, "summary": "Recent advances in protein large language models, such as ProtTeX, represent\nboth side-chain amino acids and backbone structure as discrete token sequences\nof residue length. While this design enables unified modeling of multimodal\nprotein information, it suffers from two major limitations: (1) The\nconcatenation of sequence and structure tokens approximately doubles the\nprotein length and breaks the intrinsic residue-level alignment between\nmodalities. (2) Constrained by the training corpus and limited context window,\nProtTeX is typically trained on single-protein inputs, rendering it\nincompatible with in-context learning (ICL) and thus limiting its\ngeneralization capability. To address these issues, we propose ProtTeX-CC, a\nlightweight two-stage compression framework designed to enhance ProtTeX under\nfew-shot settings. We first design a joint embedding compression mechanism that\nfuses sequence and structure representations at the residue level, effectively\nreducing the protein input length by half without sacrificing performance. Then\nwe propose a self-compression module that aggregates each full demonstration\ninto the latent space of the last few linguistic tokens, reducing the average\ndemonstration length from 751 tokens to less than 16 tokens. Compared to the\noriginal ProtTeX, our self-compression approach achieves a compression ratio of\napproximately 93.68% in the total prompt length under the 16-shot setting.\nWithout modifying the backbone model, ProtTeX-CC introduces only a small number\nof additional parameters through PEFT-based tuning in the joint embedding\ncompression stage and a single trainable projection layer in the\nself-compression stage. Extensive experiments on protein function prediction\nshow that ProtTeX-CC improves performance on the in-domain benchmark by 2%, and\ngeneralizes well to the out-of-domain dataset with a performance gain of 11%."}
{"id": "2508.12260", "pdf": "https://arxiv.org/pdf/2508.12260", "abs": "https://arxiv.org/abs/2508.12260", "authors": ["Carson Dudley", "Reiden Magdaleno", "Christopher Harding", "Ananya Sharma", "Emily Martin", "Marisa Eisenberg"], "title": "Mantis: A Simulation-Grounded Foundation Model for Disease Forecasting", "categories": ["cs.AI", "q-bio.QM"], "comment": "10 pages, 4 figures", "summary": "Infectious disease forecasting in novel outbreaks or low resource settings\nhas been limited by the need for disease-specific data, bespoke training, and\nexpert tuning. We introduce Mantis, a foundation model trained entirely on\nmechanistic simulations, which enables out-of-the-box forecasting across\ndiseases, regions, and outcomes, even in settings with limited historical data.\nMantis is built on over 400 million simulated days of outbreak dynamics\nspanning diverse pathogens, transmission modes, interventions, and surveillance\nartifacts. Despite requiring no real-world data during training, Mantis\noutperformed 39 expert-tuned models we tested across six diseases, including\nall models in the CDC's COVID-19 Forecast Hub. Mantis generalized to novel\nepidemiological regimes, including diseases with held-out transmission\nmechanisms, demonstrating that it captures fundamental contagion dynamics.\nCritically, Mantis is mechanistically interpretable, enabling public health\ndecision-makers to identify the latent drivers behind its predictions. Finally,\nMantis delivers accurate forecasts at 8-week horizons, more than doubling the\nactionable range of most models, enabling proactive public health planning.\nTogether, these capabilities position Mantis as a foundation for\nnext-generation disease forecasting systems: general, interpretable, and\ndeployable where traditional models fail."}
{"id": "2508.12297", "pdf": "https://arxiv.org/pdf/2508.12297", "abs": "https://arxiv.org/abs/2508.12297", "authors": ["Yuhong Zhang", "Chenghang Li", "Boya Wang", "Jinzhi Lei"], "title": "A stochastic agent-based model for simulating tumor-immune dynamics and evaluating therapeutic strategies", "categories": ["q-bio.TO", "q-bio.QM"], "comment": "26 pages, 13 figures", "summary": "Tumor-immune interactions are central to cancer progression and treatment\noutcomes. In this study, we present a stochastic agent-based model that\nintegrates cellular heterogeneity, spatial cell-cell interactions, and drug\nresistance evolution to simulate tumor growth and immune response in a\ntwo-dimensional microenvironment. The model captures dynamic behaviors of four\nmajor cell types--tumor cells, cytotoxic T lymphocytes, helper T cells, and\nregulatory T cells--and incorporates key biological processes such as\nproliferation, apoptosis, migration, and immune regulation. Using this\nframework, we simulate tumor progression under different therapeutic\ninterventions, including radiotherapy, targeted therapy, and immune checkpoint\nblockade. Our simulations reproduce emergent phenomena such as immune privilege\nand spatial immune exclusion. Quantitative analyses show that all therapies\nsuppress tumor growth to varying degrees and reshape the tumor\nmicroenvironment. Notably, combination therapies--especially targeted therapy\nwith immunotherapy--achieve the most effective tumor control and delay the\nemergence of resistance. Additionally, sensitivity analyses reveal a nonlinear\nrelationship between treatment intensity and therapeutic efficacy, highlighting\nthe existence of optimal dosing thresholds. This work demonstrates the utility\nof agent-based modeling in capturing complex tumor-immune dynamics and provides\na computational platform for optimizing cancer treatment strategies. The model\nis extensible, biologically interpretable, and well-suited for future\nintegration with experimental or clinical data."}
{"id": "2508.12500", "pdf": "https://arxiv.org/pdf/2508.12500", "abs": "https://arxiv.org/abs/2508.12500", "authors": ["Rahmat K. Adesunkanmi", "Ashfaq Khokhar", "Goce Trajcevski", "Sohail Murad"], "title": "Root Cause Analysis of Hydrogen Bond Separation in Spatio-Temporal Molecular Dynamics using Causal Models", "categories": ["cs.AI", "cs.LG", "q-bio.QM"], "comment": "Submitted to ACM", "summary": "Molecular dynamics simulations (MDS) face challenges, including\nresource-heavy computations and the need to manually scan outputs to detect\n\"interesting events,\" such as the formation and persistence of hydrogen bonds\nbetween atoms of different molecules. A critical research gap lies in\nidentifying the underlying causes of hydrogen bond formation and separation\n-understanding which interactions or prior events contribute to their emergence\nover time. With this challenge in mind, we propose leveraging spatio-temporal\ndata analytics and machine learning models to enhance the detection of these\nphenomena. In this paper, our approach is inspired by causal modeling and aims\nto identify the root cause variables of hydrogen bond formation and separation\nevents. Specifically, we treat the separation of hydrogen bonds as an\n\"intervention\" occurring and represent the causal structure of the bonding and\nseparation events in the MDS as graphical causal models. These causal models\nare built using a variational autoencoder-inspired architecture that enables us\nto infer causal relationships across samples with diverse underlying causal\ngraphs while leveraging shared dynamic information. We further include a step\nto infer the root causes of changes in the joint distribution of the causal\nmodels. By constructing causal models that capture shifts in the conditional\ndistributions of molecular interactions during bond formation or separation,\nthis framework provides a novel perspective on root cause analysis in molecular\ndynamic systems. We validate the efficacy of our model empirically on the\natomic trajectories that used MDS for chiral separation, demonstrating that we\ncan predict many steps in the future and also find the variables driving the\nobserved changes in the system."}
{"id": "2508.12508", "pdf": "https://arxiv.org/pdf/2508.12508", "abs": "https://arxiv.org/abs/2508.12508", "authors": ["Anqi Feng", "Zhangxing Bian", "Samuel W. Remedios", "Savannah P. Hays", "Blake E. Dewey", "Jiachen Zhuo", "Dan Benjamini", "Jerry L. Prince"], "title": "Segmenting Thalamic Nuclei: T1 Maps Provide a Reliable and Efficient Solution", "categories": ["eess.IV", "cs.CV", "q-bio.QM"], "comment": null, "summary": "Accurate thalamic nuclei segmentation is crucial for understanding\nneurological diseases, brain functions, and guiding clinical interventions.\nHowever, the optimal inputs for segmentation remain unclear. This study\nsystematically evaluates multiple MRI contrasts, including MPRAGE and FGATIR\nsequences, quantitative PD and T1 maps, and multiple T1-weighted images at\ndifferent inversion times (multi-TI), to determine the most effective inputs.\nFor multi-TI images, we employ a gradient-based saliency analysis with Monte\nCarlo dropout and propose an Overall Importance Score to select the images\ncontributing most to segmentation. A 3D U-Net is trained on each of these\nconfigurations. Results show that T1 maps alone achieve strong quantitative\nperformance and superior qualitative outcomes, while PD maps offer no added\nvalue. These findings underscore the value of T1 maps as a reliable and\nefficient input among the evaluated options, providing valuable guidance for\noptimizing imaging protocols when thalamic structures are of clinical or\nresearch interest."}
{"id": "2508.12575", "pdf": "https://arxiv.org/pdf/2508.12575", "abs": "https://arxiv.org/abs/2508.12575", "authors": ["Zohra Yagoub", "Hafida Bouziane"], "title": "Deep Learning Model for Amyloidogenicity Prediction using a Pre-trained Protein LLM", "categories": ["cs.LG", "cs.AI", "q-bio.QM"], "comment": null, "summary": "The prediction of amyloidogenicity in peptides and proteins remains a focal\npoint of ongoing bioinformatics. The crucial step in this field is to apply\nadvanced computational methodologies. Many recent approaches to predicting\namyloidogenicity within proteins are highly based on evolutionary motifs and\nthe individual properties of amino acids. It is becoming increasingly evident\nthat the sequence information-based features show high predictive performance.\nConsequently, our study evaluated the contextual features of protein sequences\nobtained from a pretrained protein large language model leveraging\nbidirectional LSTM and GRU to predict amyloidogenic regions in peptide and\nprotein sequences. Our method achieved an accuracy of 84.5% on 10-fold\ncross-validation and an accuracy of 83% in the test dataset. Our results\ndemonstrate competitive performance, highlighting the potential of LLMs in\nenhancing the accuracy of amyloid prediction."}
