{"id": "2510.26556", "pdf": "https://arxiv.org/pdf/2510.26556", "abs": "https://arxiv.org/abs/2510.26556", "authors": ["Claus Kadelka"], "title": "On the number of non-degenerate canalizing Boolean functions", "categories": ["cs.DM", "math.CO", "q-bio.MN"], "comment": "11 pages, 3 figures", "summary": "Canalization is a key organizing principle in complex systems, particularly\nin gene regulatory networks. It describes how certain input variables exert\ndominant control over a function's output, thereby imposing hierarchical\nstructure and conferring robustness to perturbations. Degeneracy, in contrast,\ncaptures redundancy among input variables and reflects the complete dominance\nof some variables by others. Both properties influence the stability and\ndynamics of discrete dynamical systems, yet their combinatorial underpinnings\nremain incompletely understood. Here, we derive recursive formulas for counting\nBoolean functions with prescribed numbers of essential variables and given\ncanalizing properties. In particular, we determine the number of non-degenerate\ncanalizing Boolean functions -- that is, functions for which all variables are\nessential and at least one variable is canalizing. Our approach extends earlier\nenumeration results on canalizing and nested canalizing functions. It provides\na rigorous foundation for quantifying how frequently canalization occurs among\nrandom Boolean functions and for assessing its pronounced over-representation\nin biological network models, where it contributes to both robustness and to\nthe emergence of distinct regulatory roles."}
{"id": "2510.25814", "pdf": "https://arxiv.org/pdf/2510.25814", "abs": "https://arxiv.org/abs/2510.25814", "authors": ["Yilong Lu", "Si Chen", "Songyan Gao", "Han Liu", "Xin Dong", "Wenfeng Shen", "Guangtai Ding"], "title": "Optimizing Mirror-Image Peptide Sequence Design for Data Storage via Peptide Bond Cleavage Prediction", "categories": ["q-bio.QM", "cs.LG"], "comment": "8 pages, 4 figures", "summary": "Traditional non-biological storage media, such as hard drives, face\nlimitations in both storage density and lifespan due to the rapid growth of\ndata in the big data era. Mirror-image peptides composed of D-amino acids have\nemerged as a promising biological storage medium due to their high storage\ndensity, structural stability, and long lifespan. The sequencing of\nmirror-image peptides relies on \\textit{de-novo} technology. However, its\naccuracy is limited by the scarcity of tandem mass spectrometry datasets and\nthe challenges that current algorithms encounter when processing these peptides\ndirectly. This study is the first to propose improving sequencing accuracy\nindirectly by optimizing the design of mirror-image peptide sequences. In this\nwork, we introduce DBond, a deep neural network based model that integrates\nsequence features, precursor ion properties, and mass spectrometry\nenvironmental factors for the prediction of mirror-image peptide bond cleavage.\nIn this process, sequences with a high peptide bond cleavage ratio, which are\neasy to sequence, are selected. The main contributions of this study are as\nfollows. First, we constructed MiPD513, a tandem mass spectrometry dataset\ncontaining 513 mirror-image peptides. Second, we developed the peptide bond\ncleavage labeling algorithm (PBCLA), which generated approximately 12.5 million\nlabeled data based on MiPD513. Third, we proposed a dual prediction strategy\nthat combines multi-label and single-label classification. On an independent\ntest set, the single-label classification strategy outperformed other methods\nin both single and multiple peptide bond cleavage prediction tasks, offering a\nstrong foundation for sequence optimization."}
{"id": "2510.26685", "pdf": "https://arxiv.org/pdf/2510.26685", "abs": "https://arxiv.org/abs/2510.26685", "authors": ["Xiyao Yu", "Kai Fu"], "title": "A Proposed Framework for Quantifying AI-to-Clinical Translation: The Algorithm-to-Outcome Concordance (AOC) Metric", "categories": ["q-bio.QM"], "comment": "Supplementary materials included (4 documents with validation methods\n  and datasets). Code available at https://github.com/PillowSoprano/AOC", "summary": "Background: The rapid evolution of personalized neoantigen vaccines has been\naccelerated by artificial intelligence (AI)-based prediction models. Yet, a\nconsistent framework to evaluate the translational fidelity between\ncomputational predictions and clinical outcomes remains lacking. Methods: This\nsystematic synthesis analyzed six melanoma vaccine trials conducted between\n2017 and 2025 across mRNA, peptide, and dendritic cell platforms. We introduced\nthe Algorithm-to-Outcome Concordance (AOC) metric - a quantitative measure\nlinking model performance (AUC) with clinical efficacy (HR/ORR) - and\nintegrated mechanistic, economic, and regulatory perspectives. Results:\nSimulated AOC values across studies ranged from 0.42-0.79, suggesting\nheterogeneous concordance between algorithmic prediction and observed outcomes.\nHigh tumor mutational burden and clonal neoantigen dominance correlated with\nimproved translational fidelity. Economic modeling suggested that achieving AOC\n>0.7 could reduce ICER below $100,000/QALY. Conclusions: This framework\nquantitatively bridges AI-driven neoantigen prediction with clinical\ntranslation, offering a reproducible metric for future personalized vaccine\nvalidation and regulatory standardization. This study presents AOC as a\nhypothesis-generating tool, with all computations based on simulated or\naggregated trial data for demonstration purposes only."}
{"id": "2510.25943", "pdf": "https://arxiv.org/pdf/2510.25943", "abs": "https://arxiv.org/abs/2510.25943", "authors": ["Ann Huang", "Mitchell Ostrow", "Satpreet H. Singh", "Leo Kozachkov", "Ila Fiete", "Kanaka Rajan"], "title": "InputDSA: Demixing then Comparing Recurrent and Externally Driven Dynamics", "categories": ["q-bio.NC", "cs.LG", "cs.NE", "q-bio.QM"], "comment": "36 pages, 14 figures", "summary": "In control problems and basic scientific modeling, it is important to compare\nobservations with dynamical simulations. For example, comparing two neural\nsystems can shed light on the nature of emergent computations in the brain and\ndeep neural networks. Recently, Ostrow et al. (2023) introduced Dynamical\nSimilarity Analysis (DSA), a method to measure the similarity of two systems\nbased on their recurrent dynamics rather than geometry or topology. However,\nDSA does not consider how inputs affect the dynamics, meaning that two similar\nsystems, if driven differently, may be classified as different. Because\nreal-world dynamical systems are rarely autonomous, it is important to account\nfor the effects of input drive. To this end, we introduce a novel metric for\ncomparing both intrinsic (recurrent) and input-driven dynamics, called InputDSA\n(iDSA). InputDSA extends the DSA framework by estimating and comparing both\ninput and intrinsic dynamic operators using a variant of Dynamic Mode\nDecomposition with control (DMDc) based on subspace identification. We\ndemonstrate that InputDSA can successfully compare partially observed,\ninput-driven systems from noisy data. We show that when the true inputs are\nunknown, surrogate inputs can be substituted without a major deterioration in\nsimilarity estimates. We apply InputDSA on Recurrent Neural Networks (RNNs)\ntrained with Deep Reinforcement Learning, identifying that high-performing\nnetworks are dynamically similar to one another, while low-performing networks\nare more diverse. Lastly, we apply InputDSA to neural data recorded from rats\nperforming a cognitive task, demonstrating that it identifies a transition from\ninput-driven evidence accumulation to intrinsically-driven decision-making. Our\nwork demonstrates that InputDSA is a robust and efficient method for comparing\nintrinsic dynamics and the effect of external input on dynamical systems."}
