{"id": "2506.12986", "pdf": "https://arxiv.org/pdf/2506.12986", "abs": "https://arxiv.org/abs/2506.12986", "authors": ["Siying Yang", "Neng Huang", "Heng Li"], "title": "Improving spliced alignment by modeling splice sites with deep learning", "categories": ["q-bio.GN"], "comment": null, "summary": "Motivation: Spliced alignment refers to the alignment of messenger RNA (mRNA)\nor protein sequences to eukaryotic genomes. It plays a critical role in gene\nannotation and the study of gene functions. Accurate spliced alignment demands\nsophisticated modeling of splice sites, but current aligners use simple models,\nwhich may affect their accuracy given dissimilar sequences.\n  Results: We implemented minisplice to learn splice signals with a\none-dimensional convolutional neural network (1D-CNN) and trained a model with\n7,026 parameters for vertebrate and insect genomes. It captures conserved\nsplice signals across phyla and reveals GC-rich introns specific to mammals and\nbirds. We used this model to estimate the empirical splicing probability for\nevery GT and AG in genomes, and modified minimap2 and miniprot to leverage\npre-computed splicing probability during alignment. Evaluation on human\nlong-read RNA-seq data and cross-species protein datasets showed our method\ngreatly improves the junction accuracy especially for noisy long RNA-seq reads\nand proteins of distant homology.\n  Availability and implementation: https://github.com/lh3/minisplice"}
{"id": "2506.13119", "pdf": "https://arxiv.org/pdf/2506.13119", "abs": "https://arxiv.org/abs/2506.13119", "authors": ["Kamilia Zaripova", "Ege Özsoy", "Nassir Navab", "Azade Farshad"], "title": "PhenoKG: Knowledge Graph-Driven Gene Discovery and Patient Insights from Phenotypes Alone", "categories": ["cs.LG", "cs.AI", "cs.NE", "q-bio.GN", "q-bio.QM", "92C50, 68T05", "I.2.6; H.2.8; J.3"], "comment": null, "summary": "Identifying causative genes from patient phenotypes remains a significant\nchallenge in precision medicine, with important implications for the diagnosis\nand treatment of genetic disorders. We propose a novel graph-based approach for\npredicting causative genes from patient phenotypes, with or without an\navailable list of candidate genes, by integrating a rare disease knowledge\ngraph (KG). Our model, combining graph neural networks and transformers,\nachieves substantial improvements over the current state-of-the-art. On the\nreal-world MyGene2 dataset, it attains a mean reciprocal rank (MRR) of 24.64\\%\nand nDCG@100 of 33.64\\%, surpassing the best baseline (SHEPHERD) at 19.02\\% MRR\nand 30.54\\% nDCG@100. We perform extensive ablation studies to validate the\ncontribution of each model component. Notably, the approach generalizes to\ncases where only phenotypic data are available, addressing key challenges in\nclinical decision support when genomic information is incomplete."}
{"id": "2506.13344", "pdf": "https://arxiv.org/pdf/2506.13344", "abs": "https://arxiv.org/abs/2506.13344", "authors": ["Lorenzo Bini", "Stephane Marchand-Maillet"], "title": "LapDDPM: A Conditional Graph Diffusion Model for scRNA-seq Generation with Spectral Adversarial Perturbations", "categories": ["cs.LG", "cs.AI", "q-bio.BM", "q-bio.CB", "q-bio.GN"], "comment": "LapDDPM is a novel conditional graph diffusion model for scRNA-seq\n  generation. Leveraging spectral adversarial perturbations, it ensures\n  robustness and yields high-fidelity, biologically plausible, and\n  cell-type-specific samples for complex data. Proceedings of the ICML 2025\n  GenBio Workshop: The 2nd Workshop on Generative AI and Biology, Vancouver,\n  Canada, 2025", "summary": "Generating high-fidelity and biologically plausible synthetic single-cell RNA\nsequencing (scRNA-seq) data, especially with conditional control, is\nchallenging due to its high dimensionality, sparsity, and complex biological\nvariations. Existing generative models often struggle to capture these unique\ncharacteristics and ensure robustness to structural noise in cellular networks.\nWe introduce LapDDPM, a novel conditional Graph Diffusion Probabilistic Model\nfor robust and high-fidelity scRNA-seq generation. LapDDPM uniquely integrates\ngraph-based representations with a score-based diffusion model, enhanced by a\nnovel spectral adversarial perturbation mechanism on graph edge weights. Our\ncontributions are threefold: we leverage Laplacian Positional Encodings (LPEs)\nto enrich the latent space with crucial cellular relationship information; we\ndevelop a conditional score-based diffusion model for effective learning and\ngeneration from complex scRNA-seq distributions; and we employ a unique\nspectral adversarial training scheme on graph edge weights, boosting robustness\nagainst structural variations. Extensive experiments on diverse scRNA-seq\ndatasets demonstrate LapDDPM's superior performance, achieving high fidelity\nand generating biologically-plausible, cell-type-specific samples. LapDDPM sets\na new benchmark for conditional scRNA-seq data generation, offering a robust\ntool for various downstream biological applications."}
{"id": "2506.12209", "pdf": "https://arxiv.org/pdf/2506.12209", "abs": "https://arxiv.org/abs/2506.12209", "authors": ["Hannah G. Scanlon", "Gibarni Mahata", "Anna C. Nelson", "Scott A. McKinley", "Melissa M. Rolls", "Maria-Veronica Ciocanel"], "title": "Nucleation feedback can drive establishment and maintenance of biased microtubule polarity in neurites", "categories": ["q-bio.QM", "q-bio.SC"], "comment": "36 pages, 10 figures", "summary": "The microtubule cytoskeleton is comprised of dynamic, polarized filaments\nthat facilitate transport within the cell. Polarized microtubule arrays are key\nto facilitating cargo transport in long cells such as neurons. Microtubules\nalso undergo dynamic instability, where the plus and minus ends of the\nfilaments switch between growth and shrinking phases, leading to frequent\nmicrotubule turnover. Although microtubules often completely disassemble and\nnew filaments nucleate, microtubule arrays have been observed to both maintain\ntheir biased orientation throughout the cell lifetime and to rearrange their\npolarity as an adaptive response to injury. Motivated by cytoskeleton\norganization in neurites, we propose a spatially-explicit stochastic model of\nmicrotubule arrays and investigate how nucleation of new filaments could\ngenerate biased polarity in a simple linear domain. Using a continuous-time\nMarkov chain model of microtubule growth dynamics, we model and parameterize\ntwo experimentally-validated nucleation mechanisms: nucleation feedback, where\nthe direction of filament growth depends on existing microtubule content, and a\ncheckpoint mechanism, where microtubules that nucleate in a direction opposite\nto the majority experience frequent catastrophe. When incorporating these\nvalidated mechanisms into the spatial model, we find that nucleation feedback\nis sufficient to establish biased polarity in neurites of different lengths,\nand that the emergence and maintenance of biased polarity is robust in spite of\nstochastic fluctuations. This work provides a framework to study the\nrelationship between microtubule nucleation and polarity, and could extend to\ngive insights into mechanisms that drive the formation of polarized filament\narrays in other biological settings."}
{"id": "2506.12056", "pdf": "https://arxiv.org/pdf/2506.12056", "abs": "https://arxiv.org/abs/2506.12056", "authors": ["Renlei Jiang", "Yuzhen Fan", "Di Fan", "Chuanhou Gao", "Denis Dochain"], "title": "Input-to-state stability-based chemical reaction networks composition for molecular computations", "categories": ["q-bio.MN"], "comment": null, "summary": "Molecular computation based on chemical reaction networks (CRNs) has emerged\nas a promising paradigm for designing programmable biochemical systems.\nHowever, the implementation of complex computations still requires excessively\nlarge and intricate network structures, largely due to the limited\nunderstanding of composability, that is, how multiple subsystems can be coupled\nwhile preserving computational functionality. Existing composability frameworks\nprimarily focus on rate-independent CRNs, whose computational capabilities are\nseverely restricted. This article aims to establish a systematic framework for\ncomposable CRNs governed by mass-action kinetics, a common type of\nrate-dependent CRNs. Drawing upon the concepts of composable rate-independent\nCRNs, we introduce the notions of mass-action chemical reaction computers\n(msCRCs), dynamic computation and dynamic composability to establish a rigorous\nmathematical framework for composing two or more msCRCs to achieve\nlayer-by-layer computation of composite functions. Further, we derive several\nsufficient conditions based on the notions of input-to-state stability (ISS) to\ncharacterize msCRCs that can be composed to implement desired molecular\ncomputations, thereby providing theoretical support for this framework. Some\nexamples are presented to illustrate the efficiency of our method. Finally,\ncomparative results demonstrate that the proposed method exhibits notable\nadvantages in both computational ability and accuracy over the state-of-the-art\nmethods."}
{"id": "2506.12277", "pdf": "https://arxiv.org/pdf/2506.12277", "abs": "https://arxiv.org/abs/2506.12277", "authors": ["Elvire Roblin", "Paul-Henry Cournède", "Stefan Michiels"], "title": "Evaluation of machine-learning models to measure individualized treatment effects from randomized clinical trial data with time-to-event outcomes", "categories": ["q-bio.QM"], "comment": "19 pages, 6 figures", "summary": "In randomized clinical trials, regression models can be used to explore the\nrelationships between patients' variables (e.g., clinical, pathological or\nlifestyle variables, and also biomarker or genomics data) and the magnitude of\ntreatment effect. Our aim is to evaluate the value of flexible machine learning\nmodels that can incorporate interactions and nonlinear effects of\nhigh-dimensional data to estimate individualized treatment recommendations in\nthe setting of such trials with time-to-event outcomes. We compare survival\nmodels based on neural networks (CoxCC and CoxTime) and random survival forests\n(Interaction Forests). A Cox model, including an adaptive LASSO penalty, is\nused as a benchmark. Specific metrics for individualized treatment\nrecommendations are used: the C-for-Benefit, the E50-for-Benefit, and RMSE for\ntreatment benefit. We conduct an extensive simulation study using 2 different\ndata generation processes incorporating nonlinearity and interactions up to the\nthird order. The models are applied to gene expression and clinical data from 2\nbreast cancer studies. The machine learning-based methods show reasonable\nperformances on the simulation data sets, especially in terms of discrimination\nfor Interaction Forests and calibration for the neural networks. They can be\nused to evaluate individualized treatment effects from randomized trials when\nnonlinear and interaction effects are expected to be present."}
{"id": "2506.12107", "pdf": "https://arxiv.org/pdf/2506.12107", "abs": "https://arxiv.org/abs/2506.12107", "authors": ["Dingfan Zhang", "Congshu Huang", "Lei Zhou", "Boyang Wang", "Wei Zhou", "Tiantian Xia", "Pan Shen", "Shao Li", "Yue Gao"], "title": "Network Pharmacology Reveals HSPA1A/BST2 as Potential Targets of Ci Bai Capsule's Active Compounds Intervening in Leukopenia", "categories": ["q-bio.MN"], "comment": null, "summary": "Background: Radiation-induced leukopenia caused by low-dose exposure is\nfrequently associated with Traditional Chinese Medicine (TCM) syndromes like\n\"blood deficiency\" and \"fatigue syndrome\". Ci Bai Capsule (CB) has been\nreported to enhance white blood cell levels; however, its mechanisms and\nbioactive compounds remain unclear.Aim: This study aimed to identify the\nbioactive compounds group of CB and elucidate its potential mechanisms in\nradiation-induced leukopenia.Methods: Syndrome-related data were gathered from\nSYMMAP and CTD database. CB's target profile is predicted by DrugCIPHER.\nNetwork pharmacology approaches were employed to identify active compounds and\nrelated pathways. Experimental validation was conducted through flow cytometry\nand RNA-sequencing in both ex vivo and in vivo models.Results: A total of 22\npathways related to cellular processes, immune responses, and signal\ntransduction were identified. Five key bioactive compounds\n(kaempferol-3-glucorhamnoside, syringin, schisandrin, 3-hydroxytyrosol\n3-O-glucoside and salidroside) were found to significantly modulate\nsyndrome-related pathways. Optimal dosing of this compound combination enhanced\nleukocyte counts and splenic immune cell proliferation in irradiated mice.\nTranscriptomic analysis revealed that the compounds exert regulatory effects on\nPP1A, RB, CDK4/6, CDK2, and CDK1, thereby modulating downstream immune and\nhematopoietic markers such as MNDA, BST2, and HSPA1A.Conclusion: Our findings\nsuggest that CB mitigates radiation-induced leukopenia by enhancing immune and\nhematopoietic recovery, offering a promising therapeutic approach for managing\nradiation-related hematological disorders."}
{"id": "2506.12567", "pdf": "https://arxiv.org/pdf/2506.12567", "abs": "https://arxiv.org/abs/2506.12567", "authors": ["Dandan Wang", "Xiaoyan Chen", "Jingxiang Lin", "Teng Zhang", "Lianyi Huang", "Dongliang Leng", "Xiaohua Douglas Zhang", "Gang Li"], "title": "Maximal Speed of Glucose Change Significantly Distinguishes Prediabetes from Diabetes", "categories": ["q-bio.QM"], "comment": null, "summary": "Rapid changes in blood glucose levels can have severe and immediate health\nconsequences, leading to the need to develop indices for assessing these rapid\nchanges based on continuous glucose monitoring (CGM) data. We proposed a CGM\nindex, maxSpeed, that represents the maximum of speed of glucose change (SGC)\nin a subject, respectively, and conducted a clinical study to investigate this\nindex along with SGC mean (meanSpeed) and SGC standard deviation (sdSpeed),\ncoefficient of variation (CV), standard deviation (SD), glycemic variability\npercentage (GVP), mean amplitude of glycemic excursions (MAG), mean absolute\nglucose excursion (MAGE), mean of daily differences (MODD) and continuous\noverlapping net glycemic action (CONGA). Our study revealed that, there exist\nmultiple patterns in distinguishing non-diabetes, prediabetes, type 1 diabetes\n(T1D) and type 2 diabetes (T2D). First, maxSpeed significantly distinguishes\nbetween either of non-diabetes and prediabetes and either of T1D and T2D.\nSecond, meanSpeed, sdSpeed, GVP and MAG significantly distinguish between\nnon-diabetes and either of T1D and T2D. Third, MODD and CONGA of 24 hours\nsignificantly distinguish between non-diabetes and either of T1D and T2D,\nbetween T1D and either of prediabetes and T2D. Fourth, SD, MAGE and CONGA of 12\nhours significantly distinguish between non-diabetes and either of T1D and T2D,\nbetween T1D and pre-diabetes. Fifth, CV significantly distinguishes between T1D\nand either of Non-diabetes and T2D. maxSpeed assesses the rapid change of\nglucose in a short term, which is important both biologically and clinicially\nbecause our human body may not tolerate too rapid change in a short term."}
{"id": "2506.12310", "pdf": "https://arxiv.org/pdf/2506.12310", "abs": "https://arxiv.org/abs/2506.12310", "authors": ["Venkata Sai Narayana Bavisetty", "Matthew Wheeler", "Reinhard Laubenbacher", "Claus Kadelka"], "title": "Upper bound for the stability of Boolean networks", "categories": ["q-bio.MN", "nlin.CG", "physics.bio-ph"], "comment": null, "summary": "Boolean networks, inspired by gene regulatory networks, were developed to\nunderstand the complex behaviors observed in biological systems, with network\nattractors corresponding to biological phenotypes or cell types. In this\narticle, we present a proof for a conjecture by Williadsen, Triesch and Wiles\nabout upper bounds for the stability of basins of attraction in Boolean\nnetworks. We further extend this result from a single basin of attraction to\nthe entire network. Specifically, we demonstrate that the asymptotic upper\nbound for the robustness and the basin entropy of a Boolean network are\nnegatively linearly related."}
{"id": "2506.12177", "pdf": "https://arxiv.org/pdf/2506.12177", "abs": "https://arxiv.org/abs/2506.12177", "authors": ["Haley Colgate Kottler", "Amy Cochran"], "title": "A simplified and robust proxy-based approach for overcoming unmeasured confounding in EHR studies", "categories": ["stat.ME", "q-bio.QM", "stat.AP"], "comment": null, "summary": "Electronic health records (EHR) are used to study treatment effects in\nclinical settings, yet unmeasured confounding remains a persistent challenge.\nIndirect measurements of the unmeasured confounder (proxies) offer a potential\nsolution, but existing approaches -- such as proximal inference or full joint\nmodeling -- can be difficult to implement. We propose a two-stage, proxy-based\nmethod that is practical, broadly applicable, and robust. In the first stage,\nwe apply factor analysis to proxy and treatment variables, extracting\ninformation on latent factors that serve as a surrogate for the unmeasured\nconfounder. In the second stage, we use this model to build covariates that\nimprove causal effect estimation in a standard outcome regression model.\nThrough simulations, we test the method's performance under assumption\nviolations, including non-normal errors, model misspecification, and scenarios\nwhere instruments or confounders are incorrectly treated as proxies. We also\napply the method to estimate the effect of hospital admission for older adults\npresenting to the emergency department with chest pain, a setting where\nstandard analyses may fail to recover plausible effects. Our results show that\nthis simplified strategy recovers more reliable estimates than conventional\nadjustment methods, offering applied researchers a practical tool for\naddressing unmeasured confounding with proxy variables."}
{"id": "2506.13115", "pdf": "https://arxiv.org/pdf/2506.13115", "abs": "https://arxiv.org/abs/2506.13115", "authors": ["N. R. M. Nelumdeniya", "R. J. K. U. Ranatunga"], "title": "Complex forming behaviour of α, \\b{eta} and γ-cyclodextrins with varying size probe particles in silico", "categories": ["q-bio.MN"], "comment": null, "summary": "Cyclodextrins (CDs) are cyclic oligosaccharides composed of glucopyranose\nunits bonded together to form a truncated cone that can make inclusion\ncomplexes with guest molecules. The {\\alpha}, \\b{eta}, and {\\gamma}-CDs, which\nrespectively comprise six, seven or eight glucopyranose units, are used\nextensively in pharmaceutical formulations as functional excipients. The cavity\nsizes of all three natural CDs have been approximated using static structures\nbut a growing consensus is that the CDs are flexible; moreover, the size range\nof molecules that CDs can accommodate has not been systematically studied. Here\nthe results of molecular dynamics simulations performed using spherical\ncontinuum probe particles of different sizes to observe the complex-forming\nbehaviour of CDs are presented. Results revealed that CDs can make dynamic\ncomplexes with guest molecules that are larger than their reported cavity\nsizes."}
{"id": "2506.12439", "pdf": "https://arxiv.org/pdf/2506.12439", "abs": "https://arxiv.org/abs/2506.12439", "authors": ["Jesus de la Fuente", "Robert Lehmann", "Carlos Ruiz-Arenas", "Jan Voges", "Irene Marin-Goñi", "Xabier Martinez-de-Morentin", "David Gomez-Cabrero", "Idoia Ochoa", "Jesper Tegner", "Vincenzo Lagani", "Mikel Hernaez"], "title": "Interpretable Causal Representation Learning for Biological Data in the Pathway Space", "categories": ["cs.LG", "q-bio.QM", "stat.ML"], "comment": "ICLR 2025, 28 pages, 14 figures, 10 tables", "summary": "Predicting the impact of genomic and drug perturbations in cellular function\nis crucial for understanding gene functions and drug effects, ultimately\nleading to improved therapies. To this end, Causal Representation Learning\n(CRL) constitutes one of the most promising approaches, as it aims to identify\nthe latent factors that causally govern biological systems, thus facilitating\nthe prediction of the effect of unseen perturbations. Yet, current CRL methods\nfail in reconciling their principled latent representations with known\nbiological processes, leading to models that are not interpretable. To address\nthis major issue, we present SENA-discrepancy-VAE, a model based on the\nrecently proposed CRL method discrepancy-VAE, that produces representations\nwhere each latent factor can be interpreted as the (linear) combination of the\nactivity of a (learned) set of biological processes. To this extent, we present\nan encoder, SENA-{\\delta}, that efficiently compute and map biological\nprocesses' activity levels to the latent causal factors. We show that\nSENA-discrepancy-VAE achieves predictive performances on unseen combinations of\ninterventions that are comparable with its original, non-interpretable\ncounterpart, while inferring causal latent factors that are biologically\nmeaningful."}
{"id": "2506.12163", "pdf": "https://arxiv.org/pdf/2506.12163", "abs": "https://arxiv.org/abs/2506.12163", "authors": ["Andrea Agazzi", "Lucie Laurence"], "title": "Noise-induced stabilization in a chemical reaction network without boundary effects", "categories": ["math.PR", "q-bio.MN"], "comment": "22 pages, 1 figure", "summary": "We present a chemical reaction network that is unstable under deterministic\nmass action kinetics, exhibiting finite-time blow-up of trajectories in the\ninterior of the state space, but whose stochastic counterpart is positive\nrecurrent. This provides an example of noise-induced stabilization of the\nmodel's dynamics arising due to noise perturbing transversally the divergent\ntrajectories of the system that is independently of boundary effects. The proof\nis based on a careful decomposition of the state space and the construction of\nsuitable Lyapunov functions in each region."}
{"id": "2506.12683", "pdf": "https://arxiv.org/pdf/2506.12683", "abs": "https://arxiv.org/abs/2506.12683", "authors": ["Samarth Singhal", "Sandeep Singhal"], "title": "Evaluating Cell Type Inference in Vision Language Models Under Varying Visual Context", "categories": ["cs.CV", "q-bio.QM"], "comment": null, "summary": "Vision-Language Models (VLMs) have rapidly advanced alongside Large Language\nModels (LLMs). This study evaluates the capabilities of prominent generative\nVLMs, such as GPT-4.1 and Gemini 2.5 Pro, accessed via APIs, for histopathology\nimage classification tasks, including cell typing. Using diverse datasets from\npublic and private sources, we apply zero-shot and one-shot prompting methods\nto assess VLM performance, comparing them against custom-trained Convolutional\nNeural Networks (CNNs). Our findings demonstrate that while one-shot prompting\nsignificantly improves VLM performance over zero-shot ($p \\approx 1.005 \\times\n10^{-5}$ based on Kappa scores), these general-purpose VLMs currently\nunderperform supervised CNNs on most tasks. This work underscores both the\npromise and limitations of applying current VLMs to specialized domains like\npathology via in-context learning. All code and instructions for reproducing\nthe study can be accessed from the repository\nhttps://www.github.com/a12dongithub/VLMCCE."}
{"id": "2506.13119", "pdf": "https://arxiv.org/pdf/2506.13119", "abs": "https://arxiv.org/abs/2506.13119", "authors": ["Kamilia Zaripova", "Ege Özsoy", "Nassir Navab", "Azade Farshad"], "title": "PhenoKG: Knowledge Graph-Driven Gene Discovery and Patient Insights from Phenotypes Alone", "categories": ["cs.LG", "cs.AI", "cs.NE", "q-bio.GN", "q-bio.QM", "92C50, 68T05", "I.2.6; H.2.8; J.3"], "comment": null, "summary": "Identifying causative genes from patient phenotypes remains a significant\nchallenge in precision medicine, with important implications for the diagnosis\nand treatment of genetic disorders. We propose a novel graph-based approach for\npredicting causative genes from patient phenotypes, with or without an\navailable list of candidate genes, by integrating a rare disease knowledge\ngraph (KG). Our model, combining graph neural networks and transformers,\nachieves substantial improvements over the current state-of-the-art. On the\nreal-world MyGene2 dataset, it attains a mean reciprocal rank (MRR) of 24.64\\%\nand nDCG@100 of 33.64\\%, surpassing the best baseline (SHEPHERD) at 19.02\\% MRR\nand 30.54\\% nDCG@100. We perform extensive ablation studies to validate the\ncontribution of each model component. Notably, the approach generalizes to\ncases where only phenotypic data are available, addressing key challenges in\nclinical decision support when genomic information is incomplete."}
{"id": "2506.13204", "pdf": "https://arxiv.org/pdf/2506.13204", "abs": "https://arxiv.org/abs/2506.13204", "authors": ["Masaki Watabe", "Joe Sakamoto", "Hideaki Yoshimura", "Tomomi Nemoto", "Kazunari Kaizu"], "title": "Optical turbulence retrieval of heterogeneous media", "categories": ["physics.optics", "q-bio.QM"], "comment": "6 pages, 3 figures in main text; 14 pages, 9 figures in the\n  supplemental material", "summary": "Although the transport of intensity equation (TIE) can be used to reconstruct\nthe spatial phase variations produced by samples such as magnetic materials and\nbiological cells, the impact of complex refractive indices on quantitative\nphase imaging remains unexplored. To overcome this difficulty, we provide\nherein a more physically generalized TIE framework that enables the\nreconstruction of spatial variations in both refractive-index fluctuations and\nattenuation coefficients. We then demonstrate this method using bright-field\nmicroscopy imaging. The results reveal robust performance in retrieving\nheterogeneous optical structures within measurable parameter regions. Finally,\nwe analyze the symmetry of the attenuation reversal in the TIE framework, thus\nrevealing the invariant nature of the absorptive and scattering properties in\nthe samples of interest."}
{"id": "2506.13615", "pdf": "https://arxiv.org/pdf/2506.13615", "abs": "https://arxiv.org/abs/2506.13615", "authors": ["Bulat Batuev", "Arsenii Onuchin", "Sergey Sukhov"], "title": "Effective Stimulus Propagation in Neural Circuits: Driver Node Selection", "categories": ["q-bio.NC", "cs.NE", "q-bio.QM"], "comment": null, "summary": "Precise control of signal propagation in modular neural networks represents a\nfundamental challenge in computational neuroscience. We establish a framework\nfor identifying optimal control nodes that maximize stimulus transmission\nbetween weakly coupled neural populations. Using spiking stochastic block model\nnetworks, we systematically compare driver node selection strategies -\nincluding random sampling and topology-based centrality measures (degree,\nbetweenness, closeness, eigenvector, harmonic, and percolation centrality) - to\ndetermine minimal control inputs for achieving inter-population\nsynchronization.\n  Targeted stimulation of just 10-20% of the most central neurons in the source\npopulation significantly enhances spiking propagation fidelity compared to\nrandom selection. This approach yields a 2.7-fold increase in signal transfer\nefficiency at critical inter-module connection densities p_inter = 0.04-0.07.\nThese findings establish a theoretical foundation for precision neuromodulation\nin biological neural systems and neurotechnology applications."}
{"id": "2506.13649", "pdf": "https://arxiv.org/pdf/2506.13649", "abs": "https://arxiv.org/abs/2506.13649", "authors": ["Sara Si-Moussi", "Stephan Hennekens", "Sander Mücher", "Wanda De Keersmaecker", "Milan Chytrý", "Emiliano Agrillo", "Fabio Attorre", "Idoia Biurrun", "Gianmaria Bonari", "Andraž Čarni", "Renata Ćušterevska", "Tetiana Dziuba", "Klaus Ecker", "Behlül Güler", "Ute Jandt", "Borja Jiménez-Alfaro", "Jonathan Lenoir", "Jens-Christian Svenning", "Grzegorz Swacha", "Wilfried Thuiller"], "title": "EUNIS Habitat Maps: Enhancing Thematic and Spatial Resolution for Europe through Machine Learning", "categories": ["stat.AP", "cs.LG", "physics.geo-ph", "q-bio.QM", "62P12, 62M30, 92D40", "I.2.6; J.3; I.6.5"], "comment": null, "summary": "The EUNIS habitat classification is crucial for categorising European\nhabitats, supporting European policy on nature conservation and implementing\nthe Nature Restoration Law. To meet the growing demand for detailed and\naccurate habitat information, we provide spatial predictions for 260 EUNIS\nhabitat types at hierarchical level 3, together with independent validation and\nuncertainty analyses.\n  Using ensemble machine learning models, together with high-resolution\nsatellite imagery and ecologically meaningful climatic, topographic and edaphic\nvariables, we produced a European habitat map indicating the most probable\nEUNIS habitat at 100-m resolution across Europe. Additionally, we provide\ninformation on prediction uncertainty and the most probable habitats at level 3\nwithin each EUNIS level 1 formation. This product is particularly useful for\nboth conservation and restoration purposes.\n  Predictions were cross-validated at European scale using a spatial block\ncross-validation and evaluated against independent data from France (forests\nonly), the Netherlands and Austria. The habitat maps obtained strong predictive\nperformances on the validation datasets with distinct trade-offs in terms of\nrecall and precision across habitat formations."}
