{"id": "2510.12840", "pdf": "https://arxiv.org/pdf/2510.12840", "abs": "https://arxiv.org/abs/2510.12840", "authors": ["Zhentao Liu", "Arun Das", "Wen Meng", "Yu-Chiao Chiu", "Shou-Jiang Gao", "Yufei Huang"], "title": "ST2HE: A Cross-Platform Framework for Virtual Histology and Annotation of High-Resolution Spatial Transcriptomics Data", "categories": ["q-bio.QM"], "comment": "36 pages, 5 figures, 1 table", "summary": "High-resolution spatial transcriptomics (HR-ST) technologies offer\nunprecedented insights into tissue architecture but lack standardized\nframeworks for histological annotation. We present ST2HE, a cross-platform\ngenerative framework that synthesizes virtual hematoxylin and eosin (H&E)\nimages directly from HR-ST data. ST2HE integrates nuclei morphology and spatial\ntranscript coordinates using a one-step diffusion model, enabling\nhistologically faithful image generation across diverse tissue types and HR-ST\nplatforms. Conditional and tissue-independent variants support both known and\nnovel tissue contexts. Evaluations on breast cancer, non-small cell lung\ncancer, and Kaposi's sarcoma demonstrate ST2HE's ability to preserve\nmorphological features and support downstream annotations of tissue histology\nand phenotype classification. Ablation studies reveal that larger context\nwindows, balanced loss functions, and multi-colored transcript visualization\nenhance image fidelity. ST2HE bridges molecular and histological domains,\nenabling interpretable, scalable annotation of HR-ST data and advancing\ncomputational pathology."}
{"id": "2510.12842", "pdf": "https://arxiv.org/pdf/2510.12842", "abs": "https://arxiv.org/abs/2510.12842", "authors": ["Bo Qiang", "Chengyue Gong", "Xinshi Chen", "Yuxuan Zhang", "Wenzhi Xiao"], "title": "Protenix-Mini+: efficient structure prediction model with scalable pairformer", "categories": ["q-bio.QM", "cs.LG"], "comment": null, "summary": "Lightweight inference is critical for biomolecular structure prediction and\ndownstream tasks, enabling efficient real-world deployment and inference-time\nscaling for large-scale applications. While AF3 and its variants (e.g.,\nProtenix, Chai-1) have advanced structure prediction results, they suffer from\ncritical limitations: high inference latency and cubic time complexity with\nrespect to token count, both of which restrict scalability for large\nbiomolecular complexes. To address the core challenge of balancing model\nefficiency and prediction accuracy, we introduce three key innovations: (1)\ncompressing non-scalable operations to mitigate cubic time complexity, (2)\nremoving redundant blocks across modules to reduce unnecessary overhead, and\n(3) adopting a few-step sampler for the atom diffusion module to accelerate\ninference. Building on these design principles, we develop Protenix-Mini+, a\nhighly lightweight and scalable variant of the Protenix model. Within an\nacceptable range of performance degradation, it substantially improves\ncomputational efficiency. For example, in the case of low-homology single-chain\nproteins, Protenix-Mini+ experiences an intra-protein LDDT drop of\napproximately 3% relative to the full Protenix model -- an acceptable\nperformance trade-off given its substantially 90%+ improved computational\nefficiency."}
{"id": "2510.13118", "pdf": "https://arxiv.org/pdf/2510.13118", "abs": "https://arxiv.org/abs/2510.13118", "authors": ["Shizhuo Li", "Unay Dorken Gallastegi", "Shohei Fujita", "Yuting Chen", "Pengcheng Xu", "Yangsean Choi", "Borjan Gagoski", "Huihui Ye", "Huafeng Liu", "Berkin Bilgic", "Yohan Jun"], "title": "Omni-QALAS: Optimized Multiparametric Imaging for Simultaneous T1, T2 and Myelin Water Mapping", "categories": ["q-bio.QM"], "comment": null, "summary": "Purpose: To improve the accuracy of multiparametric estimation, including\nmyelin water fraction (MWF) quantification, and reduce scan time in 3D-QALAS by\noptimizing sequence parameters, using a self-supervised multilayer perceptron\nnetwork. Methods: We jointly optimize flip angles, T2 preparation durations,\nand sequence gaps for T1 recovery using a self-supervised MLP trained to\nminimize a Cramer-Rao bound-based loss function, with explicit constraints on\ntotal scan time. The optimization targets white matter, gray matter, and myelin\nwater tissues, and its performance was validated through simulation, phantom,\nand in vivo experiments. Results: Building on our previously proposed MWF-QALAS\nmethod for simultaneous MWF, T1, and T2 mapping, the optimized sequence reduces\nthe number of readouts from six to five and achieves a scan time nearly one\nminute shorter, while also yielding higher T1 and T2 accuracy and improved MWF\nmaps. This sequence enables simultaneous multiparametric quantification,\nincluding MWF, at 1 mm isotropic resolution within 3 minutes and 30 seconds.\nConclusion: This study demonstrated that optimizing sequence parameters using a\nself-supervised MLP network improved T1, T2 and MWF estimation accuracy, while\nreducing scan time."}
{"id": "2510.13520", "pdf": "https://arxiv.org/pdf/2510.13520", "abs": "https://arxiv.org/abs/2510.13520", "authors": ["Mirco Castoldi"], "title": "qLOOK: A Minimal Information System for Digital Storage and Reproducible Analysis of qPCR experiments", "categories": ["q-bio.QM"], "comment": "10 pages, 3 figures", "summary": "Objective: Quantitative real-time PCR is widely used for gene expression\nanalysis, yet inconsistencies in data storage and reporting limit\nreproducibility. While MIQE guidelines define the minimal information required\nfor publication, they do not specify structured digital storage formats\ncompatible with long-term reanalysis. This work presents qLOOK (qPCR-LOg-boOK),\na tool for standardized digital storage and reproducible analysis of qPCR\nexperiments. Results: qLOOK is a modular R-based system that extracts data from\nThermo Fisher/ABI .EDS files, formats it into a structured table\n(qLOOK_Data.xlsx), performs normalization and statistical analysis, and\ngenerates a log file (qLOOK_Summary.txt) recording reference genes,\ncalibrators, and analytical parameters. All required R libraries are\nautomatically installed and loaded, allowing researchers without coding\nexperience to use the scripts. By preserving the qLOOK_Data table and the\nqLOOK_Summary log, users can reproduce or extend analyses without reprocessing\nraw files. While currently limited to .EDS files, the modular design allows\nadaptation to additional qPCR formats in the future. Besides providing an easy\nand transparent approach to analyze qPCR experiments, qLOOK also provides a\nminimal, standardized, and transparent solution for digital documentation,\nenhancing reproducibility, supporting long-term data stewardship, and\nfacilitating integration into electronic laboratory notebooks or publication\nsupplementary material."}
{"id": "2510.12976", "pdf": "https://arxiv.org/pdf/2510.12976", "abs": "https://arxiv.org/abs/2510.12976", "authors": ["Luc Blassel", "Bastien Boussau", "Nicolas Lartillot", "Laurent Jacob"], "title": "Likelihood-free inference of phylogenetic tree posterior distributions", "categories": ["q-bio.PE", "q-bio.QM"], "comment": "13 Pages, 2 figures", "summary": "Phylogenetic inference, the task of reconstructing how related sequences\nevolved from common ancestors, is a central task in evolutionary genomics. The\ncurrent state-of-the-art methods exploit probabilistic models of sequence\nevolution along phylogenetic trees, by searching for the tree maximizing the\nlikelihood of observed sequences, or by estimating the posterior of the tree\ngiven the sequences in a Bayesian framework. Both approaches typically require\nto compute likelihoods, which is only feasible under simplifying assumptions\nsuch as independence of the evolution at the different positions of the\nsequence, and even then remains a costly operation. Here we present Phyloformer\n2, the first likelihood-free inference method for posterior distributions over\nphylogenies. Phyloformer 2 exploits a novel encoding for pairs of sequences\nthat makes it more scalable than previous approaches, and a parameterized\nprobability distribution factorized over a succession of subtree merges. The\nresulting network provides accurate estimates of the posterior distribution,\nand outperforms both state-of-the-art maximum likelihood methods and a previous\nlikelihood-free method for point estimation. It opens the way to fast and\naccurate phylogenetic inference under realistic models of sequence evolution."}
{"id": "2510.13018", "pdf": "https://arxiv.org/pdf/2510.13018", "abs": "https://arxiv.org/abs/2510.13018", "authors": ["Francis Boabang", "Samuel Asante Gyamerah"], "title": "Escaping Local Optima in the Waddington Landscape: A Multi-Stage TRPO-PPO Approach for Single-Cell Perturbation Analysis", "categories": ["cs.LG", "q-bio.QM"], "comment": "9 pages, 2 figures, 3 tables", "summary": "Modeling cellular responses to genetic and chemical perturbations remains a\ncentral challenge in single-cell biology. Existing data-driven framework have\nadvanced perturbation prediction through variational autoencoders, chemically\nconditioned autoencoders, and large-scale transformer pretraining. However,\nthese models are prone to local optima in the nonconvex Waddington landscape of\ncell fate decisions, where poor initialization can trap trajectories in\nspurious lineages or implausible differentiation outcomes. While executable\ngene regulatory networks complement these approaches, automated design\nframeworks incorporate biological priors through multi-agent optimization. Yet,\nan approach that is completely data-driven with well-designed initialization to\nescape local optima and converge to a proper lineage remains elusive. In this\nwork, we introduce a multistage reinforcement learning algorithm tailored for\nsingle-cell perturbation modeling. We first compute an explicit natural\ngradient update using Fisher-vector products and a conjugate gradient solver,\nscaled by a KL trust-region constraint to provide a safe, curvature-aware the\nfirst step for the policy. Starting with these preconditioned parameters, we\nthen apply a second phase of proximal policy optimization (PPO) with clipped\nsurrogates, exploiting minibatch efficiency to refine the policy. We\ndemonstrate that this initialization substantially improves generalization on\nSingle-cell RNA sequencing (scRNA-seq) and Single-cell ATAC sequencing\n(scATAC-seq) pertubation analysis."}
{"id": "2510.13480", "pdf": "https://arxiv.org/pdf/2510.13480", "abs": "https://arxiv.org/abs/2510.13480", "authors": ["Rushna Quddus", "Kent Kirshenbaum", "David G. Grier"], "title": "A Quantitative Holographic Agglutination Assay for Immunoglobulin A", "categories": ["physics.optics", "physics.med-ph", "q-bio.QM"], "comment": "13 pages, 4 figures", "summary": "This study introduces a Holographic Agglutination Assay for quantifying\nlevels of the immunoglobulin protein IgA in biological samples. This is the\nfirst example of a label-free and bead-free assay that quantifies protein\nagglutinates by direct detection using Total Holographic Characterization. A\nproof-of-concept assay for human serum immunoglobulins is demonstrated using\nJacalin, the galactose-specific plant lectin, to induce selective\nagglutination.\n  By analyzing the size, refractive index, and number of particles in an assay\nsample, we obtain a reproducible and quantitative measurement of galactosylated\nimmunoglobulins in a given sample. The assay is calibrated for a\nphysiologically relevant reference interval of IgA concentrations in a 10x\ndiluted emulated biological sample from low (80 mg/dL, 5 {\\mu}M) to high (320\nmg/dL, 20 {\\mu}M) levels. The assay clearly distinguishes samples containing\nIgA from samples containing IgG.\n  More broadly, this study introduces a platform for creating lectin-mediated\nHolographic Agglutination Assays to monitor levels of immunoglobulins in\nbiological samples. The ability to quantify immunoglobulin levels efficiently\nin clinical samples is likely to be valuable for diagnostics and will provide a\nbasis for assaying other proteins that can be induced to agglutinate."}
{"id": "2510.13658", "pdf": "https://arxiv.org/pdf/2510.13658", "abs": "https://arxiv.org/abs/2510.13658", "authors": ["Haotian Feng", "Ke Sheng"], "title": "Spherical Radiomics - A Novel Approach to Glioblastoma Radiogenomic Analysis of Heterogeneity", "categories": ["physics.med-ph", "q-bio.QM"], "comment": null, "summary": "We develop and validate a novel spherical radiomics framework for predicting\nkey molecular biomarkers using multiparametric MRI. Conventional Cartesian\nradiomics extract tumor features on orthogonal grids, which do not fully\ncapture the tumor's radial growth patterns and can be insensitive to evolving\nmolecular signatures. In this study, we analyzed GBM radiomic features on\nconcentric 2D shells, which were then mapped onto 2D planes for radiomics\nanalysis. Radiomic features were extracted using PyRadiomics from four\ndifferent regions in GBM. Feature selection was performed using ANOVA\nF-statistics. Classification was conducted with multiple machine-learning\nmodels. Model interpretability was evaluated through SHAP analysis, clustering\nanalysis, feature significance profiling, and comparison between radiomic\npatterns and underlying biological processes. Spherical radiomics consistently\noutperformed conventional 2D and 3D Cartesian radiomics across all prediction\ntasks. The best framework reached an AUC of 0.85 for MGMT, 0.80 for EGFR, 0.80\nfor PTEN, and 0.83 for survival prediction. GLCM-derived features were\nidentified as the most informative predictors. Radial transition analysis using\nthe Mann-Whitney U-test demonstrates that transition slopes between T1-weighted\ncontrast-enhancing and T2/FLAIR hyperintense lesion regions, as well as between\nT2 intense lesion and a 2 cm peritumoral expansion region, are significantly\nassociated with biomarker status. Furthermore, the observed radiomic changes\nalong the radial direction closely reflected known biological characteristics.\nRadiomic features extracted on the spherical surfaces at varying radial\ndistances to the GBM tumor centroid are better correlated with important tumor\nmolecular markers and patient survival than the conventional Cartesian\nanalysis."}
{"id": "2510.13672", "pdf": "https://arxiv.org/pdf/2510.13672", "abs": "https://arxiv.org/abs/2510.13672", "authors": ["Marcílio Ferreira dos Santos", "Andreza dos Santos Rodrigues de Melo"], "title": "Hierarchical Bayesian Modeling of Dengue in Recife, Brazil (2015-2024): The Role of Spatial Granularity and Data Quality for Epidemiological Risk Mapping", "categories": ["stat.AP", "q-bio.QM", "stat.ME"], "comment": "12 pages, 12 figures, 8 tables", "summary": "Dengue remains one of Brazil's major epidemiological challenges, marked by\nstrong intra-urban inequalities and the influence of climatic and\nsocio-environmental factors. This study analyzed confirmed dengue cases in\nRecife from 2015 to 2024 using a Bayesian hierarchical spatio-temporal model\nimplemented in R-INLA, combining a BYM2 spatial structure with an RW1 temporal\ncomponent. Covariates included population density, household size, income,\ndrainage channels, lagged precipitation, and mean temperature. Population\ndensity and household size had positive effects on dengue risk, while income\nand channel presence were protective. Lagged precipitation increased risk, and\nhigher temperatures showed an inverse association, suggesting thermal\nthresholds for vector activity. The model achieved good fit (DIC=65817;\nWAIC=64506) and stable convergence, with moderate residual spatial\nautocorrelation (phi=0.06) and a smooth temporal trend between 2016 and 2019.\nSpatio-temporal estimates revealed persistent high-risk clusters in northern\nand western Recife, overlapping with areas of higher density and social\nvulnerability. Beyond reproducing historical patterns, the Bayesian model\nsupports probabilistic forecasting and early warning systems. Compared with\nclassical models (GLM, SAR, GWR, GTWR), INLA explicitly integrates uncertainty\nand spatial-temporal dependence, offering credible interval inference for\ndecision-making in urban health management."}
