{"id": "2508.19420", "pdf": "https://arxiv.org/pdf/2508.19420", "abs": "https://arxiv.org/abs/2508.19420", "authors": ["Ely F. Miller", "Abhishek Mallela", "Jacob Neumann", "Yen Ting Lin", "William S. Hlavacek", "Richard G. Posner"], "title": "Using PyBioNetFit to Leverage Qualitative and Quantitative Data in Biological Model Parameterization and Uncertainty Quantification", "categories": ["q-bio.QM"], "comment": "44 pages, 7 main figures, 4 supplemental figures. Main text, figures,\n  tables, all captions, and supplemental material included", "summary": "Data generated in studies of cellular regulatory systems are often\nqualitative. For example, measurements of signaling readouts in the presence\nand absence of mutations may reveal a rank ordering of responses across\nconditions but not the precise extents of mutation-induced differences.\nQualitative data are often ignored by mathematical modelers or are considered\nin an ad hoc manner, as in the study of Kocieniewski and Lipniacki (2013) [Phys\nBiol 10: 035006], which was focused on the roles of MEK isoforms in ERK\nactivation. In this earlier study, model parameter values were tuned manually\nto obtain consistency with a combination of qualitative and quantitative data.\nThis approach is not reproducible, nor does it provide insights into parametric\nor prediction uncertainties. Here, starting from the same data and the same\nordinary differential equation (ODE) model structure, we generate formalized\nstatements of qualitative observations, making these observations more\nreusable, and we improve the model parameterization procedure by applying a\nsystematic and automated approach enabled by the software package PyBioNetFit.\nWe also demonstrate uncertainty quantification (UQ), which was absent in the\noriginal study. Our results show that PyBioNetFit enables qualitative data to\nbe leveraged, together with quantitative data, in parameterization of systems\nbiology models and facilitates UQ. These capabilities are important for\nreliable estimation of model parameters and model analyses in studies of\ncellular regulatory systems and reproducibility."}
{"id": "2508.19914", "pdf": "https://arxiv.org/pdf/2508.19914", "abs": "https://arxiv.org/abs/2508.19914", "authors": ["Muhammad Waqas", "Rukhmini Bandyopadhyay", "Eman Showkatian", "Amgad Muneer", "Anas Zafar", "Frank Rojas Alvarez", "Maricel Corredor Marin", "Wentao Li", "David Jaffray", "Cara Haymaker", "John Heymach", "Natalie I Vokes", "Luisa Maren Solis Soto", "Jianjun Zhang", "Jia Wu"], "title": "The Next Layer: Augmenting Foundation Models with Structure-Preserving and Attention-Guided Learning for Local Patches to Global Context Awareness in Computational Pathology", "categories": ["q-bio.QM", "cs.AI", "stat.ML"], "comment": "43 pages, 7 main Figures, 8 Extended Data Figures", "summary": "Foundation models have recently emerged as powerful feature extractors in\ncomputational pathology, yet they typically omit mechanisms for leveraging the\nglobal spatial structure of tissues and the local contextual relationships\namong diagnostically relevant regions - key elements for understanding the\ntumor microenvironment. Multiple instance learning (MIL) remains an essential\nnext step following foundation model, designing a framework to aggregate\npatch-level features into slide-level predictions. We present EAGLE-Net, a\nstructure-preserving, attention-guided MIL architecture designed to augment\nprediction and interpretability. EAGLE-Net integrates multi-scale absolute\nspatial encoding to capture global tissue architecture, a top-K\nneighborhood-aware loss to focus attention on local microenvironments, and\nbackground suppression loss to minimize false positives. We benchmarked\nEAGLE-Net on large pan-cancer datasets, including three cancer types for\nclassification (10,260 slides) and seven cancer types for survival prediction\n(4,172 slides), using three distinct histology foundation backbones (REMEDIES,\nUni-V1, Uni2-h). Across tasks, EAGLE-Net achieved up to 3% higher\nclassification accuracy and the top concordance indices in 6 of 7 cancer types,\nproducing smooth, biologically coherent attention maps that aligned with expert\nannotations and highlighted invasive fronts, necrosis, and immune infiltration.\nThese results position EAGLE-Net as a generalizable, interpretable framework\nthat complements foundation models, enabling improved biomarker discovery,\nprognostic modeling, and clinical decision support"}
