{"id": "2508.09212", "pdf": "https://arxiv.org/pdf/2508.09212", "abs": "https://arxiv.org/abs/2508.09212", "authors": ["Sihan Xie", "Thierry Tribout", "Didier Boichard", "Blaise Hanczar", "Julien Chiquet", "Eric Barrey"], "title": "Deep Generative Models for Discrete Genotype Simulation", "categories": ["q-bio.GN", "cs.AI", "cs.LG"], "comment": null, "summary": "Deep generative models open new avenues for simulating realistic genomic data\nwhile preserving privacy and addressing data accessibility constraints. While\nprevious studies have primarily focused on generating gene expression or\nhaplotype data, this study explores generating genotype data in both\nunconditioned and phenotype-conditioned settings, which is inherently more\nchallenging due to the discrete nature of genotype data. In this work, we\ndeveloped and evaluated commonly used generative models, including Variational\nAutoencoders (VAEs), Diffusion Models, and Generative Adversarial Networks\n(GANs), and proposed adaptation tailored to discrete genotype data. We\nconducted extensive experiments on large-scale datasets, including all\nchromosomes from cow and multiple chromosomes from human. Model performance was\nassessed using a well-established set of metrics drawn from both deep learning\nand quantitative genetics literature. Our results show that these models can\neffectively capture genetic patterns and preserve genotype-phenotype\nassociation. Our findings provide a comprehensive comparison of these models\nand offer practical guidelines for future research in genotype simulation. We\nhave made our code publicly available at\nhttps://github.com/SihanXXX/DiscreteGenoGen."}
{"id": "2507.09421", "pdf": "https://arxiv.org/pdf/2507.09421", "abs": "https://arxiv.org/abs/2507.09421", "authors": ["Daniele Cappelletti", "Aidan Howells", "Chuang Xu"], "title": "Stability of randomly switching stochastic reaction networks with asymptotically linear transition rates", "categories": ["math.PR", "q-bio.MN", "60J27, 60J28, 37H30, 37N25, 15B99, 93E15"], "comment": "Updated title and abstract. No changes to body", "summary": "Stochastic reaction networks are mathematical models frequently used in, but\nnot limited to, biochemistry. These models are continuous-time Markov chains\nwhose transition rates depend on certain parameters called rate constants,\nwhich despite the name may not be constant in real-world applications. In this\npaper we study how random switching between different stochastic reaction\nnetworks with asymptotically linear rate functions affects the stability of the\nprocess. We give matrix conditions for both positive recurrence (indeed,\nexponentially ergodicity) and transience (indeed, evanescence) in both the\nregime with high switching rates and the regime with low switching rates. We\nthen make use of these conditions to provide examples of processes whose\nstability behavior changes as the switching rate varies. We also explore what\nhappens in the middle regime where the switching rates are neither high nor low\nand our theorems do not apply. Specifically, we show by examples that there can\nbe arbitrarily many phase transitions between exponentially ergodicity and\nevanescence as the switching rate increases."}
{"id": "2508.09215", "pdf": "https://arxiv.org/pdf/2508.09215", "abs": "https://arxiv.org/abs/2508.09215", "authors": ["Kerem Delikoyun", "Qianyu Chen", "Liu Wei", "Si Ko Myo", "Johannes Krell", "Martin Schlegel", "Win Sen Kuan", "John Tshon Yit Soong", "Gerhard Schneider", "Clarissa Prazeres da Costa", "Percy A. Knolle", "Laurent Renia", "Matthew Edward Cove", "Hwee Kuan Lee", "Klaus Diepold", "Oliver Hayden"], "title": "Real-time deep learning phase imaging flow cytometer reveals blood cell aggregate biomarkers for haematology diagnostics", "categories": ["q-bio.QM", "cs.AI", "cs.CV", "cs.LG", "eess.IV"], "comment": null, "summary": "While analysing rare blood cell aggregates remains challenging in automated\nhaematology, they could markedly advance label-free functional diagnostics.\nConventional flow cytometers efficiently perform cell counting with leukocyte\ndifferentials but fail to identify aggregates with flagged results, requiring\nmanual reviews. Quantitative phase imaging flow cytometry captures detailed\naggregate morphologies, but clinical use is hampered by massive data storage\nand offline processing. Incorporating hidden biomarkers into routine\nhaematology panels would significantly improve diagnostics without flagged\nresults. We present RT-HAD, an end-to-end deep learning-based image and data\nprocessing framework for off-axis digital holographic microscopy (DHM), which\ncombines physics-consistent holographic reconstruction and detection,\nrepresenting each blood cell in a graph to recognize aggregates. RT-HAD\nprocesses >30 GB of image data on-the-fly with turnaround time of <1.5 min and\nerror rate of 8.9% in platelet aggregate detection, which matches acceptable\nlaboratory error rates of haematology biomarkers and solves the big data\nchallenge for point-of-care diagnostics."}
{"id": "2508.09217", "pdf": "https://arxiv.org/pdf/2508.09217", "abs": "https://arxiv.org/abs/2508.09217", "authors": ["Akshay Sajan", "Stijn Sluis", "Reza Haydarlou", "Sanne Abeln", "Pasquale Lisena", "Raphael Troncy", "Caro Verbeek", "Inger Leemans", "Halima Mouhib"], "title": "Exploring Molecular Odor Taxonomies for Structure-based Odor Predictions using Machine Learning", "categories": ["q-bio.QM", "cs.LG", "research article"], "comment": "24 pages (58 pages including supporting information), 9 Figures, 4\n  Tables; additional Tables and Figures in the supporting information", "summary": "One of the key challenges to predict odor from molecular structure is\nunarguably our limited understanding of the odor space and the complexity of\nthe underlying structure-odor relationships. Here, we show that the predictive\nperformance of machine learning models for structure-based odor predictions can\nbe improved using both, an expert and a data-driven odor taxonomy. The expert\ntaxonomy is based on semantic and perceptual similarities, while the\ndata-driven taxonomy is based on clustering co-occurrence patterns of odor\ndescriptors directly from the prepared dataset. Both taxonomies improve the\npredictions of different machine learning models and outperform random\ngroupings of descriptors that do not reflect existing relations between odor\ndescriptors. We assess the quality of both taxonomies through their predictive\nperformance across different odor classes and perform an in-depth error\nanalysis highlighting the complexity of odor-structure relationships and\nidentifying potential inconsistencies within the taxonomies by showcasing pear\nodorants used in perfumery. The data-driven taxonomy allows us to critically\nevaluate our expert taxonomy and better understand the molecular odor space.\nBoth taxonomies as well as a full dataset are made available to the community,\nproviding a stepping stone for a future community-driven exploration of the\nmolecular basis of smell. In addition, we provide a detailed multi-layer expert\ntaxonomy including a total of 777 different descriptors from the Pyrfume\nrepository."}
{"id": "2508.09242", "pdf": "https://arxiv.org/pdf/2508.09242", "abs": "https://arxiv.org/abs/2508.09242", "authors": ["Gaojie Zhou", "Junhua Li"], "title": "Cross-BCI, A Cross-BCI-Paradigm Classifica-tion Model Towards Universal BCI Applications", "categories": ["q-bio.QM", "cs.AI", "cs.HC"], "comment": null, "summary": "Classification models used in brain-computer interface (BCI) are usually\ndesigned for a single BCI paradigm. This requires the redevelopment of the\nmodel when applying it to a new BCI paradigm, resulting in repeated costs and\neffort. Moreover, less complex deep learning models are desired for practical\nusage, as well as for deployment on portable devices. In or-der to fill the\nabove gaps, we, in this study, proposed a light-weight and unified decoding\nmodel for cross-BCI-paradigm classification. The proposed model starts with a\ntempo-spatial convolution. It is followed by a multi-scale local feature\nselec-tion module, aiming to extract local features shared across BCI paradigms\nand generate weighted features. Finally, a mul-ti-dimensional global feature\nextraction module is designed, in which multi-dimensional global features are\nextracted from the weighted features and fused with the weighted features to\nform high-level feature representations associated with BCI para-digms. The\nresults, evaluated on a mixture of three classical BCI paradigms (i.e., MI,\nSSVEP, and P300), demon-strate that the proposed model achieves 88.39%, 82.36%,\n80.01%, and 0.8092 for accuracy, macro-precision, mac-ro-recall, and\nmacro-F1-score, respectively, significantly out-performing the compared models.\nThis study pro-vides a feasible solution for cross-BCI-paradigm\nclassifica-tion. It lays a technological foundation for de-veloping a new\ngeneration of unified decoding systems, paving the way for low-cost and\nuniversal practical applications."}
{"id": "2508.09373", "pdf": "https://arxiv.org/pdf/2508.09373", "abs": "https://arxiv.org/abs/2508.09373", "authors": ["Adam Yusuf", "Paramahansa Pramanik"], "title": "Predictive Significance of CD276/B7-H3 Expression in Baseline Biopsies of Advanced Prostate Carcinoma", "categories": ["q-bio.QM", "stat.AP"], "comment": "31 pages, 8 figures, 1 table", "summary": "At the time of diagnosis, prostate cancer can appear deceptively mild or\nalready display signs of widespread disease. Predicting long-term outcomes is\noften uncertain. This research focused on measuring CD276/B7-H3, an immune\ncheckpoint protein linked to tumor development, in diagnostic tissue samples\nfrom 248 men. Participants included both those with cancer confined to the\nprostate and those with confirmed metastases. Analysis showed that patients\nwith metastatic disease were more likely to exhibit increased B7-H3 levels.\nStrong expression of this marker was associated with shorter survival times and\nwas observed alongside higher PSA concentrations and greater tumor\naggressiveness based on Gleason grading. These trends remained consistent even\nwhen other prognostic factors were taken into account. The results suggest that\nassessing B7-H3 during the initial biopsy could help clinicians identify\nhigh-risk patients earlier. This marker may also represent a new target for\ntreatment strategies in advanced prostate cancer."}
{"id": "2508.09406", "pdf": "https://arxiv.org/pdf/2508.09406", "abs": "https://arxiv.org/abs/2508.09406", "authors": ["Faisal Suwayyid", "Yuta Hozumi", "Hongsong Feng", "Mushal Zia", "JunJie Wee", "Guo-Wei Wei"], "title": "CAKL: Commutative algebra k-mer learning of genomics", "categories": ["q-bio.QM", "math.AC", "13P25, 92D20"], "comment": null, "summary": "Despite the availability of various sequence analysis models, comparative\ngenomic analysis remains a challenge in genomics, genetics, and phylogenetics.\nCommutative algebra, a fundamental tool in algebraic geometry and number\ntheory, has rarely been used in data and biological sciences. In this study, we\nintroduce commutative algebra k-mer learning (CAKL) as the first-ever nonlinear\nalgebraic framework for analyzing genomic sequences. CAKL bridges between\ncommutative algebra, algebraic topology, combinatorics, and machine learning to\nestablish a new mathematical paradigm for comparative genomic analysis. We\nevaluate its effectiveness on three tasks -- genetic variant identification,\nphylogenetic tree analysis, and viral genome classification -- typically\nrequiring alignment-based, alignment-free, and machine-learning approaches,\nrespectively. Across eleven datasets, CAKL outperforms five state-of-the-art\nsequence analysis methods, particularly in viral classification, and maintains\nstable predictive accuracy as dataset size increases, underscoring its\nscalability and robustness. This work ushers in a new era in commutative\nalgebraic data analysis and learning."}
{"id": "2508.09722", "pdf": "https://arxiv.org/pdf/2508.09722", "abs": "https://arxiv.org/abs/2508.09722", "authors": ["Szuzina Fazekas", "Bettina Katalin Budai", "Viktor Bérczi", "Pál Maurovich-Horvat", "Zsolt Vizi"], "title": "Quest for a clinically relevant medical image segmentation metric: the definition and implementation of Medical Similarity Index", "categories": ["q-bio.QM"], "comment": null, "summary": "Background: In the field of radiology and radiotherapy, accurate delineation\nof tissues and organs plays a crucial role in both diagnostics and\ntherapeutics. While the gold standard remains expert-driven manual\nsegmentation, many automatic segmentation methods are emerging. The evaluation\nof these methods primarily relies on traditional metrics that only incorporate\ngeometrical properties and fail to adapt to various applications.\n  Aims: This study aims to develop and implement a clinically relevant\nsegmentation metric that can be adapted for use in various medical imaging\napplications.\n  Methods: Bidirectional local distance was defined, and the points of the test\ncontour were paired with points of the reference contour. After correcting for\nthe distance between the test and reference center of mass, Euclidean distance\nwas calculated between the paired points, and a score was given to each test\npoint. The overall medical similarity index was calculated as the average score\nacross all the test points. For demonstration, we used myoma and prostate\ndatasets; nnUNet neural networks were trained for segmentation.\n  Results: An easy-to-use, sustainable image processing pipeline was created\nusing Python. The code is available in a public GitHub repository along with\nGoogle Colaboratory notebooks. The algorithm can handle multislice images with\nmultiple masks per slice. Mask splitting algorithm is also provided that can\nseparate the concave masks. We demonstrate the adaptability with prostate\nsegmentation evaluation.\n  Conclusions: A novel segmentation evaluation metric was implemented, and an\nopen-access image processing pipeline was also provided, which can be easily\nused for automatic measurement of clinical relevance of medical image\nsegmentation.}"}
{"id": "2508.09757", "pdf": "https://arxiv.org/pdf/2508.09757", "abs": "https://arxiv.org/abs/2508.09757", "authors": ["Nashira Baena", "Mariana da Silva", "Irina Grigorescu", "Aakash Saboo", "Saga Masui", "Jaques-Donald Tournier", "Emma C. Robinson"], "title": "NEUBORN: The Neurodevelopmental Evolution framework Using BiOmechanical RemodelliNg", "categories": ["q-bio.QM", "cs.AI"], "comment": null, "summary": "Understanding individual cortical development is essential for identifying\ndeviations linked to neurodevelopmental disorders. However, current normative\nmodelling frameworks struggle to capture fine-scale anatomical details due to\ntheir reliance on modelling data within a population-average reference space.\nHere, we present a novel framework for learning individual growth trajectories\nfrom biomechanically constrained, longitudinal, diffeomorphic image\nregistration, implemented via a hierarchical network architecture. Trained on\nneonatal MRI data from the Developing Human Connectome Project, the method\nimproves the biological plausibility of warps, generating growth trajectories\nthat better follow population-level trends while generating smoother warps,\nwith fewer negative Jacobians, relative to state-of-the-art baselines. The\nresulting subject-specific deformations provide interpretable, biologically\ngrounded mappings of development. This framework opens new possibilities for\npredictive modeling of brain maturation and early identification of\nmalformations of cortical development."}
{"id": "2508.09160", "pdf": "https://arxiv.org/pdf/2508.09160", "abs": "https://arxiv.org/abs/2508.09160", "authors": ["Beyza Cinar", "Maria Maleshkova"], "title": "Presenting DiaData for Research on Type 1 Diabetes", "categories": ["cs.LG", "cs.DB", "q-bio.QM"], "comment": "11 pages, 7 figures, 3 tables", "summary": "Type 1 diabetes (T1D) is an autoimmune disorder that leads to the destruction\nof insulin-producing cells, resulting in insulin deficiency, as to why the\naffected individuals depend on external insulin injections. However, insulin\ncan decrease blood glucose levels and can cause hypoglycemia. Hypoglycemia is a\nsevere event of low blood glucose levels ($\\le$70 mg/dL) with dangerous side\neffects of dizziness, coma, or death. Data analysis can significantly enhance\ndiabetes care by identifying personal patterns and trends leading to adverse\nevents. Especially, machine learning (ML) models can predict glucose levels and\nprovide early alarms. However, diabetes and hypoglycemia research is limited by\nthe unavailability of large datasets. Thus, this work systematically integrates\n15 datasets to provide a large database of 2510 subjects with glucose\nmeasurements recorded every 5 minutes. In total, 149 million measurements are\nincluded, of which 4% represent values in the hypoglycemic range. Moreover, two\nsub-databases are extracted. Sub-database I includes demographics, and\nsub-database II includes heart rate data. The integrated dataset provides an\nequal distribution of sex and different age levels. As a further contribution,\ndata quality is assessed, revealing that data imbalance and missing values\npresent a significant challenge. Moreover, a correlation study on glucose\nlevels and heart rate data is conducted, showing a relation between 15 and 55\nminutes before hypoglycemia."}
{"id": "2508.09659", "pdf": "https://arxiv.org/pdf/2508.09659", "abs": "https://arxiv.org/abs/2508.09659", "authors": ["Johannes F. Hevler", "Shivam Verma", "Mirat Soijtra", "Carolyn R. Bertozzi"], "title": "Thermal Tracks: A Gaussian process-based framework for universal melting curve analysis enabling unconstrained hit identification in thermal proteome profiling experiments", "categories": ["cs.LG", "q-bio.QM"], "comment": "5 pages, 2 figures, short communication", "summary": "Thermal Tracks is a Python-based statistical framework for analyzing protein\nthermal stability data that overcomes key limitations of existing thermal\nproteome profiling (TPP) work-flows. Unlike standard approaches that assume\nsigmoidal melting curves and are constrained by empirical null distributions\n(limiting significant hits to approximately 5 % of data), Thermal Tracks uses\nGaussian Process (GP) models with squared-exponential kernels to flexibly model\nany melting curve shape while generating unbiased null distributions through\nkernel priors. This framework is particularly valuable for analyzing\nproteome-wide perturbations that significantly alter protein thermal stability,\nsuch as pathway inhibitions, genetic modifications, or environmental stresses,\nwhere conventional TPP methods may miss biologically relevant changes due to\ntheir statistical constraints. Furthermore, Thermal Tracks excels at analyzing\nproteins with un-conventional melting profiles, including phase-separating\nproteins and membrane proteins, which often exhibit complex, non-sigmoidal\nthermal stability behaviors. Thermal Tracks is freely available from GitHub and\nis implemented in Python, providing an accessible and flexible tool for\nproteome-wide thermal profiling studies."}
{"id": "2508.09926", "pdf": "https://arxiv.org/pdf/2508.09926", "abs": "https://arxiv.org/abs/2508.09926", "authors": ["Benjamin Adjadj", "Pierre-Antoine Bannier", "Guillaume Horent", "Sebastien Mandela", "Aurore Lyon", "Kathryn Schutte", "Ulysse Marteau", "Valentin Gaury", "Laura Dumont", "Thomas Mathieu", "Reda Belbahri", "Benoît Schmauch", "Eric Durand", "Katharina Von Loga", "Lucie Gillet"], "title": "Towards Comprehensive Cellular Characterisation of H&E slides", "categories": ["cs.CV", "q-bio.QM", "I.2.10; I.4.8"], "comment": "33 pages, 4 figures", "summary": "Cell detection, segmentation and classification are essential for analyzing\ntumor microenvironments (TME) on hematoxylin and eosin (H&E) slides. Existing\nmethods suffer from poor performance on understudied cell types (rare or not\npresent in public datasets) and limited cross-domain generalization. To address\nthese shortcomings, we introduce HistoPLUS, a state-of-the-art model for cell\nanalysis, trained on a novel curated pan-cancer dataset of 108,722 nuclei\ncovering 13 cell types. In external validation across 4 independent cohorts,\nHistoPLUS outperforms current state-of-the-art models in detection quality by\n5.2% and overall F1 classification score by 23.7%, while using 5x fewer\nparameters. Notably, HistoPLUS unlocks the study of 7 understudied cell types\nand brings significant improvements on 8 of 13 cell types. Moreover, we show\nthat HistoPLUS robustly transfers to two oncology indications unseen during\ntraining. To support broader TME biomarker research, we release the model\nweights and inference code at https://github.com/owkin/histoplus/."}
