{"id": "2512.21301", "pdf": "https://arxiv.org/pdf/2512.21301", "abs": "https://arxiv.org/abs/2512.21301", "authors": ["Abdullah G. Elafifi", "Basma Mamdouh", "Mariam Hanafy", "Muhammed Alaa Eldin", "Yosef Khaled", "Nesma Mohamed El-Gelany", "Tarek H. M. Abou-El-Enien"], "title": "Transcriptome-Conditioned Personalized De Novo Drug Generation for AML Using Metaheuristic Assembly and Target-Driven Filtering", "categories": ["cs.LG", "q-bio.QM"], "comment": null, "summary": "Acute Myeloid Leukemia (AML) remains a clinical challenge due to its extreme molecular heterogeneity and high relapse rates. While precision medicine has introduced mutation-specific therapies, many patients still lack effective, personalized options. This paper presents a novel, end-to-end computational framework that bridges the gap between patient-specific transcriptomics and de novo drug discovery. By analyzing bulk RNA sequencing data from the TCGA-LAML cohort, the study utilized Weighted Gene Co-expression Network Analysis (WGCNA) to prioritize 20 high-value biomarkers, including metabolic transporters like HK3 and immune-modulatory receptors such as SIGLEC9. The physical structures of these targets were modeled using AlphaFold3, and druggable hotspots were quantitatively mapped via the DOGSiteScorer engine. Then developed a novel, reaction-first evolutionary metaheuristic algorithm as well as multi-objective optimization programming that assembles novel ligands from fragment libraries, guided by spatial alignment to these identified hotspots. The generative model produced structurally unique chemical entities with a strong bias toward drug-like space, as evidenced by QED scores peaking between 0.5 and 0.7. Validation through ADMET profiling and SwissDock molecular docking identified high-confidence candidates, such as Ligand L1, which achieved a binding free energy of -6.571 kcal/mol against the A08A96 biomarker. These results demonstrate that integrating systems biology with metaheuristic molecular assembly can produce pharmacologically viable, patient tailored leads, offering a scalable blueprint for precision oncology in AML and beyond"}
{"id": "2512.20887", "pdf": "https://arxiv.org/pdf/2512.20887", "abs": "https://arxiv.org/abs/2512.20887", "authors": ["Ryan Ripsman", "Brayden Kell", "Andreas Hilfinger"], "title": "Using stationary information flows to prove kinetic uncertainty relations in biochemical control systems", "categories": ["q-bio.MN", "q-bio.SC"], "comment": "8 pages, 3 figures", "summary": "Many cellular components are present in such low numbers that individual stochastic production and degradation events lead to significant fluctuations in molecular abundances. Although feedback control can, in principle, suppress such low-copy-number fluctuations, general rules have emerged that suggest fundamental performance constraints on feedback control in biochemical systems. In particular, previous work has conjectured that reducing abundance fluctuations in one component requires at least one sacrificial component with increased variability in arbitrary reaction networks of any size. Here, we present an exact and general proof of this statement based on probability current decompositions of mutual information rates between molecular abundances. This suggests that variability in cellular components is necessary for cellular control and that fluctuating components do not necessarily generate cellular \"noise\" but may correspond to control molecules that are involved in removing \"noise\" from other cellular components."}
