{"id": "2511.22821", "pdf": "https://arxiv.org/pdf/2511.22821", "abs": "https://arxiv.org/abs/2511.22821", "authors": ["Hamid Ismail", "Marwan Bikdash"], "title": "deepFEPS: Deep Learning-Oriented Feature Extraction for Biological Sequences", "categories": ["q-bio.GN"], "comment": "16 pages, 6 figures, bioinformatics tool for genomics analysis", "summary": "Machine- and deep-learning approaches for biological sequences depend critically on transforming raw DNA, RNA, and protein FASTA files into informative numerical representations. However, this process is often fragmented across multiple libraries and preprocessing steps, which creates a barrier for researchers without extensive computational expertise. To address this gap, we developed deepFEPS, an open-source toolkit that unifies state-of-the-art feature extraction methods for sequence data within a single, reproducible workflow. deepFEPS integrates five families of modern feature extractors - k-mer embeddings (Word2Vec, FastText), document-level embeddings (Doc2Vec), transformer-based encoders (DNABERT, ProtBERT, and ESM2), autoencoder-derived latent features, and graph-based embeddings - into one consistent platform. The system accepts FASTA input via a web interface or command-line tool, exposes key model parameters, and outputs analysis-ready feature matrices (CSV). Each run is accompanied by an automatic quality-control report including sequence counts, dimensionality, sparsity, variance distributions, class balance, and diagnostic visualizations. By consolidating advanced sequence embeddings into one environment, deepFEPS reduces preprocessing overhead, improves reproducibility, and shortens the path from raw sequences to downstream machine- and deep-learning applications. deepFEPS lowers the practical barrier to modern representation learning for bioinformatics, enabling both novice and expert users to generate advanced embeddings for classification, clustering, and predictive modeling. Its unified framework supports exploratory analyses, high-throughput studies, and integration into institutional workflows, while remaining extensible to emerging models and methods. The webserver is accessible at https://hdismail.com/deepfeps2/."}
{"id": "2511.23114", "pdf": "https://arxiv.org/pdf/2511.23114", "abs": "https://arxiv.org/abs/2511.23114", "authors": ["Ankit Gupta", "Mustafa Khammash"], "title": "A Spectral Koopman Approximation Framework for Stochastic Reaction Networks", "categories": ["q-bio.MN", "math.PR", "q-bio.QM"], "comment": "7 figures", "summary": "Stochastic reaction networks (SRNs) are a general class of continuous-time Markov jump processes used to model a wide range of systems, including biochemical dynamics in single cells, ecological and epidemiological populations, and queueing or communication networks. Yet analyzing their dynamics remains challenging because these processes are high-dimensional and their transient behavior can vary substantially across different initial molecular or population states. Here we introduce a spectral framework for the stochastic Koopman operator that provides a tractable, low-dimensional representation of SRN dynamics over continuous time, together with computable error estimates. By exploiting the compactness of the Koopman operator, we recover dominant spectral modes directly from simulated or experimental data, enabling efficient prediction of moments, event probabilities, and other summary statistics across all initial states. We further derive continuous-time parameter sensitivities and cross-spectral densities, offering new tools for probing noise structure and frequency-domain behavior. We demonstrate the approach on biologically relevant systems, including synthetic intracellular feedback controllers, stochastic oscillators, and inference of initial-state distributions from high-temporal-resolution flow cytometry. Together, these results establish spectral Koopman analysis as a powerful and general framework for studying stochastic dynamical systems across the biological, ecological, and computational sciences."}
{"id": "2511.21770", "pdf": "https://arxiv.org/pdf/2511.21770", "abs": "https://arxiv.org/abs/2511.21770", "authors": ["Luke Rimmo Lego", "Samantha Gauthier", "Denver Jn. Baptiste"], "title": "Automated Statistical and Machine Learning Platform for Biological Research", "categories": ["q-bio.QM", "cs.LG", "stat.ML"], "comment": "7 pages, 2 figures, 25 equations", "summary": "Research increasingly relies on computational methods to analyze experimental data and predict molecular properties. Current approaches often require researchers to use a variety of tools for statistical analysis and machine learning, creating workflow inefficiencies. We present an integrated platform that combines classical statistical methods with Random Forest classification for comprehensive data analysis that can be used in the biological sciences. The platform implements automated hyperparameter optimization, feature importance analysis, and a suite of statistical tests including t tests, ANOVA, and Pearson correlation analysis. Our methodology addresses the gap between traditional statistical software, modern machine learning frameworks and biology, by providing a unified interface accessible to researchers without extensive programming experience. The system achieves this through automatic data preprocessing, categorical encoding, and adaptive model configuration based on dataset characteristics. Initial testing protocols are designed to evaluate classification accuracy across diverse chemical datasets with varying feature distributions. This work demonstrates that integrating statistical rigor with machine learning interpretability can accelerate biological discovery workflows while maintaining methodological soundness. The platform's modular architecture enables future extensions to additional machine learning algorithms and statistical procedures relevant to bioinformatics."}
{"id": "2511.22252", "pdf": "https://arxiv.org/pdf/2511.22252", "abs": "https://arxiv.org/abs/2511.22252", "authors": ["Vincent Fromion", "Philippe Robert", "Jana Zaherddine"], "title": "Stochastic Models of Resource Allocation in Chemical Reaction Networks", "categories": ["math.PR", "q-bio.MN"], "comment": null, "summary": "This paper analyses of a stochastic model of a chemical reaction network with three types of chemical species ${\\cal R}$, ${\\cal M}$ and ${\\cal U}$ that interact to transform a flow of external resources, the chemical species ${\\cal Q}$, to produce a product, the chemical species ${\\cal P}_r$. A regulation mechanism involving the sequestration of the chemical species ${\\cal R}$ when the flow of resources is too low is investigated. The original motivation of the study is of analyzing the qualitative properties of a key regulation mechanism of gene expression in biological cells, the {\\em stringent response}.\n  A scaling analysis of a Markov process in $\\N^5$ representing the state of the chemical reaction network is achieved. It is shown that, depending on the parameters of the model, there are, quite surprisingly, three possible asymptotic regimes. To each of them corresponds a stochastic averaging principle with a fast process expressed in terms of a network of $M/M/\\infty$ queues. One of these regimes, the optimal sequestration regime, does not seem to have been identified up to now. Under this regime, the input flow of resources is low but the state of the network is still acceptable in terms of unused macro-molecules, showing the remarkable efficiency of this regulation mechanism. The technical proofs of the main convergence results rely on a combination of coupling arguments, technical estimates of the solutions of SDEs, of sample paths of fast processes in particular, and the stability properties of some dynamical systems in $\\R^2$."}
{"id": "2511.22145", "pdf": "https://arxiv.org/pdf/2511.22145", "abs": "https://arxiv.org/abs/2511.22145", "authors": ["Cesar Nieto", "Sayeh Rezaee", "Cesar Augusto Vargas-Garcia", "Abhyudai Singh"], "title": "Dynamical Inference of Cell Size Regulation Parameters", "categories": ["q-bio.QM"], "comment": null, "summary": "Cells achieve size homeostasis by regulating their division timing based on their size, added size, and cell cycle time. Previous research under steady-state conditions demonstrated the robustness of these mechanisms. However, their dynamic responses in fluctuating environments, such as nutrient depletion due to population growth, remain challenging to fully characterize. Currently, advances in single-cell microscopy have revealed various cellular division strategies whose underlying molecular mechanisms are complex and not always available. This study introduces a novel approach to model cell size dynamics using a piecewise deterministic Markov chain framework, where cell division events are modeled as stochastic jumps determined by a division propensity dependent on both current cell size and added size since birth. We propose a three-parameter characterization for the division process: scale (target added size at division), shape (division stochasticity), and division strategy (relevance of cell size, added size, or cell cycle duration). We derive analytical formulas for the probability of division, and with this probability, we develop a maximum likelihood estimation (MLE) framework. We implement a systematic investigation of the accuracy of inference as a function of sample size. The model's performance is studied across various scenarios, including those exhibiting dynamical changes in one or more parameters, suggesting its broad applicability for analyzing new experimental data on cell size regulation in dynamic environments."}
{"id": "2511.22519", "pdf": "https://arxiv.org/pdf/2511.22519", "abs": "https://arxiv.org/abs/2511.22519", "authors": ["Wojciech Zarzecki", "Paulina Szymczak", "Ewa Szczurek", "Kamil Deja"], "title": "FoldSAE: Learning to Steer Protein Folding Through Sparse Representations", "categories": ["q-bio.QM"], "comment": "15 pages, 1o figures, submitted to RECOMB 2026", "summary": "RFdiffusion is a popular and well-established model for generation of protein structures. However, this generative process offers limited insight into its internal representations and how they contribute to the final protein structure. Concurrently, recent work in mechanistic interpretability has successfully used Sparse Autoencoders (SAEs) to discover interpretable features within neural networks. We combine these concepts by applying SAE to the internal representations of RFdiffusion to uncover secondary structure-specific features and establish a relationship between them and generated protein structures. Building on these insights, we introduce a novel steering mechanism that enables precise control of secondary structure formation through a tunable hyperparameter, while simultaneously revealing interpretable block and neuron-level representations within RFdiffusion. Our work pioneers a new framework for making RFdiffusion more interpretable, demonstrating how understanding internal features can be directly translated into precise control over the protein design process."}
{"id": "2511.21848", "pdf": "https://arxiv.org/pdf/2511.21848", "abs": "https://arxiv.org/abs/2511.21848", "authors": ["Eric Leonardis", "Akira Nagamori", "Ayesha Thanawalla", "Yuanjia Yang", "Joshua Park", "Hutton Saunders", "Eiman Azim", "Talmo Pereira"], "title": "Massively Parallel Imitation Learning of Mouse Forelimb Musculoskeletal Reaching Dynamics", "categories": ["cs.LG", "cs.RO", "q-bio.NC", "q-bio.QM"], "comment": "Accepted at NeurIPS 2025 Workshop Data on the Brain & Mind: Concrete Applications of AI to Neuroscience and Cognitive Science. 12 pages, 4 figures", "summary": "The brain has evolved to effectively control the body, and in order to understand the relationship we need to model the sensorimotor transformations underlying embodied control. As part of a coordinated effort, we are developing a general-purpose platform for behavior-driven simulation modeling high fidelity behavioral dynamics, biomechanics, and neural circuit architectures underlying embodied control. We present a pipeline for taking kinematics data from the neuroscience lab and creating a pipeline for recapitulating those natural movements in a biomechanical model. We implement a imitation learning framework to perform a dexterous forelimb reaching task with a musculoskeletal model in a simulated physics environment. The mouse arm model is currently training at faster than 1 million training steps per second due to GPU acceleration with JAX and Mujoco-MJX. We present results that indicate that adding naturalistic constraints on energy and velocity lead to simulated musculoskeletal activity that better predict real EMG signals. This work provides evidence to suggest that energy and control constraints are critical to modeling musculoskeletal motor control."}
{"id": "2511.21919", "pdf": "https://arxiv.org/pdf/2511.21919", "abs": "https://arxiv.org/abs/2511.21919", "authors": ["Francisco Sena", "Aleksandr Politov", "Corentin Moumard", "Manuel Cáceres", "Sebastian Schmidt", "Juha Harviainen", "Alexandru I. Tomescu"], "title": "Identifying all snarls and superbubbles in linear-time, via a unified SPQR-tree framework", "categories": ["cs.DS", "cs.DM", "q-bio.QM"], "comment": null, "summary": "Snarls and superbubbles are fundamental pangenome decompositions capturing variant sites. These bubble-like structures underpin key tasks in computational pangenomics, including structural-variant genotyping, distance indexing, haplotype sampling, and variant annotation. Snarls can be quadratically-many in the size of the graph, and since their introduction in 2018 with the vg toolkit, there has been no work on identifying all snarls in linear time. Moreover, while it is known how to find superbubbles in linear time, this result is a highly specialized solution only achieved after a long series of papers.\n  We present the first algorithm identifying all snarls in linear time. This is based on a new representation of all snarls, of size linear in the input graph size, and which can be computed in linear time. Our algorithm is based on a unified framework that also provides a new linear-time algorithm for finding superbubbles. An observation behind our results is that all such structures are separated from the rest of the graph by two vertices (except for cases which are trivially computable), i.e. their endpoints are a 2-separator of the underlying undirected graph. Based on this, we employ the well-known SPQR tree decomposition, which encodes all 2-separators, to guide a traversal that finds the bubble-like structures efficiently.\n  We implemented our algorithms in C++ (available at https://github.com/algbio/BubbleFinder) and evaluated them on various pangenomic datasets. Our algorithms outcompete or they are on the same level of existing methods. For snarls, we are up to two times faster than vg, while identifying all snarls. When computing superbubbles, we are up to 50 times faster than BubbleGun. Our SPQR tree framework provides a unifying perspective on bubble-like structures in pangenomics, together with a template for finding other bubble-like structures efficiently."}
{"id": "2511.22841", "pdf": "https://arxiv.org/pdf/2511.22841", "abs": "https://arxiv.org/abs/2511.22841", "authors": ["Hong Zheng", "Shimin Su", "Caiqi Liu", "Jingzhi Lou", "Lirong Cao", "Yexian Zhang", "Zhihui Zhang", "Marc Ka Chun Chong", "Benny Chung-Ying Zee", "Peter Pak-Hang Cheung", "Haogao Gu", "Juan Pu", "Leo Lit Man Poon", "Hui-Ling Yen", "Maggie Haitian Wang"], "title": "A novel approach to profile global circulation pathway of SARS-CoV-2 variants by site-based mutation dynamics", "categories": ["q-bio.PE", "q-bio.QM"], "comment": null, "summary": "The genetic evolution of SARS-CoV-2 has caused recurring epidemic waves, understanding its global dispersal patterns is critical for effective surveillance. We developed the Site-based mutation dynamics - Equal Power Sampling (S-EPS) framework, a phylogenetic-free, bias-correcting framework for profiling viral source-sink dynamics. Applying S-EPS to 6.6 million SARS-CoV-2 genomes (March 2020 - June 2024) from 13 regions worldwide, we identified Africa and the Indian subcontinent as the predominant sources of key mutations. Southeast Asia serves as an early transmission hub, while Russia and South America mainly acted as sinks. Key mutations took longer to establish fitness in source regions than externally. Once an amino acid substitution on the receptor-binding domain reached 1% prevalence in major sources, there is an 80% probability it would spread elsewhere, with a 2-month median lead time (IQR: 1-4). Our findings underscore the importance of genetic surveillance, with S-EPS offering enhanced capability for monitoring emerging viral threats."}
{"id": "2511.23114", "pdf": "https://arxiv.org/pdf/2511.23114", "abs": "https://arxiv.org/abs/2511.23114", "authors": ["Ankit Gupta", "Mustafa Khammash"], "title": "A Spectral Koopman Approximation Framework for Stochastic Reaction Networks", "categories": ["q-bio.MN", "math.PR", "q-bio.QM"], "comment": "7 figures", "summary": "Stochastic reaction networks (SRNs) are a general class of continuous-time Markov jump processes used to model a wide range of systems, including biochemical dynamics in single cells, ecological and epidemiological populations, and queueing or communication networks. Yet analyzing their dynamics remains challenging because these processes are high-dimensional and their transient behavior can vary substantially across different initial molecular or population states. Here we introduce a spectral framework for the stochastic Koopman operator that provides a tractable, low-dimensional representation of SRN dynamics over continuous time, together with computable error estimates. By exploiting the compactness of the Koopman operator, we recover dominant spectral modes directly from simulated or experimental data, enabling efficient prediction of moments, event probabilities, and other summary statistics across all initial states. We further derive continuous-time parameter sensitivities and cross-spectral densities, offering new tools for probing noise structure and frequency-domain behavior. We demonstrate the approach on biologically relevant systems, including synthetic intracellular feedback controllers, stochastic oscillators, and inference of initial-state distributions from high-temporal-resolution flow cytometry. Together, these results establish spectral Koopman analysis as a powerful and general framework for studying stochastic dynamical systems across the biological, ecological, and computational sciences."}
