{"id": "2506.08059", "pdf": "https://arxiv.org/pdf/2506.08059", "abs": "https://arxiv.org/abs/2506.08059", "authors": ["Huong Van Le", "Weibin Ren", "Junhong Kim", "Yukyung Yun", "Young Bin Park", "Young Jun Kim", "Bok Kyung Han", "Inho Choi", "Jong IL Park", "Hwi-Yeol Yun", "Jae-Mun Choi"], "title": "CaliciBoost: Performance-Driven Evaluation of Molecular Representations for Caco-2 Permeability Prediction", "categories": ["q-bio.QM", "cs.AI", "cs.LG"], "comment": "49 pages, 11 figures", "summary": "Caco-2 permeability serves as a critical in vitro indicator for predicting\nthe oral absorption of drug candidates during early-stage drug discovery. To\nenhance the accuracy and efficiency of computational predictions, we\nsystematically investigated the impact of eight molecular feature\nrepresentation types including 2D/3D descriptors, structural fingerprints, and\ndeep learning-based embeddings combined with automated machine learning\ntechniques to predict Caco-2 permeability. Using two datasets of differing\nscale and diversity (TDC benchmark and curated OCHEM data), we assessed model\nperformance across representations and identified PaDEL, Mordred, and RDKit\ndescriptors as particularly effective for Caco-2 prediction. Notably, the\nAutoML-based model CaliciBoost achieved the best MAE performance. Furthermore,\nfor both PaDEL and Mordred representations, the incorporation of 3D descriptors\nresulted in a 15.73% reduction in MAE compared to using 2D features alone, as\nconfirmed by feature importance analysis. These findings highlight the\neffectiveness of AutoML approaches in ADMET modeling and offer practical\nguidance for feature selection in data-limited prediction tasks."}
{"id": "2506.08954", "pdf": "https://arxiv.org/pdf/2506.08954", "abs": "https://arxiv.org/abs/2506.08954", "authors": ["Ruben Weitzman", "Peter Mørch Groth", "Lood Van Niekerk", "Aoi Otani", "Yarin Gal", "Debora Marks", "Pascal Notin"], "title": "Protriever: End-to-End Differentiable Protein Homology Search for Fitness Prediction", "categories": ["q-bio.QM", "cs.LG", "q-bio.BM"], "comment": "Accepted at ICML 2025", "summary": "Retrieving homologous protein sequences is essential for a broad range of\nprotein modeling tasks such as fitness prediction, protein design, structure\nmodeling, and protein-protein interactions. Traditional workflows have relied\non a two-step process: first retrieving homologs via Multiple Sequence\nAlignments (MSA), then training models on one or more of these alignments.\nHowever, MSA-based retrieval is computationally expensive, struggles with\nhighly divergent sequences or complex insertions & deletions patterns, and\noperates independently of the downstream modeling objective. We introduce\nProtriever, an end-to-end differentiable framework that learns to retrieve\nrelevant homologs while simultaneously training for the target task. When\napplied to protein fitness prediction, Protriever achieves state-of-the-art\nperformance compared to sequence-based models that rely on MSA-based homolog\nretrieval, while being two orders of magnitude faster through efficient vector\nsearch. Protriever is both architecture- and task-agnostic, and can flexibly\nadapt to different retrieval strategies and protein databases at inference time\n-- offering a scalable alternative to alignment-centric approaches."}
{"id": "2506.08058", "pdf": "https://arxiv.org/pdf/2506.08058", "abs": "https://arxiv.org/abs/2506.08058", "authors": ["Wenpo Yao"], "title": "Fuzzy permutation time irreversibility for nonequilibrium analysis of complex system", "categories": ["physics.data-an", "cond-mat.stat-mech", "q-bio.QM"], "comment": "13 pages, 5 figures", "summary": "Permutation time irreversibility is an important method to quantify\nnonequilibrium characteristics of complex systems; however, ordinal pattern is\na coarse-graining alternative of temporal structure and cannot accurately\nrepresent detailed structural information. This study aims to propose a fuzzy\npermutation time irreversibility (fpTIR) by measuring the difference between\nvector elements based on a negative exponential function. The amplitude\npermutation of vector is constructed and its membership degree is calculated;\nthen, the difference in probability distribution between the forward and\nbackward sequences is measured for fpTIR. To compare and measure the system's\ncomplexity, the Shannon entropy is calculated as the average amount of\ninformation in the fuzzy permutation probability distribution, i.e., fuzzy\npermutation entropy (fPEn). According to the surrogate theory, mode series are\ngenerated using logistic, Henon, and first-order autoregressive systems to\nverify the fpTIR, which is then used to analyze the heartbeats of patients with\ncongestive heart failure and healthy elderly and young participants from the\nPhysioNet database. Results suggest that the fpTIR effectively measures the\nsystem's nonequilibrium characteristics, thus improving the accuracy of\nheartbeat analysis. However, in analyzing probability distributions, the fpTIR\nand fPEn exhibit discrepancies in the chaotic series and even opposite results\nin the heartbeats, wherein the results of fpTIR are consistent with the theory\nof complexity loss in aging and disease. Overall, the fpTIR accurately\ncharacterizes the structure of the sequences and enhances the accuracy of the\nnonequilibrium analysis of complex systems, providing a theoretical basis for\nexploring complex systems from the perspectives of nonequilibrium dynamics and\nentropy complexity."}
{"id": "2506.08916", "pdf": "https://arxiv.org/pdf/2506.08916", "abs": "https://arxiv.org/abs/2506.08916", "authors": ["Maria-Veronica Ciocanel", "John T. Nardini", "Kevin B. Flores", "Erica M. Rutter", "Suzanne S. Sindi", "Alexandria Volkening"], "title": "Enhancing generalizability of model discovery across parameter space with multi-experiment equation learning (ME-EQL)", "categories": ["cs.LG", "math.DS", "q-bio.QM"], "comment": "31 pages, 10 figures", "summary": "Agent-based modeling (ABM) is a powerful tool for understanding\nself-organizing biological systems, but it is computationally intensive and\noften not analytically tractable. Equation learning (EQL) methods can derive\ncontinuum models from ABM data, but they typically require extensive\nsimulations for each parameter set, raising concerns about generalizability. In\nthis work, we extend EQL to Multi-experiment equation learning (ME-EQL) by\nintroducing two methods: one-at-a-time ME-EQL (OAT ME-EQL), which learns\nindividual models for each parameter set and connects them via interpolation,\nand embedded structure ME-EQL (ES ME-EQL), which builds a unified model library\nacross parameters. We demonstrate these methods using a birth--death mean-field\nmodel and an on-lattice agent-based model of birth, death, and migration with\nspatial structure. Our results show that both methods significantly reduce the\nrelative error in recovering parameters from agent-based simulations, with OAT\nME-EQL offering better generalizability across parameter space. Our findings\nhighlight the potential of equation learning from multiple experiments to\nenhance the generalizability and interpretability of learned models for complex\nbiological systems."}
