{"id": "2507.09378", "pdf": "https://arxiv.org/pdf/2507.09378", "abs": "https://arxiv.org/abs/2507.09378", "authors": ["Mohammadsaleh Refahi", "Mahdi Abavisani", "Bahrad A. Sokhansanj", "James R. Brown", "Gail Rosen"], "title": "Context-Aware Regularization with Markovian Integration for Attention-Based Nucleotide Analysis", "categories": ["q-bio.GN", "cs.AI"], "comment": null, "summary": "Transformers have revolutionized nucleotide sequence analysis, yet capturing\nlong-range dependencies remains challenging. Recent studies show that\nautoregressive transformers often exhibit Markovian behavior by relying on\nfixed-length context windows for next-token prediction. However, standard\nself-attention mechanisms are computationally inefficient for long sequences\ndue to their quadratic complexity and do not explicitly enforce global\ntransition consistency.\n  We introduce CARMANIA (Context-Aware Regularization with Markovian\nIntegration for Attention-Based Nucleotide Analysis), a self-supervised\npretraining framework that augments next-token (NT) prediction with a\ntransition-matrix (TM) loss. The TM loss aligns predicted token transitions\nwith empirically derived n-gram statistics from each input sequence,\nencouraging the model to capture higher-order dependencies beyond local\ncontext. This integration enables CARMANIA to learn organism-specific sequence\nstructures that reflect both evolutionary constraints and functional\norganization.\n  We evaluate CARMANIA across diverse genomic tasks, including regulatory\nelement prediction, functional gene classification, taxonomic inference,\nantimicrobial resistance detection, and biosynthetic gene cluster\nclassification. CARMANIA outperforms the previous best long-context model by at\nleast 7 percent, matches state-of-the-art on shorter sequences (exceeding prior\nresults on 20 out of 40 tasks while running approximately 2.5 times faster),\nand shows particularly strong improvements on enhancer and housekeeping gene\nclassification tasks, including up to a 34 percent absolute gain in Matthews\ncorrelation coefficient (MCC) for enhancer prediction. The TM loss boosts\naccuracy in 33 of 40 tasks, especially where local motifs or regulatory\npatterns drive prediction."}
{"id": "2507.09967", "pdf": "https://arxiv.org/pdf/2507.09967", "abs": "https://arxiv.org/abs/2507.09967", "authors": ["Kaitao Lai"], "title": "SimOmics: A Simulation Toolkit for Multivariate and Multi-Omics Data", "categories": ["q-bio.GN"], "comment": "4 pages, 1 figure", "summary": "SimOmics is an R package designed to generate realistic, multivariate, and\nmulti-omics synthetic datasets. It is intended for use in benchmarking, method\ndevelopment, and reproducibility in bioinformatics, particularly in the context\nof omics integration tasks such as those encountered in transcriptomics,\nproteomics, and metabolomics. SimOmics supports latent factor simulation,\nsparsity structures, block-wise covariance modeling, and biologically inspired\nnoise models and feature dimensions."}
{"id": "2507.08902", "pdf": "https://arxiv.org/pdf/2507.08902", "abs": "https://arxiv.org/abs/2507.08902", "authors": ["Sergio Mares", "Ariel Espinoza Weinberger", "Nilah M. Ioannidis"], "title": "Generation of structure-guided pMHC-I libraries using Diffusion Models", "categories": ["q-bio.QM", "cs.AI"], "comment": "Accepted to the The 2nd Workshop on Generative AI and Biology ICML\n  Workshop 2025", "summary": "Personalized vaccines and T-cell immunotherapies depend critically on\nidentifying peptide-MHC class I (pMHC-I) interactions capable of eliciting\npotent immune responses. However, current benchmarks and models inherit biases\npresent in mass-spectrometry and binding-assay datasets, limiting discovery of\nnovel peptide ligands. To address this issue, we introduce a structure-guided\nbenchmark of pMHC-I peptides designed using diffusion models conditioned on\ncrystal structure interaction distances. Spanning twenty high-priority HLA\nalleles, this benchmark is independent of previously characterized peptides yet\nreproduces canonical anchor residue preferences, indicating structural\ngeneralization without experimental dataset bias. Using this resource, we\ndemonstrate that state-of-the-art sequence-based predictors perform poorly at\nrecognizing the binding potential of these structurally stable designs,\nindicating allele-specific limitations invisible in conventional evaluations.\nOur geometry-aware design pipeline yields peptides with high predicted\nstructural integrity and higher residue diversity than existing datasets,\nrepresenting a key resource for unbiased model training and evaluation. Our\ncode, and data are available at: https://github.com/sermare/struct-mhc-dev."}
{"id": "2507.08822", "pdf": "https://arxiv.org/pdf/2507.08822", "abs": "https://arxiv.org/abs/2507.08822", "authors": ["Qiyao Yang", "Rosa Aghdam", "Reed Nelson", "Claudia Solís-Lemus"], "title": "MiNAA-WebApp: A Web-Based Tool for the Visualization and Analysis of Microbiome Networks", "categories": ["q-bio.MN"], "comment": null, "summary": "Microbial networks, representing microbes as nodes and their interactions as\nedges, are crucial for understanding community dynamics in various\nenvironments. Analyzing microbiome networks is crucial for identifying keystone\ntaxa that play central roles in maintaining microbial community structure and\nfunction, assessing how environmental changes such as pollution, climate\nshifts, or land use affect microbial dynamics, tracking disease progression by\nrevealing alterations in microbial interactions over time, and predicting\nmicrobial community responses to interventions such as antibiotics, probiotics,\nor changes in diet and habitat. The complexity of microbial interactions\nnecessitates the use of computational tools such as the MiNAA-WebApp, available\nat https://minaa.wid.wisc.edu, which enhances the accessibility of the\nMicrobiome Network Alignment Algorithm MiNAA. This tool allows researchers to\nalign microbial networks and explore ecological relationships and community\ndynamics without extensive computational skills. Originally, MiNAA's\ncommand-line interface limited its usability for those without programming\nbackgrounds. The web-based MiNAA-WebApp addresses this shortcoming by offering\nan intuitive interface with visualization tools, allowing easy exploration and\nanalysis of microbial networks. The web app is designed for microbiome networks\nbut also applicable to other biological networks, broadening its use in\ncomputational biology and making network-based research accessible to a wider\naudience."}
{"id": "2507.09028", "pdf": "https://arxiv.org/pdf/2507.09028", "abs": "https://arxiv.org/abs/2507.09028", "authors": ["Amgad Muneer", "Muhammad Waqas", "Maliazurina B Saad", "Eman Showkatian", "Rukhmini Bandyopadhyay", "Hui Xu", "Wentao Li", "Joe Y Chang", "Zhongxing Liao", "Cara Haymaker", "Luisa Solis Soto", "Carol C Wu", "Natalie I Vokes", "Xiuning Le", "Lauren A Byers", "Don L Gibbons", "John V Heymach", "Jianjun Zhang", "Jia Wu"], "title": "From Classical Machine Learning to Emerging Foundation Models: Review on Multimodal Data Integration for Cancer Research", "categories": ["q-bio.QM", "cs.AI"], "comment": "6 figures, 3 tables", "summary": "Cancer research is increasingly driven by the integration of diverse data\nmodalities, spanning from genomics and proteomics to imaging and clinical\nfactors. However, extracting actionable insights from these vast and\nheterogeneous datasets remains a key challenge. The rise of foundation models\n(FMs) -- large deep-learning models pretrained on extensive amounts of data\nserving as a backbone for a wide range of downstream tasks -- offers new\navenues for discovering biomarkers, improving diagnosis, and personalizing\ntreatment. This paper presents a comprehensive review of widely adopted\nintegration strategies of multimodal data to assist advance the computational\napproaches for data-driven discoveries in oncology. We examine emerging trends\nin machine learning (ML) and deep learning (DL), including methodological\nframeworks, validation protocols, and open-source resources targeting cancer\nsubtype classification, biomarker discovery, treatment guidance, and outcome\nprediction. This study also comprehensively covers the shift from traditional\nML to FMs for multimodal integration. We present a holistic view of recent FMs\nadvancements and challenges faced during the integration of multi-omics with\nadvanced imaging data. We identify the state-of-the-art FMs, publicly available\nmulti-modal repositories, and advanced tools and methods for data integration.\nWe argue that current state-of-the-art integrative methods provide the\nessential groundwork for developing the next generation of large-scale,\npre-trained models poised to further revolutionize oncology. To the best of our\nknowledge, this is the first review to systematically map the transition from\nconventional ML to advanced FM for multimodal data integration in oncology,\nwhile also framing these developments as foundational for the forthcoming era\nof large-scale AI models in cancer research."}
{"id": "2507.09272", "pdf": "https://arxiv.org/pdf/2507.09272", "abs": "https://arxiv.org/abs/2507.09272", "authors": ["Xiaoxian Tang", "Yihan Wang", "Jiandong Zhang"], "title": "Degeneracy of Zero-one Reaction Networks", "categories": ["q-bio.MN", "math.DS"], "comment": null, "summary": "Zero-one biochemical reaction networks are widely recognized for their\nimportance in analyzing signal transduction and cellular decision-making\nprocesses. Degenerate networks reveal non-standard behaviors and mark the\nboundary where classical methods fail. Their analysis is key to understanding\nexceptional dynamical phenomena in biochemical systems. Therefore, we focus on\ninvestigating the degeneracy of zero-one reaction networks. It is known that\none-dimensional zero-one networks cannot degenerate. In this work, we identify\nall degenerate two-dimensional zero-one reaction networks with up to three\nspecies by an efficient algorithm. By analyzing the structure of these\nnetworks, we arrive at the following conclusion: if a two-dimensional zero-one\nreaction network with three species is degenerate, then its steady-state system\nis equivalent to a binomial system."}
{"id": "2507.10136", "pdf": "https://arxiv.org/pdf/2507.10136", "abs": "https://arxiv.org/abs/2507.10136", "authors": ["Zhonglin Liu"], "title": "A PBN-RL-XAI Framework for Discovering a \"Hit-and-Run'' Therapeutic Strategy in Melanoma", "categories": ["q-bio.QM", "cs.AI"], "comment": "9 pages, 5 figures. Submitted to the IEEE International Conference on\n  Bioinformatics and Biomedicine (BIBM) 2025. Code is available at\n  https://github.com/Liu-Zhonglin/pbn-melanoma-project", "summary": "Innate resistance to anti-PD-1 immunotherapy remains a major clinical\nchallenge in metastatic melanoma, with the underlying molecular networks being\npoorly understood. To address this, we constructed a dynamic Probabilistic\nBoolean Network model using transcriptomic data from patient tumor biopsies to\nelucidate the regulatory logic governing therapy response. We then employed a\nreinforcement learning agent to systematically discover optimal, multi-step\ntherapeutic interventions and used explainable artificial intelligence to\nmechanistically interpret the agent's control policy. The analysis revealed\nthat a precisely timed, 4-step temporary inhibition of the lysyl oxidase like 2\nprotein (LOXL2) was the most effective strategy. Our explainable analysis\nshowed that this ``hit-and-run\" intervention is sufficient to erase the\nmolecular signature driving resistance, allowing the network to self-correct\nwithout requiring sustained intervention. This study presents a novel,\ntime-dependent therapeutic hypothesis for overcoming immunotherapy resistance\nand provides a powerful computational framework for identifying non-obvious\nintervention protocols in complex biological systems."}
{"id": "2507.09173", "pdf": "https://arxiv.org/pdf/2507.09173", "abs": "https://arxiv.org/abs/2507.09173", "authors": ["Mengjie Chen", "Ming Zhang", "Cunquan Qu"], "title": "Towards Interpretable Drug-Drug Interaction Prediction: A Graph-Based Approach with Molecular and Network-Level Explanations", "categories": ["cs.LG", "cs.AI", "q-bio.MN"], "comment": null, "summary": "Drug-drug interactions (DDIs) represent a critical challenge in pharmacology,\noften leading to adverse drug reactions with significant implications for\npatient safety and healthcare outcomes. While graph-based methods have achieved\nstrong predictive performance, most approaches treat drug pairs independently,\noverlooking the complex, context-dependent interactions unique to drug pairs.\nAdditionally, these models struggle to integrate biological interaction\nnetworks and molecular-level structures to provide meaningful mechanistic\ninsights. In this study, we propose MolecBioNet, a novel graph-based framework\nthat integrates molecular and biomedical knowledge for robust and interpretable\nDDI prediction. By modeling drug pairs as unified entities, MolecBioNet\ncaptures both macro-level biological interactions and micro-level molecular\ninfluences, offering a comprehensive perspective on DDIs. The framework\nextracts local subgraphs from biomedical knowledge graphs and constructs\nhierarchical interaction graphs from molecular representations, leveraging\nclassical graph neural network methods to learn multi-scale representations of\ndrug pairs. To enhance accuracy and interpretability, MolecBioNet introduces\ntwo domain-specific pooling strategies: context-aware subgraph pooling\n(CASPool), which emphasizes biologically relevant entities, and\nattention-guided influence pooling (AGIPool), which prioritizes influential\nmolecular substructures. The framework further employs mutual information\nminimization regularization to enhance information diversity during embedding\nfusion. Experimental results demonstrate that MolecBioNet outperforms\nstate-of-the-art methods in DDI prediction, while ablation studies and\nembedding visualizations further validate the advantages of unified drug pair\nmodeling and multi-scale knowledge integration."}
{"id": "2507.09011", "pdf": "https://arxiv.org/pdf/2507.09011", "abs": "https://arxiv.org/abs/2507.09011", "authors": ["Ana Chkhaidze", "Reshanne R. Reeder", "Connor Gag", "Anastasia Kiyonaga", "Seana Coulson"], "title": "Beyond vividness: Content analysis of induced hallucinations reveals the hidden structure of individual differences in visual imagery", "categories": ["cs.CL", "q-bio.NC", "q-bio.QM"], "comment": null, "summary": "A rapidly alternating red and black display known as Ganzflicker induces\nvisual hallucinations that reflect the generative capacity of the visual\nsystem. Recent proposals regarding the imagery spectrum, that is, differences\nin the visual system of individuals with absent imagery, typical imagery, and\nvivid imagery, suggest these differences should impact the complexity of other\ninternally generated visual experiences. Here, we used tools from natural\nlanguage processing to analyze free-text descriptions of hallucinations from\nover 4,000 participants, asking whether people with different imagery\nphenotypes see different things in their mind's eye during Ganzflicker-induced\nhallucinations. Strong imagers described complex, naturalistic content, while\nweak imagers reported simple geometric patterns. Embeddings from vision\nlanguage models better captured these differences than text-only language\nmodels, and participants with stronger imagery used language with richer\nsensorimotor associations. These findings may reflect individual variation in\ncoordination between early visual areas and higher-order regions relevant for\nthe imagery spectrum."}
{"id": "2507.09943", "pdf": "https://arxiv.org/pdf/2507.09943", "abs": "https://arxiv.org/abs/2507.09943", "authors": ["Shesha Gopal Marehalli Srinivas", "Massimiliano Esposito", "Nahuel Freitas"], "title": "Hypergraph-Based Models of Random Chemical Reaction Networks: Conservation Laws, Connectivity, and Percolation", "categories": ["cond-mat.stat-mech", "q-bio.MN"], "comment": "30 pages, 30 figures", "summary": "Random graph models have been instrumental in characterizing complex\nnetworks, but chemical reaction networks (CRNs) are better represented as\nhypergraphs. Traditional models of random CRNs often reduce CRNs to bipartite\ngraphs, representing species and reactions as distinct nodes, or simpler\nderived graphs, which can obscure the relationship between the statistical\nproperties of these representations and the physical characteristics of the\nCRN. We introduce a straightforward model for generating random CRNs that\npreserves their hypergraph structure as well as atomic composition, enabling\nthe direct study of chemically relevant features. Notably, our approach\ndistinguishes two notions of connectivity that are equivalent in graphs but\ndiffer fundamentally in hypergraphs. These notions exhibit percolation-like\nphase transitions, which we analyze in detail. The first type of connectivity\nhas relevance to steady-state synthesis and transduction, determining the\neffective reactions an open CRN can perform at steady state. The second type is\nsuitable to identify which species can be produced from a given initial set of\nspecies in a closed CRN. Our findings highlight the importance of\nhypergraph-based modeling for uncovering the complex behaviors of CRNs."}
{"id": "2507.09466", "pdf": "https://arxiv.org/pdf/2507.09466", "abs": "https://arxiv.org/abs/2507.09466", "authors": ["Tomas Geffner", "Kieran Didi", "Zhonglin Cao", "Danny Reidenbach", "Zuobai Zhang", "Christian Dallago", "Emine Kucukbenli", "Karsten Kreis", "Arash Vahdat"], "title": "La-Proteina: Atomistic Protein Generation via Partially Latent Flow Matching", "categories": ["cs.LG", "q-bio.QM", "I.2.1"], "comment": null, "summary": "Recently, many generative models for de novo protein structure design have\nemerged. Yet, only few tackle the difficult task of directly generating fully\natomistic structures jointly with the underlying amino acid sequence. This is\nchallenging, for instance, because the model must reason over side chains that\nchange in length during generation. We introduce La-Proteina for atomistic\nprotein design based on a novel partially latent protein representation: coarse\nbackbone structure is modeled explicitly, while sequence and atomistic details\nare captured via per-residue latent variables of fixed dimensionality, thereby\neffectively side-stepping challenges of explicit side-chain representations.\nFlow matching in this partially latent space then models the joint distribution\nover sequences and full-atom structures. La-Proteina achieves state-of-the-art\nperformance on multiple generation benchmarks, including all-atom\nco-designability, diversity, and structural validity, as confirmed through\ndetailed structural analyses and evaluations. Notably, La-Proteina also\nsurpasses previous models in atomistic motif scaffolding performance, unlocking\ncritical atomistic structure-conditioned protein design tasks. Moreover,\nLa-Proteina is able to generate co-designable proteins of up to 800 residues, a\nregime where most baselines collapse and fail to produce valid samples,\ndemonstrating La-Proteina's scalability and robustness."}
{"id": "2507.09651", "pdf": "https://arxiv.org/pdf/2507.09651", "abs": "https://arxiv.org/abs/2507.09651", "authors": ["Alberto Bocchinfuso", "Daniela Calvetti", "Erkki Somersalo"], "title": "Bayesian dictionary learning estimation of cell membrane permeability from surface pH data", "categories": ["math.NA", "cs.NA", "q-bio.QM"], "comment": null, "summary": "Gas transport across cell membrane is a very important process in\nbiochemistry which is essential for many crucial tasks, including cell\nrespiration pH regulation in the cell. In the late 1990's, the suggestion that\ngasses are transported via preferred gas channels embedded into the cell\nmembrane challenged the century old Overton's theory that gases pass through\nthe lipid cell membrane by diffusing across the concentration gradient. Since\nexperimental evidence alone does not provide enough evidence to favor one of\nthe proposed mechanisms, mathematical models have been introduced to provide a\ncontext for the interpretation of laboratory measurement. Following up on\nprevious work where the membrane permeability was estimated using particle\nfilter, in this article we propose an algorithm based on dictionary learning\nfor estimating cell membrane permeability. Computed examples illustrate that\nthe novel approach, which can be applied when the properties of the membrane do\nnot change in the course of the data collection process, is computationally\nmuch more efficient than particle filter."}
{"id": "2507.09753", "pdf": "https://arxiv.org/pdf/2507.09753", "abs": "https://arxiv.org/abs/2507.09753", "authors": ["Ewa M. Nowara", "Joshua Rackers", "Patricia Suriana", "Pan Kessel", "Max Shen", "Andrew Martin Watkins", "Michael Maser"], "title": "Do we need equivariant models for molecule generation?", "categories": ["cs.LG", "q-bio.QM"], "comment": null, "summary": "Deep generative models are increasingly used for molecular discovery, with\nmost recent approaches relying on equivariant graph neural networks (GNNs)\nunder the assumption that explicit equivariance is essential for generating\nhigh-quality 3D molecules. However, these models are complex, difficult to\ntrain, and scale poorly.\n  We investigate whether non-equivariant convolutional neural networks (CNNs)\ntrained with rotation augmentations can learn equivariance and match the\nperformance of equivariant models. We derive a loss decomposition that\nseparates prediction error from equivariance error, and evaluate how model\nsize, dataset size, and training duration affect performance across denoising,\nmolecule generation, and property prediction. To our knowledge, this is the\nfirst study to analyze learned equivariance in generative tasks."}
{"id": "2507.09947", "pdf": "https://arxiv.org/pdf/2507.09947", "abs": "https://arxiv.org/abs/2507.09947", "authors": ["Eric Herrison Gyamfi"], "title": "Modeling Cholera Dynamics with Vaccination as the Control Strategy and Seasonal-forcing Transmission", "categories": ["q-bio.PE", "q-bio.QM"], "comment": null, "summary": "This study presents a seasonally forced cholera model that incorporates\nimperfect vaccination as a control strategy. The model captures the temporal\ndynamics of susceptible, vaccinated, infected, and recovered individuals, as\nwell as the environmental pathogen concentration. A key focus is the\ninstantaneous reproduction number, which serves as a threshold indicator for\noutbreak persistence or elimination. When reproduction number, the disease-free\nequilibrium is attainable; otherwise, endemic conditions persist. We conduct a\nsensitivity analysis to evaluate the influence of two critical parameters: the\nvaccination rate and the waning rate of immunity. Results show that increasing\nthe vaccination rate and reducing the waning rate significantly decrease\nreproduction number, reinforcing the importance of sustained vaccine efficacy.\nSeasonal forcing amplifies the complexity of cholera dynamics, revealing the\nneed for timely public health interventions, especially before\nhigh-transmission periods. This model demonstrates practical applicability in\ninforming vaccination strategies, especially in resource-limited settings prone\nto seasonal outbreaks. It offers a flexible framework for public health\nplanning, adaptable to other waterborne diseases. The findings suggest that\nintegrated approaches combining vaccination, improved sanitation, and targeted\neducation are essential to reducing cholera transmission and achieving\nlong-term control."}
{"id": "2507.09996", "pdf": "https://arxiv.org/pdf/2507.09996", "abs": "https://arxiv.org/abs/2507.09996", "authors": ["Quentin Dessain", "Nicolas Delinte", "Bernard Hanseeuw", "Laurence Dricot", "Benoît Macq"], "title": "Leveraging Swin Transformer for enhanced diagnosis of Alzheimer's disease using multi-shell diffusion MRI", "categories": ["cs.CV", "q-bio.NC", "q-bio.QM"], "comment": null, "summary": "Objective: This study aims to support early diagnosis of Alzheimer's disease\nand detection of amyloid accumulation by leveraging the microstructural\ninformation available in multi-shell diffusion MRI (dMRI) data, using a vision\ntransformer-based deep learning framework.\n  Methods: We present a classification pipeline that employs the Swin\nTransformer, a hierarchical vision transformer model, on multi-shell dMRI data\nfor the classification of Alzheimer's disease and amyloid presence. Key metrics\nfrom DTI and NODDI were extracted and projected onto 2D planes to enable\ntransfer learning with ImageNet-pretrained models. To efficiently adapt the\ntransformer to limited labeled neuroimaging data, we integrated Low-Rank\nAdaptation. We assessed the framework on diagnostic group prediction\n(cognitively normal, mild cognitive impairment, Alzheimer's disease dementia)\nand amyloid status classification.\n  Results: The framework achieved competitive classification results within the\nscope of multi-shell dMRI-based features, with the best balanced accuracy of\n95.2% for distinguishing cognitively normal individuals from those with\nAlzheimer's disease dementia using NODDI metrics. For amyloid detection, it\nreached 77.2% balanced accuracy in distinguishing amyloid-positive mild\ncognitive impairment/Alzheimer's disease dementia subjects from\namyloid-negative cognitively normal subjects, and 67.9% for identifying\namyloid-positive individuals among cognitively normal subjects. Grad-CAM-based\nexplainability analysis identified clinically relevant brain regions, including\nthe parahippocampal gyrus and hippocampus, as key contributors to model\npredictions.\n  Conclusion: This study demonstrates the promise of diffusion MRI and\ntransformer-based architectures for early detection of Alzheimer's disease and\namyloid pathology, supporting biomarker-driven diagnostics in data-limited\nbiomedical settings."}
{"id": "2507.10400", "pdf": "https://arxiv.org/pdf/2507.10400", "abs": "https://arxiv.org/abs/2507.10400", "authors": ["Nicholas Casetti", "Dylan Anstine", "Olexandr Isayev", "Connor W. Coley"], "title": "Anticipating the Selectivity of Cyclization Reaction Pathways with Neural Network Potentials", "categories": ["cs.LG", "q-bio.QM"], "comment": "32 pages, 5 figures", "summary": "Reaction mechanism search tools have demonstrated the ability to provide\ninsights into likely products and rate-limiting steps of reacting systems.\nHowever, reactions involving several concerted bond changes - as can be found\nin many key steps of natural product synthesis - can complicate the search\nprocess. To mitigate these complications, we present a mechanism search\nstrategy particularly suited to help expedite exploration of an exemplary\nfamily of such complex reactions, cyclizations. We provide a cost-effective\nstrategy for identifying relevant elementary reaction steps by combining\ngraph-based enumeration schemes and machine learning techniques for\nintermediate filtering. Key to this approach is our use of a neural network\npotential (NNP), AIMNet2-rxn, for computational evaluation of each candidate\nreaction pathway. In this article, we evaluate the NNP's ability to estimate\nactivation energies, demonstrate the correct anticipation of stereoselectivity,\nand recapitulate complex enabling steps in natural product synthesis."}
