{"id": "2508.08014", "pdf": "https://arxiv.org/pdf/2508.08014", "abs": "https://arxiv.org/abs/2508.08014", "authors": ["Ryuichiro Nakato", "Luis Augusto Eijy Nagai"], "title": "ShortCake: An integrated platform for efficient and reproducible single-cell analysis", "categories": ["q-bio.GN"], "comment": null, "summary": "Motivation: Recent advances in single-cell analysis have introduced new\ncomputational challenges. Researchers often need to use multiple analysis tools\nwritten in different programming languages while managing version conflicts\nbetween related packages within a single workflow. For the research community,\nminimizing the time spent on environment setup and installation issues is\nessential. Results: We present ShortCake, a containerized platform that\nintegrates a suite of single-cell analysis tools written in R and Python.\nShortCake isolates competing Python tools into separate virtual environments\nthat can be easily accessed within a Jupyter notebook. This enables users to\neffortlessly transition between various environments, including R, even within\na single notebook. Additionally, ShortCake offers multiple ``flavors,''\nenabling users to select container images tailored to their specific needs.\nShortCake provides a unified environment with fixed versions of various tools,\nthus streamlining workflows, reducing setup time, and improving\nreproducibility. Availability and implementation: The ShortCake image is\navailable on DockerHub (https://hub.docker.com/r/rnakato/shortcake). The source\ncode is available on GitHub (https://github.com/rnakato/ShortCake)."}
{"id": "2508.07043", "pdf": "https://arxiv.org/pdf/2508.07043", "abs": "https://arxiv.org/abs/2508.07043", "authors": ["Orion Li", "Vinayak Agarwal", "Summer Zhou", "Ashwin Gopinath", "Timothy Kassis"], "title": "K-Dense Analyst: Towards Fully Automated Scientific Analysis", "categories": ["cs.AI", "cs.MA", "q-bio.GN", "q-bio.QM"], "comment": null, "summary": "The complexity of modern bioinformatics analysis has created a critical gap\nbetween data generation and developing scientific insights. While large\nlanguage models (LLMs) have shown promise in scientific reasoning, they remain\nfundamentally limited when dealing with real-world analytical workflows that\ndemand iterative computation, tool integration and rigorous validation. We\nintroduce K-Dense Analyst, a hierarchical multi-agent system that achieves\nautonomous bioinformatics analysis through a dual-loop architecture. K-Dense\nAnalyst, part of the broader K-Dense platform, couples planning with validated\nexecution using specialized agents to decompose complex objectives into\nexecutable, verifiable tasks within secure computational environments. On\nBixBench, a comprehensive benchmark for open-ended biological analysis, K-Dense\nAnalyst achieves 29.2% accuracy, surpassing the best-performing language model\n(GPT-5) by 6.3 percentage points, representing nearly 27% improvement over what\nis widely considered the most powerful LLM available. Remarkably, K-Dense\nAnalyst achieves this performance using Gemini 2.5 Pro, which attains only\n18.3% accuracy when used directly, demonstrating that our architectural\ninnovations unlock capabilities far beyond the underlying model's baseline\nperformance. Our insights demonstrate that autonomous scientific reasoning\nrequires more than enhanced language models, it demands purpose-built systems\nthat can bridge the gap between high-level scientific objectives and low-level\ncomputational execution. These results represent a significant advance toward\nfully autonomous computational biologists capable of accelerating discovery\nacross the life sciences."}
{"id": "2508.07127", "pdf": "https://arxiv.org/pdf/2508.07127", "abs": "https://arxiv.org/abs/2508.07127", "authors": ["Niranjana Arun Menon", "Iqra Farooq", "Yulong Li", "Sara Ahmed", "Yutong Xie", "Muhammad Awais", "Imran Razzak"], "title": "How Effectively Can Large Language Models Connect SNP Variants and ECG Phenotypes for Cardiovascular Risk Prediction?", "categories": ["cs.LG", "q-bio.GN"], "comment": null, "summary": "Cardiovascular disease (CVD) prediction remains a tremendous challenge due to\nits multifactorial etiology and global burden of morbidity and mortality.\nDespite the growing availability of genomic and electrophysiological data,\nextracting biologically meaningful insights from such high-dimensional, noisy,\nand sparsely annotated datasets remains a non-trivial task. Recently, LLMs has\nbeen applied effectively to predict structural variations in biological\nsequences. In this work, we explore the potential of fine-tuned LLMs to predict\ncardiac diseases and SNPs potentially leading to CVD risk using genetic markers\nderived from high-throughput genomic profiling. We investigate the effect of\ngenetic patterns associated with cardiac conditions and evaluate how LLMs can\nlearn latent biological relationships from structured and semi-structured\ngenomic data obtained by mapping genetic aspects that are inherited from the\nfamily tree. By framing the problem as a Chain of Thought (CoT) reasoning task,\nthe models are prompted to generate disease labels and articulate informed\nclinical deductions across diverse patient profiles and phenotypes. The\nfindings highlight the promise of LLMs in contributing to early detection, risk\nassessment, and ultimately, the advancement of personalized medicine in cardiac\ncare."}
{"id": "2508.07465", "pdf": "https://arxiv.org/pdf/2508.07465", "abs": "https://arxiv.org/abs/2508.07465", "authors": ["Tiantian Yang", "Zhiqian Chen"], "title": "MOTGNN: Interpretable Graph Neural Networks for Multi-Omics Disease Classification", "categories": ["cs.LG", "q-bio.GN", "stat.ML", "62R07"], "comment": "11 pages, 6 figures", "summary": "Integrating multi-omics data, such as DNA methylation, mRNA expression, and\nmicroRNA (miRNA) expression, offers a comprehensive view of the biological\nmechanisms underlying disease. However, the high dimensionality and complex\ninteractions among omics layers present major challenges for predictive\nmodeling. We propose Multi-Omics integration with Tree-generated Graph Neural\nNetwork (MOTGNN), a novel and interpretable framework for binary disease\nclassification. MOTGNN employs eXtreme Gradient Boosting (XGBoost) to perform\nomics-specific supervised graph construction, followed by modality-specific\nGraph Neural Networks (GNNs) for hierarchical representation learning, and a\ndeep feedforward network for cross-omics integration. On three real-world\ndisease datasets, MOTGNN outperforms state-of-the-art baselines by 5-10% in\naccuracy, ROC-AUC, and F1-score, and remains robust to severe class imbalance\n(e.g., 87.2% vs. 33.4% F1 on imbalanced data). The model maintains\ncomputational efficiency through sparse graphs (2.1-2.8 edges per node) and\nprovides built-in interpretability, revealing both top-ranked biomarkers and\nthe relative contributions of each omics modality. These results highlight\nMOTGNN's potential to improve both predictive accuracy and interpretability in\nmulti-omics disease modeling."}
{"id": "2508.06576", "pdf": "https://arxiv.org/pdf/2508.06576", "abs": "https://arxiv.org/abs/2508.06576", "authors": ["Azmine Toushik Wasi"], "title": "GFlowNets for Learning Better Drug-Drug Interaction Representations", "categories": ["cs.LG", "q-bio.BM", "q-bio.MN"], "comment": "Accepted to ICANN 2025:AIDD", "summary": "Drug-drug interactions pose a significant challenge in clinical pharmacology,\nwith severe class imbalance among interaction types limiting the effectiveness\nof predictive models. Common interactions dominate datasets, while rare but\ncritical interactions remain underrepresented, leading to poor model\nperformance on infrequent cases. Existing methods often treat DDI prediction as\na binary problem, ignoring class-specific nuances and exacerbating bias toward\nfrequent interactions. To address this, we propose a framework combining\nGenerative Flow Networks (GFlowNet) with Variational Graph Autoencoders (VGAE)\nto generate synthetic samples for rare classes, improving model balance and\ngenerate effective and novel DDI pairs. Our approach enhances predictive\nperformance across interaction types, ensuring better clinical reliability."}
{"id": "2508.06917", "pdf": "https://arxiv.org/pdf/2508.06917", "abs": "https://arxiv.org/abs/2508.06917", "authors": ["Jianting Tang", "Yubo Wang", "Haoyu Cao", "Linli Xu"], "title": "CROP: Integrating Topological and Spatial Structures via Cross-View Prefixes for Molecular LLMs", "categories": ["q-bio.QM", "cs.AI"], "comment": "Accepted to ACMMM 2025", "summary": "Recent advances in molecular science have been propelled significantly by\nlarge language models (LLMs). However, their effectiveness is limited when\nrelying solely on molecular sequences, which fail to capture the complex\nstructures of molecules. Beyond sequence representation, molecules exhibit two\ncomplementary structural views: the first focuses on the topological\nrelationships between atoms, as exemplified by the graph view; and the second\nemphasizes the spatial configuration of molecules, as represented by the image\nview. The two types of views provide unique insights into molecular structures.\nTo leverage these views collaboratively, we propose the CROss-view Prefixes\n(CROP) to enhance LLMs' molecular understanding through efficient multi-view\nintegration. CROP possesses two advantages: (i) efficiency: by jointly\nresampling multiple structural views into fixed-length prefixes, it avoids\nexcessive consumption of the LLM's limited context length and allows easy\nexpansion to more views; (ii) effectiveness: by utilizing the LLM's\nself-encoded molecular sequences to guide the resampling process, it boosts the\nquality of the generated prefixes. Specifically, our framework features a\ncarefully designed SMILES Guided Resampler for view resampling, and a\nStructural Embedding Gate for converting the resulting embeddings into LLM's\nprefixes. Extensive experiments demonstrate the superiority of CROP in tasks\nincluding molecule captioning, IUPAC name prediction and molecule property\nprediction."}
{"id": "2508.06641", "pdf": "https://arxiv.org/pdf/2508.06641", "abs": "https://arxiv.org/abs/2508.06641", "authors": ["Jonas S Almeida", "Daniel E Russ", "Susana Vinga", "Ines Duarte", "Lee Mason", "Praphulla Bhawsar", "Aaron Ge", "Arlindo Oliveira", "Jeya Balaji Balasubramanian"], "title": "Fractal Language Modelling by Universal Sequence Maps (USM)", "categories": ["cs.LG", "cs.AI", "cs.NA", "math.NA", "q-bio.QM"], "comment": "16 pages, 8 figures", "summary": "Motivation: With the advent of Language Models using Transformers,\npopularized by ChatGPT, there is a renewed interest in exploring encoding\nprocedures that numerically represent symbolic sequences at multiple scales and\nembedding dimensions. The challenge that encoding addresses is the need for\nmechanisms that uniquely retain contextual information about the succession of\nindividual symbols, which can then be modeled by nonlinear formulations such as\nneural networks.\n  Context: Universal Sequence Maps(USM) are iterated functions that bijectively\nencode symbolic sequences onto embedded numerical spaces. USM is composed of\ntwo Chaos Game Representations (CGR), iterated forwardly and backwardly, that\ncan be projected into the frequency domain (FCGR). The corresponding USM\ncoordinates can be used to compute a Chebyshev distance metric as well as k-mer\nfrequencies, without having to recompute the embedded numeric coordinates, and,\nparadoxically, allowing for non-integers values of k.\n  Results: This report advances the bijective fractal encoding by Universal\nSequence Maps (USM) by resolving seeding biases affecting the iterated process.\nThe resolution had two results, the first expected, the second an intriguing\noutcome: 1) full reconciliation of numeric positioning with sequence identity;\nand 2) uncovering the nature of USM as an efficient numeric process converging\ntowards a steady state sequence embedding solution. We illustrate these results\nfor genomic sequences because of the convenience of a planar representation\ndefined by an alphabet with only 4 tokens (the 4 nucleotides). Nevertheless,\nthe application to alphabet of arbitrary cardinality was found to be\nstraightforward."}
{"id": "2508.06747", "pdf": "https://arxiv.org/pdf/2508.06747", "abs": "https://arxiv.org/abs/2508.06747", "authors": ["Maria Alejandra Valdez Cabrera", "Amy D Willis"], "title": "Geometry of the space of phylogenetic trees with non-identical leaves", "categories": ["q-bio.PE", "math.MG", "q-bio.QM", "51F99"], "comment": null, "summary": "Phylogenetic trees summarize evolutionary relationships. The\nBillera-Holmes-Vogtmann (BHV) space for comparing phylogenetic trees has many\nelegant mathematical properties, but it does not encompass trees with differing\nleaf sets. To overcome this, we introduce Towering space: a complete metric\nspace that extends BHV space to trees with non-identical leaf sets. Towering\nspace is a structured collection of BHV spaces connected via pruning and\nregrafting operations. We study the geometry of paths in Towering space and\npresent an algorithm for computing metric distances. By addressing a major\nlimitation of BHV space, Towering space facilitates the analysis of modern\nphylogenetic datasets such as multi-domain gene trees."}
{"id": "2508.07032", "pdf": "https://arxiv.org/pdf/2508.07032", "abs": "https://arxiv.org/abs/2508.07032", "authors": ["Tiantian He", "Keyue Jiang", "An Zhao", "Anna Schroder", "Elinor Thompson", "Sonja Soskic", "Frederik Barkhof", "Daniel C. Alexander"], "title": "A Stage-Aware Mixture of Experts Framework for Neurodegenerative Disease Progression Modelling", "categories": ["cs.LG", "q-bio.QM"], "comment": null, "summary": "The long-term progression of neurodegenerative diseases is commonly\nconceptualized as a spatiotemporal diffusion process that consists of a graph\ndiffusion process across the structural brain connectome and a localized\nreaction process within brain regions. However, modeling this progression\nremains challenging due to 1) the scarcity of longitudinal data obtained\nthrough irregular and infrequent subject visits and 2) the complex interplay of\npathological mechanisms across brain regions and disease stages, where\ntraditional models assume fixed mechanisms throughout disease progression. To\naddress these limitations, we propose a novel stage-aware Mixture of Experts\n(MoE) framework that explicitly models how different contributing mechanisms\ndominate at different disease stages through time-dependent expert\nweighting.Data-wise, we utilize an iterative dual optimization method to\nproperly estimate the temporal position of individual observations,\nconstructing a co hort-level progression trajectory from irregular snapshots.\nModel-wise, we enhance the spatial component with an inhomogeneous graph neural\ndiffusion model (IGND) that allows diffusivity to vary based on node states and\ntime, providing more flexible representations of brain networks. We also\nintroduce a localized neural reaction module to capture complex dynamics beyond\nstandard processes.The resulting IGND-MoE model dynamically integrates these\ncomponents across temporal states, offering a principled way to understand how\nstage-specific pathological mechanisms contribute to progression. The\nstage-wise weights yield novel clinical insights that align with literature,\nsuggesting that graph-related processes are more influential at early stages,\nwhile other unknown physical processes become dominant later on."}
{"id": "2508.07043", "pdf": "https://arxiv.org/pdf/2508.07043", "abs": "https://arxiv.org/abs/2508.07043", "authors": ["Orion Li", "Vinayak Agarwal", "Summer Zhou", "Ashwin Gopinath", "Timothy Kassis"], "title": "K-Dense Analyst: Towards Fully Automated Scientific Analysis", "categories": ["cs.AI", "cs.MA", "q-bio.GN", "q-bio.QM"], "comment": null, "summary": "The complexity of modern bioinformatics analysis has created a critical gap\nbetween data generation and developing scientific insights. While large\nlanguage models (LLMs) have shown promise in scientific reasoning, they remain\nfundamentally limited when dealing with real-world analytical workflows that\ndemand iterative computation, tool integration and rigorous validation. We\nintroduce K-Dense Analyst, a hierarchical multi-agent system that achieves\nautonomous bioinformatics analysis through a dual-loop architecture. K-Dense\nAnalyst, part of the broader K-Dense platform, couples planning with validated\nexecution using specialized agents to decompose complex objectives into\nexecutable, verifiable tasks within secure computational environments. On\nBixBench, a comprehensive benchmark for open-ended biological analysis, K-Dense\nAnalyst achieves 29.2% accuracy, surpassing the best-performing language model\n(GPT-5) by 6.3 percentage points, representing nearly 27% improvement over what\nis widely considered the most powerful LLM available. Remarkably, K-Dense\nAnalyst achieves this performance using Gemini 2.5 Pro, which attains only\n18.3% accuracy when used directly, demonstrating that our architectural\ninnovations unlock capabilities far beyond the underlying model's baseline\nperformance. Our insights demonstrate that autonomous scientific reasoning\nrequires more than enhanced language models, it demands purpose-built systems\nthat can bridge the gap between high-level scientific objectives and low-level\ncomputational execution. These results represent a significant advance toward\nfully autonomous computational biologists capable of accelerating discovery\nacross the life sciences."}
{"id": "2508.07427", "pdf": "https://arxiv.org/pdf/2508.07427", "abs": "https://arxiv.org/abs/2508.07427", "authors": ["Emanuele Cavalleri", "Paolo Perlasca", "Marco Mesiti"], "title": "RNA-KG v2.0: An RNA-centered Knowledge Graph with Properties", "categories": ["cs.DB", "q-bio.QM"], "comment": null, "summary": "RNA-KG is a recently developed knowledge graph that integrates the\ninteractions involving coding and non-coding RNA molecules extracted from\npublic data sources. It can be used to support the classification of new\nmolecules, identify new interactions through the use of link prediction\nmethods, and reveal hidden patterns among the represented entities. In this\npaper, we propose RNA-KG v2.0, a new release of RNA-KG that integrates around\n100M manually curated interactions sourced from 91 linked open data\nrepositories and ontologies. Relationships are characterized by standardized\nproperties that capture the specific context (e.g., cell line, tissue,\npathological state) in which they have been identified. In addition, the nodes\nare enriched with detailed attributes, such as descriptions, synonyms, and\nmolecular sequences sourced from platforms such as OBO ontologies, NCBI\nrepositories, RNAcentral, and Ensembl. The enhanced repository enables the\nexpression of advanced queries that take into account the context in which the\nexperiments were conducted. It also supports downstream applications in RNA\nresearch, including \"context-aware\" link prediction techniques that combine\nboth topological and semantic information."}
{"id": "2508.07789", "pdf": "https://arxiv.org/pdf/2508.07789", "abs": "https://arxiv.org/abs/2508.07789", "authors": ["David L Miller"], "title": "Modelling phenology using ordered categorical generalized additive models", "categories": ["stat.ME", "q-bio.QM"], "comment": "https://gitlab.bioss.ac.uk/dmiller/ocat-paper for source", "summary": "One form of data collected in ecology is phenological, describing the timing\nof life stages. It can be tempting to analyze such data using a continuous\ndistribution or to model individual transitions via probit/logit models. Such\nsimplifications can lead to incorrect inference in various ways, all of which\nstem from ignoring the natural structure of the data. This paper presents a\nflexible approach to modelling ordered categorical data using the popular R\npackage `mgcv`. An example analysis of saxifrage phenology in Greenland\nincluding useful plots, model checking and derived quantities is included."}
{"id": "2508.07915", "pdf": "https://arxiv.org/pdf/2508.07915", "abs": "https://arxiv.org/abs/2508.07915", "authors": ["David L Miller", "Ken Newman", "Thomas Cornulier"], "title": "Adding structure to generalized additive models, with applications in ecology", "categories": ["stat.ME", "q-bio.QM"], "comment": "Supplementary material will be posted online once data access\n  agreements are in place", "summary": "Generalized additive models (GAMs) that connect a set of scalar covariates\nthat map 1-1 to a response variable are commonly employed in ecological and\nother scientific disciplines. However, covariates are often inherently\nnon-scalar, taking on multiple values for each observation of the response.\nThey can sometimes have a temporal structure, e.g., a time series of\ntemperature and precipitation measurements, or a spatial structure, e.g.,\nmultiple soil pH measurements made at nearby locations. While aggregating or\nselectively summarizing such covariates to yield a scalar covariate allows the\nuse of standard GAM fitting procedures, exactly how to do so can be\nproblematic, e.g., using a mean or median value for some subsequence of a time\nseries, and information is necessarily lost as well. On the other hand naively\nincluding all $p$ components of a vector-valued covariate as $p$ separate\ncovariates, say, without recognizing the structure, can lead to problems of\nmulticollinearity, data sets that are excessively wide given the sample size,\nand difficulty extracting the primary signal provided by the covariate. In this\npaper we introduce three useful extensions to GAMs that provide means of\nefficiently and effectively handling vector-valued covariates without requiring\none to choose problematic aggregations or selective summarizations. These\nextensions are varying-coefficient, scalar-on-function and distributed lag\nmodels. While these models have existed for some time they remain relatively\nunderused in ecology. This article aims to show when these models can be useful\nand how to fit them with the popular R package \\texttt{mgcv}."}
