{"id": "2511.08649", "pdf": "https://arxiv.org/pdf/2511.08649", "abs": "https://arxiv.org/abs/2511.08649", "authors": ["Yi Ni", "Liwei Zhu", "Shuai Li"], "title": "Bio AI Agent: A Multi-Agent Artificial Intelligence System for Autonomous CAR-T Cell Therapy Development with Integrated Target Discovery, Toxicity Prediction, and Rational Molecular Design", "categories": ["q-bio.QM", "cs.AI"], "comment": "12 pages, 0 figures", "summary": "Chimeric antigen receptor T-cell (CAR-T) therapy represents a paradigm shift in cancer treatment, yet development timelines of 8-12 years and clinical attrition rates exceeding 40-60% highlight critical inefficiencies in target selection, safety assessment, and molecular optimization. We present Bio AI Agent, a multi-agent artificial intelligence system powered by large language models that enables autonomous CAR-T development through collaborative specialized agents. The system comprises six autonomous agents: Target Selection Agent for multi-parametric antigen prioritization across >10,000 cancer-associated targets, Toxicity Prediction Agent for comprehensive safety profiling integrating tissue expression atlases and pharmacovigilance databases, Molecular Design Agent for rational CAR engineering, Patent Intelligence Agent for freedom-to-operate analysis, Clinical Translation Agent for regulatory compliance, and Decision Orchestration Agent for multi-agent coordination. Retrospective validation demonstrated autonomous identification of high-risk targets including FcRH5 (hepatotoxicity) and CD229 (off-tumor toxicity), patent infringement risks for CD38+SLAMF7 combinations, and generation of comprehensive development roadmaps. By enabling parallel processing, specialized reasoning, and autonomous decision-making superior to monolithic AI systems, Bio AI Agent addresses critical gaps in precision oncology development and has potential to accelerate translation of next-generation immunotherapies from discovery to clinic."}
{"id": "2511.09017", "pdf": "https://arxiv.org/pdf/2511.09017", "abs": "https://arxiv.org/abs/2511.09017", "authors": ["Jacob Desmond", "Ryan Wartmann", "Chng Wei Lau", "Steven Thomas", "Paul M. Middleton", "Jeewani Anupama Ginige"], "title": "OMOP ETL Framework for Semi-Structured Health Data", "categories": ["q-bio.QM"], "comment": null, "summary": "Healthcare data are generated in many different formats, which makes it difficult to integrate and reuse across institutions and studies. Standardisation is required to enable consistent large-scale analysis. The OMOP-CDM, developed by the OHDSI community, provides one widely adopted standard. Our framework achieves schema-agnostic transformation by extending upon existing literature in using human-readable YAML specification to support both relational (Microsoft SQL Server (MSSQL)) and document-based (MongoDB) data sources. It also incorporates critical production readiness features: provenance-aware mapping and support for incremental updates. We validated the pipeline using 2.7 million patient records and 27 million encounters across six hospitals spanning two decades of records. The resulting OMOP-CDM dataset demonstrated an acceptable level of data quality with a 97% overall passing rate based on the OHDSI Data Quality Dashboard check. Our work provides a reusable blueprint for large-scale data harmonisation, directly supporting real-world medical data research."}
{"id": "2511.08802", "pdf": "https://arxiv.org/pdf/2511.08802", "abs": "https://arxiv.org/abs/2511.08802", "authors": ["Maxime Fajgenblat", "Marc Herremans", "Pieter Vanormelingen", "Kristijn Swinnen", "Dirk Maes", "Robby Stoks", "Luc De Meester", "Christel Faes", "Thomas Neyens"], "title": "Backcasting biodiversity at high spatiotemporal resolution using flexible site-occupancy models for opportunistically sampled citizen science data", "categories": ["stat.AP", "q-bio.PE", "q-bio.QM"], "comment": null, "summary": "For many taxonomic groups, online biodiversity portals used by naturalists and citizen scientists constitute the primary source of distributional information. Over the last decade, site-occupancy models have been advanced as a promising framework to analyse such loosely structured, opportunistically collected datasets. Current approaches often ignore important aspects of the detection process and do not fully capitalise on the information present in these datasets, leaving opportunities for fine-grained spatiotemporal backcasting untouched. We propose a flexible Bayesian spatiotemporal site-occupancy model that aims to mimic the data-generating process that underlies common citizen science datasets sourced from public biodiversity portals, and yields rich biological output. We illustrate the use of the model to a dataset containing over 3M butterfly records in Belgium, collected through the citizen science data portal Observations.be. We show that the proposed approach enables retrospective predictions on the occupancy of species through time and space at high resolution, as well as inference on inter-annual distributional trends, range dynamics, habitat preferences, phenological patterns, detection patterns and observer heterogeneity. The proposed model can be used to increase the value of opportunistically collected data by naturalists and citizen scientists, and can aid the understanding of spatiotemporal dynamics of species for which rigorously collected data are absent or too costly to collect."}
{"id": "2511.08921", "pdf": "https://arxiv.org/pdf/2511.08921", "abs": "https://arxiv.org/abs/2511.08921", "authors": ["Shuting Jin", "Yi Jiang", "Yimin Liu", "Tengfei Ma", "Dongsheng Cao", "Leyi Wei", "Xiangrong Liu", "Xiangxiang Zeng"], "title": "DeepDR: an integrated deep-learning model web server for drug repositioning", "categories": ["cs.LG", "q-bio.QM"], "comment": "13 pages, 4 figures", "summary": "Background: Identifying new indications for approved drugs is a complex and time-consuming process that requires extensive knowledge of pharmacology, clinical data, and advanced computational methods. Recently, deep learning (DL) methods have shown their capability for the accurate prediction of drug repositioning. However, implementing DL-based modeling requires in-depth domain knowledge and proficient programming skills. Results: In this application, we introduce DeepDR, the first integrated platform that combines a variety of established DL-based models for disease- and target-specific drug repositioning tasks. DeepDR leverages invaluable experience to recommend candidate drugs, which covers more than 15 networks and a comprehensive knowledge graph that includes 5.9 million edges across 107 types of relationships connecting drugs, diseases, proteins/genes, pathways, and expression from six existing databases and a large scientific corpus of 24 million PubMed publications. Additionally, the recommended results include detailed descriptions of the recommended drugs and visualize key patterns with interpretability through a knowledge graph. Conclusion: DeepDR is free and open to all users without the requirement of registration. We believe it can provide an easy-to-use, systematic, highly accurate, and computationally automated platform for both experimental and computational scientists."}
{"id": "2511.09183", "pdf": "https://arxiv.org/pdf/2511.09183", "abs": "https://arxiv.org/abs/2511.09183", "authors": ["Alvaro Lanza", "Inés Martínez-Martín", "Rafael Tapia-Rojo", "Stefano Bo"], "title": "Measuring irreversibility in stochastic systems by categorizing single-molecule displacements", "categories": ["cond-mat.stat-mech", "q-bio.BM", "q-bio.QM"], "comment": "12 pages Main Text, 5 pages Appendix, 18 pages Supplementary Material", "summary": "Quantifying the irreversibility and dissipation of non-equilibrium processes is crucial to understanding their behavior, assessing their possible capabilities, and characterizing their efficiency. We introduce a physical quantity that quantifies the irreversibility of stochastic Langevin systems from the observation of individual molecules' displacements. Categorizing these displacements into a few groups based on their initial and final position allows us to measure irreversibility precisely without the need to know the forces and magnitude of the fluctuations acting on the system. Our model-free estimate of irreversibility is related to entropy production by a conditional fluctuation theorem and provides a lower bound to the average entropy production. We validate the method on single-molecule force spectroscopy experiments of proteins subject to force ramps. We show that irreversibility is sensitive to detailed features of the energy landscape underlying the protein folding dynamics and suggest how our methods can be employed to unveil key properties of protein folding processes."}
{"id": "2511.09216", "pdf": "https://arxiv.org/pdf/2511.09216", "abs": "https://arxiv.org/abs/2511.09216", "authors": ["Erik Hartman", "Jonas Wallin", "Johan Malmström", "Jimmy Olsson"], "title": "Controllable protein design through Feynman-Kac steering", "categories": ["cs.LG", "q-bio.QM", "stat.ML"], "comment": "15 pages, 6 figures", "summary": "Diffusion-based models have recently enabled the generation of realistic and diverse protein structures, yet they remain limited in their ability to steer outcomes toward specific functional or biochemical objectives, such as binding affinity or sequence composition. Here we extend the Feynman-Kac (FK) steering framework, an inference-time control approach, to diffusion-based protein design. By coupling FK steering with structure generation, the method guides sampling toward desirable structural or energetic features while maintaining the diversity of the underlying diffusion process. To enable simultaneous generation of both sequence and structure properties, rewards are computed on models refined through ProteinMPNN and all-atom relaxation. Applied to binder design, FK steering consistently improves predicted interface energetics across diverse targets with minimal computational overhead. More broadly, this work demonstrates that inference-time FK control generalizes diffusion-based protein design to arbitrary, non-differentiable, and reward-agnostic objectives, providing a unified and model-independent framework for guided molecular generation."}
