{"id": "2506.19866", "pdf": "https://arxiv.org/pdf/2506.19866", "abs": "https://arxiv.org/abs/2506.19866", "authors": ["Joyce Reimer", "Pranta Saha", "Chris Chen", "Neeraj Dhar", "Brook Byrns", "Steven Rayan", "Gordon Broderick"], "title": "GPU-accelerated Modeling of Biological Regulatory Networks", "categories": ["q-bio.MN", "math.OC", "q-bio.QM"], "comment": "10 pages, 5 figures, 2 tables; submitted to 16th ACM Conference on\n  Bioinformatics, Computational Biology, and Health Informatics (ACM BCB 2025)\n  as submission no. 6", "summary": "The complex regulatory dynamics of a biological network can be succinctly\ncaptured using discrete logic models. Given even sparse time-course data from\nthe system of interest, previous work has shown that global optimization\nschemes are suitable for proposing logic models that explain the data and make\npredictions about how the system will behave under varying conditions.\nConsidering the large scale of the parameter search spaces associated with\nthese regulatory systems, performance optimizations on the level of both\nhardware and software are necessary for making this a practical tool for in\nsilico pharmaceutical research. We show here how the implementation of these\nglobal optimization algorithms in a GPU-computing environment can accelerate\nthe solution of these parameter search problems considerably. We carry out\nparameter searches on two model biological regulatory systems that represent\nalmost an order of magnitude scale-up in complexity, and we find the gains in\nefficiency from GPU to be a 33%-43% improvement compared to multi-thread CPU\nimplementations and a 33%-1866% increase compared to CPU in serial. These\nimprovements make global optimization of logic model identification a far more\nattractive and feasible method for in silico hypothesis generation and design\nof experiments."}
{"id": "2506.19961", "pdf": "https://arxiv.org/pdf/2506.19961", "abs": "https://arxiv.org/abs/2506.19961", "authors": ["Jordan C. Rozum", "Hunter Ufford", "Alexandria K. Im", "Tong Zhang", "David D. Pollock", "Doo Nam Kim", "Song Feng"], "title": "ProCaliper: functional and structural analysis, visualization, and annotation of proteins", "categories": ["q-bio.BM", "q-bio.MN"], "comment": "4 pages, 1 figure, 1 table", "summary": "Understanding protein function at the molecular level requires connecting\nresidue-level annotations with physical and structural properties. This can be\ncumbersome and error-prone when functional annotation, computation of\nphysico-chemical properties, and structure visualization are separated. To\naddress this, we introduce ProCaliper, an open-source Python library for\ncomputing and visualizing physico-chemical properties of proteins. It can\nretrieve annotation and structure data from UniProt and AlphaFold databases,\ncompute residue-level properties such as charge, solvent accessibility, and\nprotonation state, and interactively visualize the results of these\ncomputations along with user-supplied residue-level data. Additionally,\nProCaliper incorporates functional and structural information to construct and\noptionally sparsify networks that encode the distance between residues and/or\nannotated functional sites or regions. The package ProCaliper and its source\ncode, along with the code used to generate the figures in this manuscript, are\nfreely available at https://github.com/PNNL-Predictive-Phenomics/ProCaliper."}
{"id": "2506.19966", "pdf": "https://arxiv.org/pdf/2506.19966", "abs": "https://arxiv.org/abs/2506.19966", "authors": ["C. Léon", "N. Brassard-Jollive", "D. Gonzalez-Rodriguez", "D. Riveline"], "title": "Tube into pearls: A membrane-driven pearling instability shapes platelet biogenesis", "categories": ["q-bio.QM"], "comment": null, "summary": "At the end of the 19th century, Rayleigh and Plateau explained the physical\nprinciple behind the fragmentation of a liquid jet into regular droplets\ncommonly observed in everyday life from a faucet. The classical\nRayleigh-Plateau instability concerns liquid jets governed by inertia and\nsurface tension, whereas biological tubes are membrane-bounded and\ninertia-free. We therefore refer to the process observed here as a pearling\ninstability, formally analogous to Rayleigh-Plateau but dominated by membrane\nmechanics. Although pearling-type instabilities have long been recognised in\nlipid tubes and some biological systems, a clear physiological example remained\nelusive. Here, we present results showing that pearling instability occurs\nduring the physiological process of platelet formation. Platelets are formed\nfrom megakaryocytes in the bone marrow by the extension of long protrusions,\ncalled proplatelets, that traverse the blood vessels. As they extend in the\nbloodstream, proplatelets become pearled and detach. Long and pearled\nproplatelets then circulate in the peripheral blood before their fragmentation\ninto calibrated platelets. We propose that this pearling, by creating regular\nconstrictions along the proplatelet, is key to the process of proplatelet\nfragmentation into individual platelets of calibrated size. Pearling\ninstability thus acts as a mechanobiological regulator allowing local delivery\nof the right size platelets to the right place at the right time. Our\nobservations quantitatively match parameter-free theoretical predictions for\nmembrane pearling, supporting a unified physical picture."}
{"id": "2506.20043", "pdf": "https://arxiv.org/pdf/2506.20043", "abs": "https://arxiv.org/abs/2506.20043", "authors": ["Ahmet Sarigun", "Bora Uyar", "Vedran Franke", "Altuna Akalin"], "title": "PocketVina Enables Scalable and Highly Accurate Physically Valid Docking through Multi-Pocket Conditioning", "categories": ["q-bio.QM", "cs.LG", "q-bio.BM"], "comment": null, "summary": "Sampling physically valid ligand-binding poses remains a major challenge in\nmolecular docking, particularly for unseen or structurally diverse targets. We\nintroduce PocketVina, a fast and memory-efficient, search-based docking\nframework that combines pocket prediction with systematic multi-pocket\nexploration. We evaluate PocketVina across four established\nbenchmarks--PDBbind2020 (timesplit and unseen), DockGen, Astex, and\nPoseBusters--and observe consistently strong performance in sampling physically\nvalid docking poses. PocketVina achieves state-of-the-art performance when\njointly considering ligand RMSD and physical validity (PB-valid), while\nremaining competitive with deep learning-based approaches in terms of RMSD\nalone, particularly on structurally diverse and previously unseen targets.\nPocketVina also maintains state-of-the-art physically valid docking accuracy\nacross ligands with varying degrees of flexibility. We further introduce\nTargetDock-AI, a benchmarking dataset we curated, consisting of over 500000\nprotein-ligand pairs, and a partition of the dataset labeled with PubChem\nactivity annotations. On this large-scale dataset, PocketVina successfully\ndiscriminates active from inactive targets, outperforming a deep learning\nbaseline while requiring significantly less GPU memory and runtime. PocketVina\noffers a robust and scalable docking strategy that requires no task-specific\ntraining and runs efficiently on standard GPUs, making it well-suited for\nhigh-throughput virtual screening and structure-based drug discovery."}
{"id": "2506.20157", "pdf": "https://arxiv.org/pdf/2506.20157", "abs": "https://arxiv.org/abs/2506.20157", "authors": ["Don Roosan", "Saif Nirzhor", "Rubayat Khan"], "title": "Integrating Pharmacokinetics and Pharmacodynamics Modeling with Quantum Regression for Predicting Herbal Compound Toxicity", "categories": ["q-bio.QM"], "comment": "Conference can be found here:\n  https://www.american-cse.org/csce2025/program", "summary": "Herbal compounds present complex toxicity profiles that are often influenced\nby both intrinsic chemical properties and pharmacokinetics (PK) governing\nabsorption and clearance. In this study, we develop a quantum regression model\nto predict acute toxicity severity for herbal-derived compounds by integrating\ntoxicity data from NICEATM with pharmacological features from TCMSP."}
{"id": "2506.20622", "pdf": "https://arxiv.org/pdf/2506.20622", "abs": "https://arxiv.org/abs/2506.20622", "authors": ["Anderson M. Rodriguez"], "title": "Behavioral Traits as Dynamical Systems: Utilizing Entropy to Analyze Longitudinal Psychometric Data in Coupled Ordinary Differential Equations", "categories": ["q-bio.QM", "physics.bio-ph"], "comment": "28 pages, 7 figures", "summary": "Traits such as neuroticism persist across species despite exhibiting\ncharacteristics typically regarded as maladaptive. This project presents an\nalternative model for understanding the stability of such traits by integrating\nfindings from the Swedish Adoption/Twin Study on Aging (Pedersen, 2015) (SATSA)\nwith a system of recursive, biologically inspired ordinary differential\nequations (ODEs). To utilize the ODEs analytically, Shannon entropy is\nextracted from longitudinal Likert-scale psychometric data, enabling the\ntranslation of high-dimensional behavioral responses into continuous-time\ndynamical systems. The model incorporates principles from evolutionary biology,\nincluding mutation-selection balance, genetic pleiotropy and metabolic\nconstraints, and embeds environmental feedback as a recursive driver of\nphenotypic expression. The argument is presented that traits such as\nneuroticism exist not stochastically, but as emergent multistable attractors\nwithin a biologically-constrained system. This paper shows that entropy\nextracted from longitudinal psychometric data can be meaningfully modeled using\nrecursive ordinary differential equations, revealing stable dynamical\nattractors and biologically and environmentally grounded constraints in traits\noften deemed maladaptive. This framework offers a scalable, mathematically\ngrounded foundation for analyzing phenotypic expression, with the ultimate goal\nof biological extension for eventual multi-omic modeling of behavioral traits."}
{"id": "2506.19866", "pdf": "https://arxiv.org/pdf/2506.19866", "abs": "https://arxiv.org/abs/2506.19866", "authors": ["Joyce Reimer", "Pranta Saha", "Chris Chen", "Neeraj Dhar", "Brook Byrns", "Steven Rayan", "Gordon Broderick"], "title": "GPU-accelerated Modeling of Biological Regulatory Networks", "categories": ["q-bio.MN", "math.OC", "q-bio.QM"], "comment": "10 pages, 5 figures, 2 tables; submitted to 16th ACM Conference on\n  Bioinformatics, Computational Biology, and Health Informatics (ACM BCB 2025)\n  as submission no. 6", "summary": "The complex regulatory dynamics of a biological network can be succinctly\ncaptured using discrete logic models. Given even sparse time-course data from\nthe system of interest, previous work has shown that global optimization\nschemes are suitable for proposing logic models that explain the data and make\npredictions about how the system will behave under varying conditions.\nConsidering the large scale of the parameter search spaces associated with\nthese regulatory systems, performance optimizations on the level of both\nhardware and software are necessary for making this a practical tool for in\nsilico pharmaceutical research. We show here how the implementation of these\nglobal optimization algorithms in a GPU-computing environment can accelerate\nthe solution of these parameter search problems considerably. We carry out\nparameter searches on two model biological regulatory systems that represent\nalmost an order of magnitude scale-up in complexity, and we find the gains in\nefficiency from GPU to be a 33%-43% improvement compared to multi-thread CPU\nimplementations and a 33%-1866% increase compared to CPU in serial. These\nimprovements make global optimization of logic model identification a far more\nattractive and feasible method for in silico hypothesis generation and design\nof experiments."}
{"id": "2506.20450", "pdf": "https://arxiv.org/pdf/2506.20450", "abs": "https://arxiv.org/abs/2506.20450", "authors": ["Nanxin Gong", "Saori Takeyama", "Masahiro Yamaguchi", "Takumi Urata", "Fumikazu Kimura", "Keiko Ishii"], "title": "Papanicolaou Stain Unmixing for RGB Image Using Weighted Nucleus Sparsity and Total Variation Regularization", "categories": ["eess.IV", "q-bio.QM"], "comment": "22 pages, 12 figures", "summary": "The Papanicolaou stain, consisting of eosin Y, hematoxylin, light Green SF\nyellowish, orange G, and Bismarck brown Y, provides extensive color information\nessential for cervical cancer screening in cytopathology. However, the visual\nobservation of these colors is subjective and difficult to characterize. In\ndigital image analysis, the RGB intensities are affected by staining and\nimaging variations, hindering direct quantification of color in\nPapanicolaou-stained samples. Stain unmixing is a promising alternative that\nquantifies the amounts of dyes. In previous work, multispectral imaging was\nutilized to estimate the dye amounts of Papanicolaou stain for quantitative\ndiagnosis. Still, its application to RGB images presents a challenge since the\nnumber of dyes exceeds the three RGB channels. This paper proposes a novel\nPapanicolaou stain unmixing method for RGB images that incorporates three key\nassumptions: nonnegative stain abundances; a sparse spatial distribution of\nhematoxylin, which binds to nuclei; and piecewise smoothness of stain\nabundances. By formulating this as an optimization problem with nonnegativity,\nweighted nucleus sparsity, and total variation regularizations, our method\nachieved excellent performance in stain quantification when validated against\nthe results of multispectral imaging. We also adopted the proposed method for\ndiscriminating lobular endocervical glandular hyperplasia (LEGH), a\nprecancerous lesion of gastric-type adenocarcinoma of the cervix. The resulting\nquantification distinctly characterized differences between LEGH and normal\nendocervical cells with stain abundance, and a classifier based on the\nquantification results achieved 98.0% accuracy. This demonstrates the\nsignificant potential of RGB-based stain unmixing for quantitative diagnosis."}
