{"id": "2509.04939", "pdf": "https://arxiv.org/pdf/2509.04939", "abs": "https://arxiv.org/abs/2509.04939", "authors": ["Linh Nguyen Phuong", "Frederic Fina", "Laurent Greillier", "Pascale Tomasini", "Jean-Laurent Deville", "Romain Zakrasjek", "Lucie Della-Negra", "Audrey Boutonnet", "Frédéric Ginot", "Jean-Charles Garcia", "Sébastien Benzekry", "Sébastien Salas"], "title": "The SChISM study: Cell-free DNA size profiles as predictors of progression in advanced carcinoma treated with immune-checkpoint inhibitors", "categories": ["q-bio.QM"], "comment": null, "summary": "Background: Many advanced cancer patients experience progression under\nimmune-checkpoint inhibitors (ICIs). Circulating cell-free DNA (cfDNA) size\nprofiles offer a promising noninvasive multi-cancer approach to monitor and\npredict immunotherapy response. Methods: In the SChISM (Size CfDNA\nImmunotherapy Signature Monitoring) study (NCT05083494), pre-treatment\nplasmatic cfDNA size profiles from 126 ICI-treated advanced carcinomas were\nquantified using the BIABooster device. Fragmentomederived variables\n(concentration, peaks' position, and fragment size ranges) at baseline were\nanalyzed for associations with early progression (EP, progression at first\nimaging) and progression-free survival (PFS), using logistic and Cox regression\nmodels. Bootstrap analysis validated robustness. Additional analyses were\nperformed in homogeneous subpopulations: first-line lung cancer patients (n =\n60) and head-andneck patients treated with Nivolumab (n = 25). Results: Higher\ncfDNA concentration and high quantities of short fragments (111-240 base pairs\n(bp)) were associated with poor response, unlike long fragments (> 300 bp). The\nproportion of fragments longer than 1650 bp demonstrated highest discriminatory\npower (AUC = 0.73, C-index = 0.69). It was significantly associated with non-EP\n(odds ratio = 0.39 [95% CI: 0.25-0.62]) and longer PFS (hazard ratio: 0.54 [95%\nCI: 0.42-0.68]). These associations remained significant when adjusted for\nconfounders (age, sex, Eastern Cooperative Oncology Group performance status,\ntumor type, and neutrophil-to-lymphocyte ratio) and across both subpopulations.\nBootstrap analysis confirmed robustness with mean accuracy of 70.1 $\\pm$ 4.17%\nand positive predictive value of 55.6 $\\pm$ 7.37%, in test sets. Conclusion:\ncfDNA size profiles significantly predicted ICI response and anticipate\nrelapse, outperforming the routinely used marker programmed death-ligand 1\nimmunohistochemistry and reflecting enhanced immune system activation. Trial\nregistration: (NCT05083494), date of registration: 2021-10-19."}
{"id": "2509.05189", "pdf": "https://arxiv.org/pdf/2509.05189", "abs": "https://arxiv.org/abs/2509.05189", "authors": ["Avinash Mandaiya", "Veit Elser"], "title": "Resolving Tangling in Multi-Conformer Refinement via Iterative Projections", "categories": ["q-bio.QM", "math.OC", "physics.comp-ph"], "comment": null, "summary": "The advent of advanced crystallographic techniques has shifted structural\nbiology from static, single-conformer models toward probing protein dynamics.\nExtracting cooperative motions from temporally and spatially averaged electron\ndensity maps requires both high-resolution data and refinement algorithms\ncapable of handling conformational heterogeneity. However, current refinement\nprotocols often fail due to the tangling phenomenon, in which conformational\nstates become improperly intertwined during optimization. Here, we present an\nautomated refinement methodology based on iterative projections within the\ndivide-and-concur framework. This approach enables seamless integration of\ngeometric constraints with experimental density constraints derived from\nobserved scattering amplitudes. By allowing each atom to satisfy density\nconstraints independently, we show that this framework effectively circumvents\ntangling artifacts and achieves robust refinement performance, even for models\ninitialized with R-factors as high as 12%. Just as iterative projections\nrevolutionized phase retrieval in crystallography, we demonstrate that they can\nalso address the optimization challenges in multi-conformational refinement.\nThis work establishes a computational foundation for advancing crystallographic\nmethodologies to resolve conformational heterogeneity and ultimately capture\nprotein dynamics at atomic resolution."}
{"id": "2509.04718", "pdf": "https://arxiv.org/pdf/2509.04718", "abs": "https://arxiv.org/abs/2509.04718", "authors": ["José F. Fontanari", "Mauro Santos"], "title": "When correcting for regression to the mean is worse than no correction at all", "categories": ["stat.ME", "physics.data-an", "q-bio.QM"], "comment": null, "summary": "The ubiquitous regression to the mean (RTM) effect complicates statistical\ninference in biological studies of change. We demonstrate that common RTM\ncorrection methods are flawed: the Berry et al. method popularized by Kelly &\nPrice in The American Naturalist is unreliable for hypothesis testing, leading\nto both false positives and negatives, while the theoretically unbiased\nBlomqvist method has poor efficiency in limited sample sizes. Our findings show\nthat the most robust approach to handling RTM is not to correct the data but to\nuse the crude slope in conjunction with an assessment of the experiment's\nrepeatability. Ultimately, we argue that any conclusion about a differential\ntreatment effect is statistically unfounded without a clear understanding of\nthe experiment's repeatability."}
{"id": "2509.04778", "pdf": "https://arxiv.org/pdf/2509.04778", "abs": "https://arxiv.org/abs/2509.04778", "authors": ["Charuka D. Wickramasinghe", "Nelum S. S. M. Hapuhinna"], "title": "TumorPred: A Computational Framework Implemented via an R/Shiny Web Application for Parameter Estimation and Sensitivity Analysis in Compartmental Brain Modeling", "categories": ["math.DS", "q-bio.QM"], "comment": null, "summary": "It is difficult or infeasible to directly measure how much of a drug actually\nenters the human brain and a brain tumor, how long it remains there, and to\nestimate drug-specific or patient-specific parameters, as well as how changes\nin these parameters influence model outputs and pharmacokinetic\ncharacteristics. Compartmental modeling offers a powerful mathematical approach\nto describe drug distribution and elimination in the body using systems of\ndifferential equations. This study introduces TumorPred, an R/Shiny-based web\napplication designed for model simulation, sensitivity analysis, and\npharmacokinetic parameter calculation in a permeability-limited\nfour-compartment brain model. The model closely mimics human brain\nfunctionality for drug delivery and aims to predict the pharmacokinetics of\ndrugs in the brain blood, brain mass, and cranial and spinal cerebrospinal\nfluid (CSF) of the human brain. The app provides real-time output updates in\nresponse to input modifications and allows users to visualize and download\nsimulated plots and data tables. The computational accuracy of TumorPred is\nvalidated against results from the Simcyp Simulator (Certara Inc.). TumorPred\nis freely accessible and serves as an invaluable computational tool and\ndata-driven resource for advancing drug development and optimizing treatment\nstrategies for more effective brain cancer therapy."}
{"id": "2509.04848", "pdf": "https://arxiv.org/pdf/2509.04848", "abs": "https://arxiv.org/abs/2509.04848", "authors": ["Enze Ye", "Wei Lin", "Shaochi Ren", "Yakun Liu", "Xiaoping Li", "Hao Wang", "He Sun", "Feng Pan"], "title": "Pose-Free 3D Quantitative Phase Imaging of Flowing Cellular Populations", "categories": ["cs.CV", "physics.bio-ph", "physics.optics", "q-bio.QM"], "comment": "16 pages, 5 figures", "summary": "High-throughput 3D quantitative phase imaging (QPI) in flow cytometry enables\nlabel-free, volumetric characterization of individual cells by reconstructing\ntheir refractive index (RI) distributions from multiple viewing angles during\nflow through microfluidic channels. However, current imaging methods assume\nthat cells undergo uniform, single-axis rotation, which require their poses to\nbe known at each frame. This assumption restricts applicability to\nnear-spherical cells and prevents accurate imaging of irregularly shaped cells\nwith complex rotations. As a result, only a subset of the cellular population\ncan be analyzed, limiting the ability of flow-based assays to perform robust\nstatistical analysis. We introduce OmniFHT, a pose-free 3D RI reconstruction\nframework that leverages the Fourier diffraction theorem and implicit neural\nrepresentations (INRs) for high-throughput flow cytometry tomographic imaging.\nBy jointly optimizing each cell's unknown rotational trajectory and volumetric\nstructure under weak scattering assumptions, OmniFHT supports arbitrary cell\ngeometries and multi-axis rotations. Its continuous representation also allows\naccurate reconstruction from sparsely sampled projections and restricted\nangular coverage, producing high-fidelity results with as few as 10 views or\nonly 120 degrees of angular range. OmniFHT enables, for the first time, in\nsitu, high-throughput tomographic imaging of entire flowing cell populations,\nproviding a scalable and unbiased solution for label-free morphometric analysis\nin flow cytometry platforms."}
