{"id": "2512.00696", "pdf": "https://arxiv.org/pdf/2512.00696", "abs": "https://arxiv.org/abs/2512.00696", "authors": ["Hasi Hays", "Yue Yu", "William Richardson"], "title": "Hierarchical Molecular Language Models (HMLMs)", "categories": ["q-bio.MN", "cs.AI", "cs.ET"], "comment": null, "summary": "Cellular signaling networks represent complex information processing systems that have been modeled via traditional mathematical or statistical approaches. However, these methods often struggle to capture context-dependent signaling, pathway cross-talk, and temporal dynamics across multiple biological scales. Here, we introduce hierarchical molecular language models (HMLMs), a novel architecture that proposes a molecular network-specific large language model (LLM) to use in intracellular communication as a specialized molecular language, which includes molecules as tokens, protein interactions, post-translational modifications, and regulatory events modeled as semantic relationships within an adapted transformer architecture. HMLMs employ graph-structured attention mechanisms to accommodate signaling network topology while integrating information across the molecular, pathway, and cellular scales through hierarchical attention patterns. We demonstrate HMLM superiority using a cardiac fibroblast signaling network comprising over 100 molecular species across functional modules connected by regulatory edges. HMLM achieved a mean squared error (MSE) of 0.058 for temporal signaling predictions, representing 30% improvement over graph neural networks (GNNs: 0.083) and 52% improvement over ordinary differential equation models (ODEs: 0.121), with particular advantages under sparse temporal sampling conditions where HMLM maintained MSE = 0.041 with only 4 time-points. The HMLMs offer a foundation for AI-driven biology and medicine with predictable scaling characteristics suitable for interactive applications. By bridging molecular mechanisms with cellular phenotypes through AI-driven molecular language representation, HMLMs provide a powerful paradigm for systems biology that advances precision medicine applications and therapeutic discovery in the era of AI."}
{"id": "2512.00100", "pdf": "https://arxiv.org/pdf/2512.00100", "abs": "https://arxiv.org/abs/2512.00100", "authors": ["Yifei Chen", "Eric Liang"], "title": "Predicting COVID-19 Prevalence Using Wastewater RNA Surveillance: A Semi-Supervised Learning Approach with Temporal Feature Trust", "categories": ["q-bio.QM", "cs.LG", "stat.AP"], "comment": "22 pages, 13 figures. Submitted to SIURO", "summary": "As COVID-19 transitions into an endemic disease that remains constantly present in the population at a stable level, monitoring its prevalence without invasive measures becomes increasingly important. In this paper, we present a deep neural network estimator for the COVID-19 daily case count based on wastewater surveillance data and other confounding factors. This work builds upon the study by Jiang, Kolozsvary, and Li (2024), which connects the COVID-19 case counts with testing data collected early in the pandemic. Using the COVID-19 testing data and the wastewater surveillance data during the period when both data were highly reliable, one can train an artificial neural network that learns the nonlinear relation between the COVID-19 daily case count and the wastewater viral RNA concentration. From a machine learning perspective, the main challenge lies in addressing temporal feature reliability, as the training data has different reliability over different time periods."}
{"id": "2512.00126", "pdf": "https://arxiv.org/pdf/2512.00126", "abs": "https://arxiv.org/abs/2512.00126", "authors": ["Jin Han", "Tianfan Fu", "Wu-Jun Li"], "title": "RadDiff: Retrieval-Augmented Denoising Diffusion for Protein Inverse Folding", "categories": ["q-bio.QM", "cs.AI"], "comment": null, "summary": "Protein inverse folding, the design of an amino acid sequence based on a target 3D structure, is a fundamental problem of computational protein engineering. Existing methods either generate sequences without leveraging external knowledge or relying on protein language models (PLMs). The former omits the evolutionary information stored in protein databases, while the latter is parameter-inefficient and inflexible to adapt to ever-growing protein data. To overcome the above drawbacks, in this paper we propose a novel method, called retrieval-augmented denoising diffusion (RadDiff), for protein inverse folding. Given the target protein backbone, RadDiff uses a hierarchical search strategy to efficiently retrieve structurally similar proteins from large protein databases. The retrieved structures are then aligned residue-by-residue to the target to construct a position-specific amino acid profile, which serves as an evolutionary-informed prior that conditions the denoising process. A lightweight integration module is further designed to incorporate this prior effectively. Experimental results on the CATH, PDB, and TS50 datasets show that RadDiff consistently outperforms existing methods, improving sequence recovery rate by up to 19%. Experimental results also demonstrate that RadDiff generates highly foldable sequences and scales effectively with database size."}
{"id": "2512.00137", "pdf": "https://arxiv.org/pdf/2512.00137", "abs": "https://arxiv.org/abs/2512.00137", "authors": ["Ze Cai", "Haotian Tang", "Shuai Gao", "Binbin Zhou", "Junhan Zhao", "Jun Wen"], "title": "HyperADRs: A Hierarchical Hypergraph Framework for Drug-Gene-ADR Prediction", "categories": ["q-bio.QM"], "comment": "Preprint. 17 pages, 3 figures", "summary": "Adverse drug reactions (ADRs) are a major barrier to safe and effective pharmacotherapy and increasingly reflect higher order interactions between drugs, genetic background, and clinical phenotypes. Existing graph based approaches usually predict ADRs as properties of drugs or drug pairs, leaving the causal gene implicit and limiting their value for pharmacogenomic decision making. We introduce HyperADRs, a hierarchical hypergraph framework that predicts ADR risk at the level of drug-gene-ADR triads. Starting from curated pharmacogenomic annotations in PharmGKB and the pharmacogenomics subdatabase of DrugBank, we construct high confidence triplets and integrate them with auxiliary molecular, functional, and disease relations from precision-medicine-oriented knowledge graphs. Drugs, genes, and ADR concepts are embedded with modality appropriate pretrained models (UniMol, ESM2, SapBERT) and propagated through a hypergraph convolutional network. A FiLM based, query conditioned contrastive learning module learns context specific representations so that, given any two entities, the model retrieves the correct third entity against many candidates. To improve robustness and interpretability, we propose a nine category ADR macro system scheme that reduces large heterogeneous \"other\" bins while aligning with organ system reasoning in clinical pharmacology. Across drug-, gene-, and ADR-held-out evaluations on PharmGKB, HyperADRs matches or exceeds strong baselines on ranking based metrics. When trained on PharmGKB and tested on unseen DrugBank triplets, HyperADRs maintains its ranking advantage, indicating that the learned representations capture transferable biological mechanisms and can support mechanistically grounded pharmacogenomic hypothesis generation."}
{"id": "2512.00376", "pdf": "https://arxiv.org/pdf/2512.00376", "abs": "https://arxiv.org/abs/2512.00376", "authors": ["Ajit Kumar", "IndraPrakash Jha"], "title": "Layer Probing Improves Kinase Functional Prediction with Protein Language Models", "categories": ["q-bio.QM", "cs.AI", "cs.LG"], "comment": "14 pages, 7 figures, 3 tables; includes code and dataset links", "summary": "Protein language models (PLMs) have transformed sequence-based protein analysis, yet most applications rely only on final-layer embeddings, which may overlook biologically meaningful information encoded in earlier layers. We systematically evaluate all 33 layers of ESM-2 for kinase functional prediction using both unsupervised clustering and supervised classification. We show that mid-to-late transformer layers (layers 20-33) outperform the final layer by 32 percent in unsupervised Adjusted Rand Index and improve homology-aware supervised accuracy to 75.7 percent. Domain-level extraction, calibrated probability estimates, and a reproducible benchmarking pipeline further strengthen reliability. Our results demonstrate that transformer depth contains functionally distinct biological signals and that principled layer selection significantly improves kinase function prediction."}
{"id": "2512.00550", "pdf": "https://arxiv.org/pdf/2512.00550", "abs": "https://arxiv.org/abs/2512.00550", "authors": ["L. Anger", "A. Schoenit", "F. Wodrascka", "C. Rossé", "R. M. Mège", "B. Ladoux", "P. Marcq"], "title": "Tissue stress measurements with Bayesian Inversion Stress Microscopy", "categories": ["q-bio.QM", "physics.bio-ph"], "comment": "36 pages, 12 figures", "summary": "Cells within biological tissue are constantly subjected to dynamic mechanical forces. Measuring the internal stress of tissues has proven crucial for our understanding of the role of mechanical forces in fundamental biological processes like morphogenesis, collective migration, cell division or cell elimination and death. Previously, we have introduced Bayesian Inversion Stress Microscopy (BISM), which is relying on measuring cell-generated traction forces in vitro and has proven particularly useful to measure absolute stresses in confined cell monolayers. We further demonstrate the applicability and robustness of BISM across various experimental settings with different boundary conditions, ranging from confined tissues of arbitrary shape to monolayers composed of different cell types. Importantly, BISM does not require assumptions on cell rheology. Therefore, it can be applied to complex heterogeneous tissues consisting of different cell types, as long as they can be grown on a flat substrate. Finally, we compare BISM to other common stress measurement techniques using a coherent experimental setup, followed by a discussion on its limitations and further perspectives."}
{"id": "2512.00905", "pdf": "https://arxiv.org/pdf/2512.00905", "abs": "https://arxiv.org/abs/2512.00905", "authors": ["Aashna P. Shah", "James A. Diao", "Emma Pierson", "Chirag J. Patel", "Arjun K. Manrai"], "title": "Disentangling Proxies of Demographic Adjustments in Clinical Equations", "categories": ["q-bio.QM"], "comment": null, "summary": "The use of coarse demographic adjustments in clinical equations has been increasingly scrutinized. In particular, adjustments for race have sparked significant debate with several medical professional societies recommending race-neutral equations in recent years. However, current approaches to remove race from clinical equations do not address the underlying causes of observed differences. Here, we present ARC (Approach for identifying pRoxies of demographic Correction), a framework to identify explanatory factors of group-level differences, which may inform the development of more accurate and precise clinical equations. We apply ARC to spirometry tests across two observational cohorts, CDC NHANES and UK Biobank, comprising 159,893 participants. Cross-sectional sociodemographic or exposure measures did not explain differences in reference lung function across race groups beyond those already explained by age, sex, and height. By contrast, sitting height accounted for up to 26% of the remaining differences in lung volumes between healthy Black and White adults. We then demonstrate how pulmonary function test (PFT) reference equations can incorporate these factors in a new set of equations called $ARC_{PFT}$, surpassing the predictive performance of the race-neutral GLI-Global equation recommended by major pulmonary societies. When compared to GLI-Global, inclusion of sitting height and waist circumference in $ARC_{PFT}$ decreased mean absolute error by 13% among Black participants in the UK Biobank and by 24% in NHANES. $ARC_{PFT}$ also had reduced vulnerability to domain shift compared to race-based methods, with mean absolute error 19.3% and 35.6% lower than race-stratified models in out-of-sample Asian and Hispanic populations, respectively. This approach provides a path for understanding the proxies of imprecise demographic adjustments and developing personalized clinical equations."}
{"id": "2512.00989", "pdf": "https://arxiv.org/pdf/2512.00989", "abs": "https://arxiv.org/abs/2512.00989", "authors": ["Dominik Luszczynski", "Richard Fei Yin", "Nicholas Afonin", "Andrew S. P. Lim"], "title": "Sleep Apnea Detection on a Wireless Multimodal Wearable Device Without Oxygen Flow Using a Mamba-based Deep Learning Approach", "categories": ["q-bio.QM", "cs.LG"], "comment": "29 pages, 14 figures. Authors Dominik Luszczynski, Richard Fei Yin and Nicholas Afonin contributed equally", "summary": "Objectives: We present and evaluate a Mamba-based deep-learning model for diagnosis and event-level characterization of sleep disordered breathing based on signals from the ANNE One, a non-intrusive dual-module wireless wearable system measuring chest electrocardiography, triaxial accelerometry, chest and finger temperature, and finger phototplethysmography.\n  Methods: We obtained concurrent PSG and wearable sensor recordings from 384 adults attending a tertiary care sleep laboratory. Respiratory events in the PSG were manually annotated in accordance with AASM guidelines. Wearable sensor and PSG recordings were automatically aligned based on the ECG signal, alignment confirmed by visual inspection, and PSG-derived respiratory event labels were used to train and evaluate a deep sequential neural network based on the Mamba architecture.\n  Results: In 57 recordings in our test set (mean age 56, mean AHI 10.8, 43.86\\% female) the model-predicted AHI was highly correlated with that derived form the PSG labels (R=0.95, p=8.3e-30, men absolute error 2.83). This performance did not vary with age or sex. At a threshold of AHI$>$5, the model had a sensitivity of 0.96, specificity of 0.87, and kappa of 0.82, and at a threshold of AHI$>$15, the model had a sensitivity of 0.86, specificity of 0.98, and kappa of 0.85. At the level of 30-sec epochs, the model had a sensitivity of 0.93 and specificity of 0.95, with a kappa of 0.68 regarding whether any given epoch contained a respiratory event.\n  Conclusions: Applied to data from the ANNE One, a Mamba-based deep learning model can accurately predict AHI and identify SDB at clinically relevant thresholds, achieves good epoch- and event-level identification of individual respiratory events, and shows promise at physiological characterization of these events including event type (central vs. other) and event duration."}
{"id": "2512.01406", "pdf": "https://arxiv.org/pdf/2512.01406", "abs": "https://arxiv.org/abs/2512.01406", "authors": ["Zeming Liu", "Mo Wang", "Xuanye Pan", "Yuan Yang", "Wilson Truccolo", "Quanying Liu"], "title": "Personalized optimization of pediatric HD-tDCS for dose consistency and target engagement", "categories": ["q-bio.QM", "q-bio.NC"], "comment": "Zeming Liu and Mo Wang contributed equally to this work. Correspondence to Wilson Truccolo (wilson_truccolo@brown.edu) and Quanying Liu (liuqy@sustech.edu.cn)", "summary": "High-definition transcranial direct current stimulation (HD-tDCS) dosing in children remains largely empirical, relying on one-size-fits-all protocols despite rapid developmental changes in head anatomy and tissue properties that strongly modulate how currents reach the developing brain. Using 70 pediatric head models and commonly used cortical targets, our forward simulations find that standard montages produce marked age-dependent reductions in target electric-field intensity and systematic sex differences linked to tissue-volume covariation, underscoring the profound limitations of conventional uniform montages. To overcome these limitations, we introduce a developmentally informed, dual-objective optimization framework designed to generate personalized Pareto fronts summarizing the trade-off between electric-field intensity and focality. From these optimized solutions, we derive two practical dosing prescriptions: a dose-consistency strategy that, for the first time, enforces fixed target intensity across individuals to implicitly mitigate demographic effects, and a target-engagement strategy that maximizes target intensity under safety limits. Both strategies remain robust to large conductivity variations, and we further show that dense HD-tDCS solutions admit sparse equivalents without performance loss under the target-engagement strategy. We also find that tissue conductivity sensitivity is depth-dependent, with Pareto-front distributions for superficial cortical targets most influenced by gray matter, scalp, and bone conductivities, and those for a deep target predominantly shaped by gray and white matter conductivities. Together, these results establish a principled framework for pediatric HD-tDCS planning that explicitly accounts for developmental anatomy and physiological uncertainty, enabling reliable and individualized neuromodulation dosing in pediatric populations."}
{"id": "2512.01986", "pdf": "https://arxiv.org/pdf/2512.01986", "abs": "https://arxiv.org/abs/2512.01986", "authors": ["Nasim Montazeri", "Stone Yang", "Dominik Luszczynski", "John Zhang", "Dharmendra Gurve", "Andrew Centen", "Maged Goubran", "Andrew Lim"], "title": "A robust generalizable device-agnostic deep learning model for sleep-wake determination from triaxial wrist accelerometry", "categories": ["q-bio.QM", "cs.LG"], "comment": "27 pages, 5 figures, 5 tables", "summary": "Study Objectives: Wrist accelerometry is widely used for inferring sleep-wake state. Previous works demonstrated poor wake detection, without cross-device generalizability and validation in different age range and sleep disorders. We developed a robust deep learning model for to detect sleep-wakefulness from triaxial accelerometry and evaluated its validity across three devices and in a large adult population spanning a wide range of ages with and without sleep disorders. Methods: We collected wrist accelerometry simultaneous to polysomnography (PSG) in 453 adults undergoing clinical sleep testing at a tertiary care sleep laboratory, using three devices. We extracted features in 30-second epochs and trained a 3-class model to detect wake, sleep, and sleep with arousals, which was then collapsed into wake vs. sleep using a decision tree. To enhance wake detection, the model was specifically trained on randomly selected subjects with low sleep efficiency and/or high arousal index from one device recording and then tested on the remaining recordings. Results: The model showed high performance with F1 Score of 0.86, sensitivity (sleep) of 0.87, and specificity (wakefulness) of 0.78, and significant and moderate correlation to PSG in predicting total sleep time (R=0.69) and sleep efficiency (R=0.63). Model performance was robust to the presence of sleep disorders, including sleep apnea and periodic limb movements in sleep, and was consistent across all three models of accelerometer. Conclusions: We present a deep model to detect sleep-wakefulness from actigraphy in adults with relative robustness to the presence of sleep disorders and generalizability across diverse commonly used wrist accelerometers."}
{"id": "2512.00194", "pdf": "https://arxiv.org/pdf/2512.00194", "abs": "https://arxiv.org/abs/2512.00194", "authors": ["Zag ElSayed", "Grace Westerkamp", "Gavin Gammoh", "Yanchen Liu", "Peyton Siekierski", "Craig Erickson", "Ernest Pedapati"], "title": "AutocleanEEG ICVision: Automated ICA Artifact Classification Using Vision-Language AI", "categories": ["cs.CV", "cs.LG", "eess.IV", "q-bio.QM"], "comment": "6 pages, 8 figures", "summary": "We introduce EEG Autoclean Vision Language AI (ICVision) a first-of-its-kind system that emulates expert-level EEG ICA component classification through AI-agent vision and natural language reasoning. Unlike conventional classifiers such as ICLabel, which rely on handcrafted features, ICVision directly interprets ICA dashboard visualizations topography, time series, power spectra, and ERP plots, using a multimodal large language model (GPT-4 Vision). This allows the AI to see and explain EEG components the way trained neurologists do, making it the first scientific implementation of AI-agent visual cognition in neurophysiology. ICVision classifies each component into one of six canonical categories (brain, eye, heart, muscle, channel noise, and other noise), returning both a confidence score and a human-like explanation. Evaluated on 3,168 ICA components from 124 EEG datasets, ICVision achieved k = 0.677 agreement with expert consensus, surpassing MNE ICLabel, while also preserving clinically relevant brain signals in ambiguous cases. Over 97% of its outputs were rated as interpretable and actionable by expert reviewers. As a core module of the open-source EEG Autoclean platform, ICVision signals a paradigm shift in scientific AI, where models do not just classify, but see, reason, and communicate. It opens the door to globally scalable, explainable, and reproducible EEG workflows, marking the emergence of AI agents capable of expert-level visual decision-making in brain science and beyond."}
{"id": "2512.00283", "pdf": "https://arxiv.org/pdf/2512.00283", "abs": "https://arxiv.org/abs/2512.00283", "authors": ["Yi Fang", "Haoran Xu", "Jiaxin Han", "Sirui Ding", "Yizhi Wang", "Yue Wang", "Xuan Wang"], "title": "BioArc: Discovering Optimal Neural Architectures for Biological Foundation Models", "categories": ["cs.LG", "cs.AI", "q-bio.QM"], "comment": null, "summary": "Foundation models have revolutionized various fields such as natural language processing (NLP) and computer vision (CV). While efforts have been made to transfer the success of the foundation models in general AI domains to biology, existing works focus on directly adopting the existing foundation model architectures from general machine learning domains without a systematic design considering the unique physicochemical and structural properties of each biological data modality. This leads to suboptimal performance, as these repurposed architectures struggle to capture the long-range dependencies, sparse information, and complex underlying ``grammars'' inherent to biological data. To address this gap, we introduce BioArc, a novel framework designed to move beyond intuition-driven architecture design towards principled, automated architecture discovery for biological foundation models. Leveraging Neural Architecture Search (NAS), BioArc systematically explores a vast architecture design space, evaluating architectures across multiple biological modalities while rigorously analyzing the interplay between architecture, tokenization, and training strategies. This large-scale analysis identifies novel, high-performance architectures, allowing us to distill a set of empirical design principles to guide future model development. Furthermore, to make the best of this set of discovered principled architectures, we propose and compare several architecture prediction methods that effectively and efficiently predict optimal architectures for new biological tasks. Overall, our work provides a foundational resource and a principled methodology to guide the creation of the next generation of task-specific and foundation models for biology."}
{"id": "2512.00521", "pdf": "https://arxiv.org/pdf/2512.00521", "abs": "https://arxiv.org/abs/2512.00521", "authors": ["Sabrina Islam", "Md. Atiqur Rahman", "Md. Bakhtiar Hasan", "Md. Hasanul Kabir"], "title": "Rep3Net: An Approach Exploiting Multimodal Representation for Molecular Bioactivity Prediction", "categories": ["cs.LG", "cs.CL", "q-bio.QM"], "comment": null, "summary": "In early stage drug discovery, bioactivity prediction of molecules against target proteins plays a crucial role. Trdaitional QSAR models that utilizes molecular descriptor based data often struggles to predict bioactivity of molecules effectively due to its limitation in capturing structural and contextual information embedded within each compound. To address this challenge, we propose Rep3Net, a unified deep learning architecture that not only incorporates descriptor data but also includes spatial and relational information through graph-based represenation of compounds and contextual information through ChemBERTa generated embeddings from SMILES strings. Our model employing multimodal concatenated features produce reliable bioactivity prediction on Poly [ADP-ribose] polymerase 1 (PARP-1) dataset. PARP-1 is a crucial agent in DNA damage repair and has become a significant theraputic target in malignancies that depend on it for survival and growth. A comprehensive analysis and comparison with conventional standalone models including GCN, GAT, XGBoost, etc. demonstrates that our architecture achieves the highest predictive performance. In computational screening of compounds in drug discovery, our architecture provides a scalable framework for bioactivity prediction."}
{"id": "2512.00586", "pdf": "https://arxiv.org/pdf/2512.00586", "abs": "https://arxiv.org/abs/2512.00586", "authors": ["Michael R. Doane"], "title": "Statistical NLP for Optimization of Clinical Trial Success Prediction in Pharmaceutical R&D", "categories": ["cs.LG", "cs.CL", "q-bio.QM"], "comment": "Doctor of Engineering Praxis Dissertation, The George Washington University. 122 pages. Present affiliation: Iambic Therapeutics", "summary": "This work presents the development and evaluation of an NLP-enabled probabilistic classifier designed to estimate the probability of technical and regulatory success (pTRS) for clinical trials in the field of neuroscience. While pharmaceutical R&D is plagued by high attrition rates and enormous costs, particularly within neuroscience, where success rates are below 10%, timely identification of promising programs can streamline resource allocation and reduce financial risk. Leveraging data from the ClinicalTrials.gov database and success labels from the recently developed Clinical Trial Outcome dataset, the classifier extracts text-based clinical trial features using statistical NLP techniques. These features were integrated into several non-LLM frameworks (logistic regression, gradient boosting, and random forest) to generate calibrated probability scores. Model performance was assessed on a retrospective dataset of 101,145 completed clinical trials spanning 1976-2024, achieving an overall ROC-AUC of 0.64. An LLM-based predictive model was then built using BioBERT, a domain-specific language representation encoder. The BioBERT-based model achieved an overall ROC-AUC of 0.74 and a Brier Score of 0.185, indicating its predictions had, on average, 40% less squared error than would be observed using industry benchmarks. The BioBERT-based model also made trial outcome predictions that were superior to benchmark values 70% of the time overall. By integrating NLP-driven insights into drug development decision-making, this work aims to enhance strategic planning and optimize investment allocation in neuroscience programs."}
{"id": "2512.01033", "pdf": "https://arxiv.org/pdf/2512.01033", "abs": "https://arxiv.org/abs/2512.01033", "authors": ["Luigi Assom"], "title": "Associative Syntax and Maximal Repetitions reveal context-dependent complexity in fruit bat communication", "categories": ["cs.LG", "cs.CL", "cs.IT", "q-bio.QM"], "comment": "Accepted for a lightning talk at the NeurIPS 2025 Workshop: \"AI for Non-Human Animal Communication\"", "summary": "This study presents an unsupervised method to infer discreteness, syntax and temporal structures of fruit-bats vocalizations, as a case study of graded vocal systems, and evaluates the complexity of communication patterns in relation with behavioral context. The method improved the baseline for unsupervised labeling of vocal units (i.e. syllables) through manifold learning, by investigating how dimen- sionality reduction on mel-spectrograms affects labeling, and comparing it with unsupervised labels based on acoustic similarity. We then encoded vocalizations as syllabic sequences to analyze the type of syntax, and extracted the Maximal Repetitions (MRs) to evaluate syntactical structures. We found evidence for: i) associative syntax, rather than combinatorial (context classification is unaffected by permutation of sequences, F 1 > 0.9); ii) context-dependent use of syllables (Wilcoxon rank-sum tests, p-value < 0.05); iii) heavy-tail distribution of MRs (truncated power-law, exponent α < 2), indicative of mechanism encoding com- binatorial complexity. Analysis of MRs and syllabic transition networks revealed that mother-pupil interactions were characterized by repetitions, while commu- nication in conflict-contexts exhibited higher complexity (longer MRs and more interconnected vocal sequences) than non-agonistic contexts. We propose that communicative complexity is higher in scenarios of disagreement, reflecting lower compressibility of information."}
{"id": "2512.01074", "pdf": "https://arxiv.org/pdf/2512.01074", "abs": "https://arxiv.org/abs/2512.01074", "authors": ["Faharudeen Alhassan", "Hamed Karami", "Amanda Bleichrodt", "James M. Hyman", "Isaac C. H. Fung", "Ruiyan Luo", "Gerardo Chowell"], "title": "COVID-19 Forecasting from U.S. Wastewater Surveillance Data: A Retrospective Multi-Model Study (2022-2024)", "categories": ["stat.AP", "q-bio.QM"], "comment": "38 pages, 21 figures", "summary": "Accurate and reliable forecasting models are critical for guiding public health responses and policy decisions during pandemics such as COVID-19. Retrospective evaluation of model performance is essential for improving epidemic forecasting capabilities. In this study, we used COVID-19 wastewater data from CDC's National Wastewater Surveillance System to generate sequential weekly retrospective forecasts for the United States from March 2022 through September 2024, both at the national level and for four major regions (Northeast, Midwest, South, and West). We produced 133 weekly forecasts using 11 models, including ARIMA, generalized additive models (GAM), simple linear regression (SLR), Prophet, and the n-sub-epidemic framework (top-ranked, weighted-ensemble, and unweighted-ensemble variants). Forecast performance was assessed using mean absolute error (MAE), mean squared error (MSE), weighted interval score (WIS), and 95% prediction interval coverage. The n-sub-epidemic unweighted ensembles outperformed all other models at 3-4-week horizons, particularly at the national level and in the Midwest and West. ARIMA and GAM performed best at 1-2-week horizons in most regions, whereas Prophet and SLR consistently underperformed across regions and horizons. These findings highlight the value of region-specific modeling strategies and demonstrate the utility of the n-sub-epidemic framework for real-time outbreak forecasting using wastewater surveillance data."}
{"id": "2512.01462", "pdf": "https://arxiv.org/pdf/2512.01462", "abs": "https://arxiv.org/abs/2512.01462", "authors": ["Daniele Proverbio", "Rami Katz", "Giulia Giordano"], "title": "Robustness and resilience of dynamical networks in biology and epidemiology", "categories": ["math-ph", "q-bio.QM"], "comment": null, "summary": "Natural systems are remarkably robust and resilient, maintaining essential functions despite variability, uncertainty, and hostile conditions. Understanding these nonlinear, dynamic behaviours is challenging because such systems involve many interacting parameters, yet it is crucial for explaining processes from cellular regulation to disease onset and epidemic spreading. Robustness and resilience describe a system's ability to preserve and recover desired behaviours in the presence of intrinsic and extrinsic fluctuations. This survey reviews how different disciplines define these concepts, examines methods for assessing whether key properties of uncertain, networked dynamical systems are structural (parameter-free) or robust (preserved for parameter variations within an uncertainty bounding set), and discusses integrated structural and probabilistic techniques for biological and epidemiological models. The text introduces formal definitions of resilience for families of systems obtained by adding stochastic perturbations to a nominal deterministic model, enabling a probabilistic characterisation of the ability to remain within or return to a prescribed attractor. These definitions generalise probabilistic robustness and shed new light on classical biological examples. In addition, the survey summarises resilience indicators and data-driven tools for detecting resilience loss and regime shifts, drawing on bifurcation analysis to anticipate qualitative changes in system behaviour. Together, these methodologies support the study and control of complex natural systems, guiding the design of biomolecular feedback architectures, the identification of therapeutic targets, the forecasting and management of epidemics, and the detection of tipping points in ecological and biological networks."}
{"id": "2512.01652", "pdf": "https://arxiv.org/pdf/2512.01652", "abs": "https://arxiv.org/abs/2512.01652", "authors": ["Antonio Matas-Gil", "Robert G. Endres"], "title": "From Toggle to Tuning: Controlling Turing Patterns in Gene Circuits", "categories": ["physics.bio-ph", "math-ph", "math.DS", "nlin.PS", "q-bio.QM"], "comment": null, "summary": "Controlling spatial patterns in synthetic biological systems remains challenging due to poor parameter robustness and limited experimental tunability. We introduce two complementary mechanisms-the pattern switch and the pattern dial-to systematically control Turing pattern formation in gene circuits. The switch toggles pattern onset via a single parameter, while the dial enables transitions between distinct pattern types using weakly nonlinear amplitude equations. Analyzing network size reveals a key trade-off: small networks are easier to control but less robust, while larger networks gain robustness at the cost of tunability-suggesting a sweet spot for both evolvability and designability. Our results offer practical design rules for engineering programmable patterns in living systems."}
{"id": "2512.01885", "pdf": "https://arxiv.org/pdf/2512.01885", "abs": "https://arxiv.org/abs/2512.01885", "authors": ["Florian Bürger", "Martim Dias Gomes", "Nica Gutu", "Adrián E. Granada", "Noémie Moreau", "Katarzyna Bozek"], "title": "TransientTrack: Advanced Multi-Object Tracking and Classification of Cancer Cells with Transient Fluorescent Signals", "categories": ["cs.CV", "q-bio.CB", "q-bio.QM"], "comment": "13 pages, 7 figures, 2 tables. This work has been submitted to IEEE Transactions on Medical Imaging", "summary": "Tracking cells in time-lapse videos is an essential technique for monitoring cell population dynamics at a single-cell level. Current methods for cell tracking are developed on videos with mostly single, constant signals and do not detect pivotal events such as cell death. Here, we present TransientTrack, a deep learning-based framework for cell tracking in multi-channel microscopy video data with transient fluorescent signals that fluctuate over time following processes such as the circadian rhythm of cells. By identifying key cellular events - mitosis (cell division) and apoptosis (cell death) our method allows us to build complete trajectories, including cell lineage information. TransientTrack is lightweight and performs matching on cell detection embeddings directly, without the need for quantification of tracking-specific cell features. Furthermore, our approach integrates Transformer Networks, multi-stage matching using all detection boxes, and the interpolation of missing tracklets with the Kalman Filter. This unified framework achieves strong performance across diverse conditions, effectively tracking cells and capturing cell division and death. We demonstrate the use of TransientTrack in an analysis of the efficacy of a chemotherapeutic drug at a single-cell level. The proposed framework could further advance quantitative studies of cancer cell dynamics, enabling detailed characterization of treatment response and resistance mechanisms. The code is available at https://github.com/bozeklab/TransientTrack."}
