{"id": "2511.15977", "pdf": "https://arxiv.org/pdf/2511.15977", "abs": "https://arxiv.org/abs/2511.15977", "authors": ["Daniel Mas Montserrat", "Ray Verma", "Míriam Barrabés", "Francisco M. de la Vega", "Carlos D. Bustamante", "Alexander G. Ioannidis"], "title": "Efficient Chromosome Parallelization for Precision Medicine Genomic Workflows", "categories": ["cs.DC", "cs.AI", "cs.LG", "cs.PF", "q-bio.GN"], "comment": "Accepted at AAAI 2026", "summary": "Large-scale genomic workflows used in precision medicine can process datasets spanning tens to hundreds of gigabytes per sample, leading to high memory spikes, intensive disk I/O, and task failures due to out-of-memory errors. Simple static resource allocation methods struggle to handle the variability in per-chromosome RAM demands, resulting in poor resource utilization and long runtimes. In this work, we propose multiple mechanisms for adaptive, RAM-efficient parallelization of chromosome-level bioinformatics workflows. First, we develop a symbolic regression model that estimates per-chromosome memory consumption for a given task and introduces an interpolating bias to conservatively minimize over-allocation. Second, we present a dynamic scheduler that adaptively predicts RAM usage with a polynomial regression model, treating task packing as a Knapsack problem to optimally batch jobs based on predicted memory requirements. Additionally, we present a static scheduler that optimizes chromosome processing order to minimize peak memory while preserving throughput. Our proposed methods, evaluated on simulations and real-world genomic pipelines, provide new mechanisms to reduce memory overruns and balance load across threads. We thereby achieve faster end-to-end execution, showcasing the potential to optimize large-scale genomic workflows."}
{"id": "2511.15839", "pdf": "https://arxiv.org/pdf/2511.15839", "abs": "https://arxiv.org/abs/2511.15839", "authors": ["Mohammed A. Y. Mohammed", "Hamed Karami", "Gerardo Chowell"], "title": "Comparing Bayesian and Frequentist Inference in Biological Models: A Comparative Analysis of Accuracy, Uncertainty, and Identifiability", "categories": ["q-bio.QM"], "comment": "59 pages, 19 figures, 29 tables", "summary": "Mathematical models support inference and forecasting in ecology and epidemiology, but results depend on the estimation framework. We compare Bayesian and Frequentist approaches across three biological models using four datasets: Lotka-Volterra predator-prey dynamics (Hudson Bay), a generalized logistic model (lung injury and 2022 U.S. mpox), and an SEIUR epidemic model (COVID-19 in Spain). Both approaches use a normal error structure to ensure a fair comparison.\n  We first assessed structural identifiability to determine which parameters can theoretically be recovered from the data. We then evaluated practical identifiability and forecasting performance using four metrics: mean absolute error (MAE), mean squared error (MSE), 95 percent prediction interval (PI) coverage, and weighted interval score (WIS). For the Lotka-Volterra model with both prey and predator data, we analyzed three scenarios: prey only, predator only, and both.\n  The Frequentist workflow used QuantDiffForecast (QDF) in MATLAB, which fits ODE models via nonlinear least squares and quantifies uncertainty through parametric bootstrap. The Bayesian workflow used BayesianFitForecast (BFF), which employs Hamiltonian Monte Carlo sampling via Stan to generate posterior distributions and diagnostics such as the Gelman-Rubin R-hat statistic.\n  Results show that Frequentist inference performs best when data are rich and fully observed, while Bayesian inference excels when latent-state uncertainty is high and data are sparse, as in the SEIUR COVID-19 model. Structural identifiability clarifies these patterns: full observability benefits both frameworks, while limited observability constrains parameter recovery. This comparison provides guidance for choosing inference frameworks based on data richness, observability, and uncertainty needs."}
{"id": "2511.15932", "pdf": "https://arxiv.org/pdf/2511.15932", "abs": "https://arxiv.org/abs/2511.15932", "authors": ["Changin Oh", "Kathleen P. Wilkie"], "title": "How Mathematical Forms of Chemotherapy and Radiotherapy Bias Model-Optimized Predictions: Implications for Model Selection", "categories": ["q-bio.QM"], "comment": "38 pages, 15 figures, 4 tables", "summary": "The move towards personalized treatment and digital twins for cancer therapy requires a complete understanding of the mathematical models upon which these optimized simulation-based strategies are formulated. This study investigates the influence of mathematical model selection on the optimization of chemotherapy and radiotherapy protocols. By examining three chemotherapy models (log-kill, Norton-Simon, and Emax), and three radiotherapy models (linear-quadratic, proliferation saturation index, and continuous death-rate), we identify similarities and significant differences in the optimized protocols. We demonstrate how the assumptions built into the model formulations heavily influence optimal treatment dosing and sequencing, potentially leading to contradictory results. Further, we demonstrate how different model forms influence predictions in the adaptive therapy setting. As treatment decisions increasingly rely on simulation-based strategies, unexamined model assumptions can introduce bias, leading to model-dependent recommendations that may not be generalizable. This study highlights the importance of basing model selection on a full analysis of bias, sensitivity, practical parameter identifiability and/or inferred parameter posteriors, as a part of the uncertainty quantification process, rather than solely relying on information criterion. Understanding how model choice impacts predictions guiding personalized treatment planning with sufficient uncertainty quantification analysis, will lead to more robust and generalizable predictions."}
{"id": "2511.16113", "pdf": "https://arxiv.org/pdf/2511.16113", "abs": "https://arxiv.org/abs/2511.16113", "authors": ["Hongfu Lou"], "title": "ProtT-Affinity: Sequence-Based Protein-Protein Binding Affinity Prediction Using ProtT5 Embeddings", "categories": ["q-bio.QM"], "comment": "9 pages, 2 figures", "summary": "Predicting the binding affinity of protein protein complexes directly from sequence remains a challenging problem, particularly in the absence of reliable structural information. Here I present ProtT Affinity, a sequence only model that combines ProtT5 embeddings with a lightweight Transformer architecture. The model is trained and evaluated on homology filtered subsets of the PDBBind database following a curation protocol consistent with prior structure based work. Across two independent test sets,ProtT Affinity reaches Pearson correlation coefficients of 0.628 and 0.459, respectively.Although its performance does not match the strongest structure based methods, it is competitive with several widely used approaches and provides a practical alternative when structural data are missing or uncertain. The results suggest that large protein language models capture features relevant to binding energetics, and that these features can be exploited to approximate affinity trends at scale."}
{"id": "2511.16268", "pdf": "https://arxiv.org/pdf/2511.16268", "abs": "https://arxiv.org/abs/2511.16268", "authors": ["Erwan Dereure", "Robin Louiset", "Laura Parkkinen", "David A Menassa", "David Holcman"], "title": "Weakly Supervised Segmentation and Classification of Alpha-Synuclein Aggregates in Brightfield Midbrain Images", "categories": ["eess.IV", "cs.CV", "q-bio.QM"], "comment": null, "summary": "Parkinson's disease (PD) is a neurodegenerative disorder associated with the accumulation of misfolded alpha-synuclein aggregates, forming Lewy bodies and neuritic shape used for pathology diagnostics. Automatic analysis of immunohistochemistry histopathological images with Deep Learning provides a promising tool for better understanding the spatial organization of these aggregates. In this study, we develop an automated image processing pipeline to segment and classify these aggregates in whole-slide images (WSIs) of midbrain tissue from PD and incidental Lewy Body Disease (iLBD) cases based on weakly supervised segmentation, robust to immunohistochemical labelling variability, with a ResNet50 classifier. Our approach allows to differentiate between major aggregate morphologies, including Lewy bodies and neurites with a balanced accuracy of $80\\%$. This framework paves the way for large-scale characterization of the spatial distribution and heterogeneity of alpha-synuclein aggregates in brightfield immunohistochemical tissue, and for investigating their poorly understood relationships with surrounding cells such as microglia and astrocytes."}
