{"id": "2507.08043", "pdf": "https://arxiv.org/pdf/2507.08043", "abs": "https://arxiv.org/abs/2507.08043", "authors": ["Jian Liu", "Li Shen", "Mushal Zia", "Guo-Wei Wei"], "title": "Topological Sequence Analysis of Genomes: Category Approaches", "categories": ["q-bio.GN", "math.AT"], "comment": null, "summary": "Sequence data, such as DNA, RNA, and protein sequences, exhibit intricate,\nmulti-scale structures that pose significant challenges for conventional\nanalysis methods, particularly those relying on alignment or purely statistical\nrepresentations. In this work, we introduce category-based topological sequence\nanalysis (CTSA ) of genomes. CTSA models a sequence as a resolution category,\ncapturing its hierarchical structure through a categorical construction.\nSubstructure complexes are then derived from this categorical representation,\nand their persistent homology is computed to extract multi-scale topological\nfeatures. Our models depart from traditional alignment-free approaches by\nincorporating structured mathematical formalisms rooted in sequence topology.\nThe resulting topological signatures provide informative representations across\na variety of tasks, including the phylogenetic analysis of SARS-CoV-2 variants\nand the prediction of protein-nucleic acid binding affinities. Comparative\nstudies were carried out against six state-of-the-art methods. Experimental\nresults demonstrate that CTSA achieves excellent and consistent performance in\nthese tasks, suggesting its general applicability and robustness. Beyond\nsequence analysis, the proposed framework opens new directions for the\nintegration of categorical and homological theories for biological sequence\nanalysis."}
{"id": "2507.08058", "pdf": "https://arxiv.org/pdf/2507.08058", "abs": "https://arxiv.org/abs/2507.08058", "authors": ["Kaitao Lai"], "title": "HybridQC: Machine Learning-Augmented Quality Control for Single-Cell RNA-seq Data", "categories": ["q-bio.GN"], "comment": "3 pages, 1 figure", "summary": "HybridQC is an R package that streamlines quality control (QC) of single-cell\nRNA sequencing (scRNA-seq) data by combining traditional threshold-based\nfiltering with machine learning-based outlier detection. It provides an\nefficient and adaptive framework to identify low-quality cells in noisy or\nshallow-depth datasets using techniques such as Isolation Forest, while\nremaining compatible with widely adopted formats such as Seurat objects.\n  The package is lightweight, easy to install, and suitable for small-to-medium\nscRNA-seq datasets in research settings. HybridQC is especially useful for\nprojects involving non-model organisms, rare samples, or pilot studies, where\nautomated and flexible QC is critical for reproducibility and downstream\nanalysis."}
{"id": "2507.08060", "pdf": "https://arxiv.org/pdf/2507.08060", "abs": "https://arxiv.org/abs/2507.08060", "authors": ["Kaitao Lai"], "title": "MicroTrace: A Lightweight R Tool for SNP-Based Pathogen Clustering in Outbreak Detection", "categories": ["q-bio.GN"], "comment": "3 pages", "summary": "MicroTrace is an open-source R tool that performs SNP-based hierarchical\nclustering to detect potential transmission clusters from pathogen whole-genome\nsequencing (WGS) data. Designed for epidemiologists, microbiologists, and\ngenomic surveillance teams, it processes SNP distance matrices and outputs\ndendrograms and cluster tables with optional metadata integration. MicroTrace\nenables reproducible outbreak detection workflows with minimal setup."}
{"id": "2507.08062", "pdf": "https://arxiv.org/pdf/2507.08062", "abs": "https://arxiv.org/abs/2507.08062", "authors": ["Kaitao Lai"], "title": "AMRScan: A hybrid R and Nextflow toolkit for rapid antimicrobial resistance gene detection from sequencing data", "categories": ["q-bio.GN"], "comment": "3 pages", "summary": "AMRScan is a hybrid bioinformatics toolkit implemented in both R and\n[Nextflow](https://www.nextflow.io/) for the rapid and reproducible detection\nof antimicrobial resistance (AMR) genes from next-generation sequencing (NGS)\ndata. The toolkit enables users to identify AMR gene hits in sequencing reads\nby aligning them against reference databases such as CARD using BLAST.\n  The R implementation provides a concise, script-based approach suitable for\nsingle-sample analysis, teaching, and rapid prototyping. In contrast, the\nNextflow implementation enables reproducible, scalable workflows for\nmulti-sample batch processing in high-performance computing (HPC) and\ncontainerized environments. It leverages modular pipeline design with support\nfor automated database setup, quality control, conversion, BLAST alignment, and\nresults parsing.\n  AMRScan helps bridge the gap between lightweight exploratory analysis and\nproduction-ready surveillance pipelines, making it suitable for both research\nand public health genomics applications."}
{"id": "2507.08615", "pdf": "https://arxiv.org/pdf/2507.08615", "abs": "https://arxiv.org/abs/2507.08615", "authors": ["Veselin Manojlović", "Armaan Ahmed", "Yannick Viossat", "Robert Noble"], "title": "Expected and minimal values of a universal tree balance index", "categories": ["q-bio.QM", "92B10", "E.1; G.2.2"], "comment": "38 pages (20 pages main text plus 18 pages of appendices) with 5 main\n  figures", "summary": "Although the analysis of rooted tree shape has wide-ranging applications,\nnotions of tree balance have developed independently in different domains. In\ncomputer science, a balanced tree is one that enables efficient updating and\nretrieval of data, whereas in biology tree balance quantifies bias in\nevolutionary processes. The lack of a precise connection between these concepts\nhas stymied the development of universal indices and general results. We\nrecently introduced a new tree balance index, $J^1$, that, unlike prior indices\npopular among biologists, permits meaningful comparison of trees with arbitrary\ndegree distributions and node sizes. Here we explain how our new index\ngeneralizes a concept that underlies the definition of the weight-balanced\ntree, an important type of self-balancing binary search tree. Our index thus\nunifies the tree balance concepts of biology and computer science. We provide\nnew analytical results to support applications of this universal index. First,\nwe quantify the accuracy of approximations to the expected values of $J^1$\nunder two important null models: the Yule process and the uniform model.\nSecond, we investigate minimal values of our index. These results help\nestablish $J^1$ as a universal, cross-disciplinary index of tree balance that\ngeneralizes and supersedes prior approaches."}
{"id": "2507.08728", "pdf": "https://arxiv.org/pdf/2507.08728", "abs": "https://arxiv.org/abs/2507.08728", "authors": ["Sungwoo Ahn", "Evie A. Malaia", "Leonid L Rubchinsky"], "title": "Distinct neurodynamics of functional brain networks in Alzheimer's disease and frontotemporal dementia as revealed by EEG", "categories": ["q-bio.NC", "q-bio.QM"], "comment": "23 pages, 4 figures, 11 tables. arXiv admin note: text overlap with\n  arXiv:2506.23013", "summary": "Objective While Alzheimer's disease (AD) and frontotemporal dementia (FTD)\nshow some common memory deficits, these two disorders show partially\noverlapping complex spatiotemporal patterns of neural dynamics. The objective\nof this study is to characterize these patterns to better understand the\ngeneral principles of neurodynamics in these conditions.\n  Methods A comprehensive array of methods to study brain rhythms and\nfunctional brain networks are used in the study, from spectral power measures\nto Lyapunov exponent, phase synchronization, temporal synchrony patterns, and\nmeasures of the functional brain connectivity. Furthermore, machine learning\ntechniques for classification are used to augment the methodology.\n  Results Multiple measures (spectral, synchrony, functional network\norganization) indicate an array of differences between neurodynamics between AD\nand FTD, and control subjects across different frequency bands.\n  Conclusions These differences taken together in an integrative way suggest\nthat AD neural activity may be less coordinated and less connected across\nareas, and more random, while FTD shows more coordinated neural activity\n(except slow frontal activity).\n  Significance AD and FTD may represent opposite changes from normal brain\nfunction in terms of the spatiotemporal coordination of neural activity.\nDeviations from normal in both directions may lead to neurological deficits,\nwhich are specific to each of the disorders."}
