{"id": "2509.13044", "pdf": "https://arxiv.org/pdf/2509.13044", "abs": "https://arxiv.org/abs/2509.13044", "authors": ["Noor Shaker", "Mohamed AbouZleikha", "Nuha Shaker"], "title": "ORCA: A Comprehensive AI-Driven Platform for Digital Pathology Analysis and Biomarker Discovery", "categories": ["q-bio.QM"], "comment": "15 pages, 4 figures", "summary": "Digital pathology has emerged as a transformative approach to tissue\nanalysis, offering unprecedented opportunities for objective, quantitative\nassessment of histopathological features. However, the complexity of\nimplementing artificial intelligence (AI) solutions in pathology workflows has\nlimited widespread adoption. Here we present ORCA (Optimized Research and\nClinical Analytics), a comprehensive no-code AI platform specifically designed\nfor digital pathology applications. ORCA addresses critical barriers to AI\nadoption by providing an intuitive interface that enables pathologists and\nresearchers to train, deploy, and validate custom AI models without programming\nexpertise. The platform integrates advanced deep learning architectures with\nclinical workflow management, supporting applications from tissue\nclassification and cell segmentation to spatial distribution scoring and novel\nbiomarker discovery. We demonstrate ORCA's capabilities through validation\nstudies across multiple cancer types, showing significant improvements in\nanalytical speed, reproducibility, and clinical correlation compared to\ntraditional manual assessment methods. Our results indicate that ORCA\nsuccessfully democratizes access to state-of-the-art AI tools in pathology,\npotentially accelerating biomarker discovery and enhancing precision medicine\ninitiatives."}
{"id": "2509.12409", "pdf": "https://arxiv.org/pdf/2509.12409", "abs": "https://arxiv.org/abs/2509.12409", "authors": ["Ayesha Amjad", "Irina Tsvetkova", "Lena G. Lowry", "David Gene Morgan", "Roya Zandi", "Paul van der Schoot", "Bogdan Dragnea"], "title": "An Assembly-Line Mechanism for In-Vitro Encapsulation of Fragmented Cargo in Virus-Like Particles", "categories": ["cond-mat.soft", "q-bio.QM", "q-bio.SC"], "comment": null, "summary": "The ability of virus shells to encapsulate a wide range of functional\ncargoes, especially multiple cargoes - siRNAs, enzymes, and chromophores - has\nmade them an essential tool in biotechnology for advancing drug delivery\napplications and developing innovative new materials. Here we present a\nmechanistic study of the processes and pathways that lead to multiple cargo\nencapsulation in the co-assembly of virus shell proteins with ligand-coated\nnanoparticles. Based on the structural identification of different\nintermediates, enabled by the contrast in electron microscopy provided by the\nmetal nanoparticles that play the cargo role, we find that multiple cargo\nencapsulation occurs by self-assembly via a specific ``assembly line'' pathway\nthat is different from previously described \\emph{in vitro} assembly mechanisms\nof virus-like particles (VLP). The emerging model explains observations that\nare potentially important for delivery applications, for instance, the\npronounced nanoparticle size selectivity."}
{"id": "2509.12600", "pdf": "https://arxiv.org/pdf/2509.12600", "abs": "https://arxiv.org/abs/2509.12600", "authors": ["Huajun Zhou", "Fengtao Zhou", "Jiabo Ma", "Yingxue Xu", "Xi Wang", "Xiuming Zhang", "Li Liang", "Zhenhui Li", "Hao Chen"], "title": "A Multimodal Foundation Model to Enhance Generalizability and Data Efficiency for Pan-cancer Prognosis Prediction", "categories": ["cs.LG", "cs.AI", "q-bio.QM"], "comment": "27 pages, 7 figures", "summary": "Multimodal data provides heterogeneous information for a holistic\nunderstanding of the tumor microenvironment. However, existing AI models often\nstruggle to harness the rich information within multimodal data and extract\npoorly generalizable representations. Here we present MICE (Multimodal data\nIntegration via Collaborative Experts), a multimodal foundation model that\neffectively integrates pathology images, clinical reports, and genomics data\nfor precise pan-cancer prognosis prediction. Instead of conventional\nmulti-expert modules, MICE employs multiple functionally diverse experts to\ncomprehensively capture both cross-cancer and cancer-specific insights.\nLeveraging data from 11,799 patients across 30 cancer types, we enhanced MICE's\ngeneralizability by coupling contrastive and supervised learning. MICE\noutperformed both unimodal and state-of-the-art multi-expert-based multimodal\nmodels, demonstrating substantial improvements in C-index ranging from 3.8% to\n11.2% on internal cohorts and 5.8% to 8.8% on independent cohorts,\nrespectively. Moreover, it exhibited remarkable data efficiency across diverse\nclinical scenarios. With its enhanced generalizability and data efficiency,\nMICE establishes an effective and scalable foundation for pan-cancer prognosis\nprediction, holding strong potential to personalize tailored therapies and\nimprove treatment outcomes."}
{"id": "2509.12732", "pdf": "https://arxiv.org/pdf/2509.12732", "abs": "https://arxiv.org/abs/2509.12732", "authors": ["Rishab Parthasarathy", "Achintya Bhowmik"], "title": "A Novel Recurrent Neural Network Framework for Prediction and Treatment of Oncogenic Mutation Progression", "categories": ["cs.LG", "cs.CL", "q-bio.QM"], "comment": "12 pages, 11 figures, work originally done in 2022/2023 and was\n  awarded as one of the Regeneron Science Talent Search Finalists in 2022", "summary": "Despite significant medical advancements, cancer remains the second leading\ncause of death, with over 600,000 deaths per year in the US. One emerging\nfield, pathway analysis, is promising but still relies on manually derived wet\nlab data, which is time-consuming to acquire. This work proposes an efficient,\neffective end-to-end framework for Artificial Intelligence (AI) based pathway\nanalysis that predicts both cancer severity and mutation progression, thus\nrecommending possible treatments. The proposed technique involves a novel\ncombination of time-series machine learning models and pathway analysis. First,\nmutation sequences were isolated from The Cancer Genome Atlas (TCGA) Database.\nThen, a novel preprocessing algorithm was used to filter key mutations by\nmutation frequency. This data was fed into a Recurrent Neural Network (RNN)\nthat predicted cancer severity. Then, the model probabilistically used the RNN\npredictions, information from the preprocessing algorithm, and multiple\ndrug-target databases to predict future mutations and recommend possible\ntreatments. This framework achieved robust results and Receiver Operating\nCharacteristic (ROC) curves (a key statistical metric) with accuracies greater\nthan 60%, similar to existing cancer diagnostics. In addition, preprocessing\nplayed an instrumental role in isolating important mutations, demonstrating\nthat each cancer stage studied may contain on the order of a few-hundred key\ndriver mutations, consistent with current research. Heatmaps based on predicted\ngene frequency were also generated, highlighting key mutations in each cancer.\nOverall, this work is the first to propose an efficient, cost-effective\nend-to-end framework for projecting cancer progression and providing possible\ntreatments without relying on expensive, time-consuming wet lab work."}
{"id": "2509.12953", "pdf": "https://arxiv.org/pdf/2509.12953", "abs": "https://arxiv.org/abs/2509.12953", "authors": ["Jaume Banus", "Augustin C. Ogier", "Roger Hullin", "Philippe Meyer", "Ruud B. van Heeswijk", "Jonas Richiardi"], "title": "Spatiotemporal graph neural process for reconstruction, extrapolation, and classification of cardiac trajectories", "categories": ["cs.LG", "cs.SY", "eess.SY", "q-bio.QM"], "comment": null, "summary": "We present a probabilistic framework for modeling structured spatiotemporal\ndynamics from sparse observations, focusing on cardiac motion. Our approach\nintegrates neural ordinary differential equations (NODEs), graph neural\nnetworks (GNNs), and neural processes into a unified model that captures\nuncertainty, temporal continuity, and anatomical structure. We represent\ndynamic systems as spatiotemporal multiplex graphs and model their latent\ntrajectories using a GNN-parameterized vector field. Given the sparse context\nobservations at node and edge levels, the model infers a distribution over\nlatent initial states and control variables, enabling both interpolation and\nextrapolation of trajectories. We validate the method on three synthetic\ndynamical systems (coupled pendulum, Lorenz attractor, and Kuramoto\noscillators) and two real-world cardiac imaging datasets - ACDC (N=150) and UK\nBiobank (N=526) - demonstrating accurate reconstruction, extrapolation, and\ndisease classification capabilities. The model accurately reconstructs\ntrajectories and extrapolates future cardiac cycles from a single observed\ncycle. It achieves state-of-the-art results on the ACDC classification task (up\nto 99% accuracy), and detects atrial fibrillation in UK Biobank subjects with\ncompetitive performance (up to 67% accuracy). This work introduces a flexible\napproach for analyzing cardiac motion and offers a foundation for graph-based\nlearning in structured biomedical spatiotemporal time-series data."}
