{"id": "2507.22088", "pdf": "https://arxiv.org/pdf/2507.22088", "abs": "https://arxiv.org/abs/2507.22088", "authors": ["Dylan Hamitouche", "Tihare Zamorano", "Youcef Barkat", "Deven Parekh", "Lena Palaniyappan", "David Benrimoh"], "title": "Sleep and Activity Patterns as Transdiagnostic Behavioral Biomarkers in Psychiatry: Initial Insights from the DeeP-DD study", "categories": ["q-bio.QM"], "comment": null, "summary": "Background: Symptom rating scales in psychiatry are limited by reliance on\nself-report, and lack of predictive power. Actigraphy, a passive wearable-based\nmethod for measuring sleep and physical activity, offers objective,\nhigh-resolution behavioral data that may better reflect symptom fluctuations,\nbut most studies have focused on narrow diagnostic groups or fixed time\nwindows, limiting clinical translation. Objective: To examine whether\nactigraphy-derived sleep and activity features correlate with psychiatric\nsymptom severity in a transdiagnostic psychiatric sample, and to identify which\nfeatures are most clinically relevant across multiple temporal resolutions.\nMethods: We present a feasibility case series study with preliminary data from\neight outpatients enrolled in the DeeP-DD study, a transdiagnostic study of\ndigital phenotyping. Participants wore GENEActiv actigraphy devices and symptom\nseverity was measured using a variety of validated scales. We performed\nintra-individual Spearman correlations and inter-individual repeated measures\ncorrelations across daily, weekly, monthly, and full-duration averages.\nResults: Intra-individual analyses revealed that later rise times were\nsignificantly associated with higher weekly PHQ-9 scores in participant #7\n(\\r{ho} = 0.74, P=.0003) and participant #4 (\\r{ho} = 0.78, P=.022), as well as\nhigher weekly GAD-7 scores in participant #7 (\\r{ho} = 0.59, P=.026).\nInter-individual analyses showed that weeks with later average rise time\ncorrelated with higher PHQ-9 (r = 0.48, P=.0003) and GAD-7 scores (r = 0.38,\nP=.032). Increased light physical activity was linked to lower PHQ-9 scores\nweekly (r = -0.44, P=.001) and monthly (r = -0.53, P=.014). Conclusion:\nConsistent associations between actigraphy features and symptoms across\ntemporal scales and diagnostic groups underscore their potential utility for\nscalable, real-world clinical monitoring."}
{"id": "2507.22092", "pdf": "https://arxiv.org/pdf/2507.22092", "abs": "https://arxiv.org/abs/2507.22092", "authors": ["Gianluca Carloni", "Biagio Brattoli", "Seongho Keum", "Jongchan Park", "Taebum Lee", "Chang Ho Ahn", "Sergio Pereira"], "title": "Pathology Foundation Models are Scanner Sensitive: Benchmark and Mitigation with Contrastive ScanGen Loss", "categories": ["q-bio.QM", "cs.AI", "cs.CV", "eess.IV", "q-bio.TO", "I.2; I.2.6; I.4; I.4.7; I.5; J.3; J.6"], "comment": "Accepted (Oral) in MedAGI 2025 International Workshop at MICCAI\n  Conference", "summary": "Computational pathology (CPath) has shown great potential in mining\nactionable insights from Whole Slide Images (WSIs). Deep Learning (DL) has been\nat the center of modern CPath, and while it delivers unprecedented performance,\nit is also known that DL may be affected by irrelevant details, such as those\nintroduced during scanning by different commercially available scanners. This\nmay lead to scanner bias, where the model outputs for the same tissue acquired\nby different scanners may vary. In turn, it hinders the trust of clinicians in\nCPath-based tools and their deployment in real-world clinical practices. Recent\npathology Foundation Models (FMs) promise to provide better domain\ngeneralization capabilities. In this paper, we benchmark FMs using a\nmulti-scanner dataset and show that FMs still suffer from scanner bias.\nFollowing this observation, we propose ScanGen, a contrastive loss function\napplied during task-specific fine-tuning that mitigates scanner bias, thereby\nenhancing the models' robustness to scanner variations. Our approach is applied\nto the Multiple Instance Learning task of Epidermal Growth Factor Receptor\n(EGFR) mutation prediction from H\\&E-stained WSIs in lung cancer. We observe\nthat ScanGen notably enhances the ability to generalize across scanners, while\nretaining or improving the performance of EGFR mutation prediction."}
{"id": "2507.22210", "pdf": "https://arxiv.org/pdf/2507.22210", "abs": "https://arxiv.org/abs/2507.22210", "authors": ["Aviv Spinner", "Erika DeBenedictis", "Corey M. Hudson"], "title": "Scaling and Data Saturation in Protein Language Models", "categories": ["q-bio.QM"], "comment": "Presented at the GenBio Workshop, ICML 2025", "summary": "Data in biology is redundant, noisy, and sparse. How does the type and scale\nof available data impact model performance? In this work, we specifically\ninvestigate how protein language models (pLMs) scale with increasing\npretraining data. We investigate this relationship by measuring the performance\nof protein function prediction on a suite of pLMs pretrained on yearly\nsnapshots of UniRef100 from 2011 to 2024. We find no evidence of model\nsaturation on this task: performance improves--but not monotonically--with\nadded data, and this trend differs between unsupervised and supervised\nexperiments. Using a well-characterized Beta-Lactamase protein from E. coli, we\nfind that unsupervised model predictions get better year-over-year, though they\ndo not yet consistently perform better than the supervised baseline. Our\nresults underscore the need for targeted data acquisition and deeper study of\ndata scaling in protein modeling. All training, inference, analysis, and\nvisualization code is available at:\nhttps://github.com/Align-to-Innovate/data-saturation-and-scaling."}
{"id": "2507.22212", "pdf": "https://arxiv.org/pdf/2507.22212", "abs": "https://arxiv.org/abs/2507.22212", "authors": ["Levin M Moser", "Ahmad Kamal Hamid", "Esteban Miglietta", "Nodar Gogoberidze", "Beth A Cimini"], "title": "Evaluating Integrative Strategies for Incorporating Phenotypic Features in Spatial Transcriptomics", "categories": ["q-bio.QM"], "comment": null, "summary": "Spatial transcriptomics (ST) technologies not only offer an unprecedented\nopportunity to interrogate intact biological samples in a spatially informed\nmanner, but also set the stage for integration with other imaging-based\nmodalities. However, how to best exploit spatial context and integrate ST with\nimaging-based modalities remains an open question. To address this,\nparticularly under real-world experimental constraints such as limited dataset\nsize, class imbalance, and bounding-box-based segmentation, we used a publicly\navailable murine ileum MERFISH dataset to evaluate whether a minimally tuned\nvariational autoencoder (VAE) could extract informative low-dimensional\nrepresentations from cell crops of spot counts, nuclear stain, membrane stain,\nor a combination thereof. We assessed the resulting embeddings through\nPERMANOVA, cross-validated classification, and unsupervised Leiden clustering,\nand compared them to classical image-based feature vectors extracted via\nCellProfiler. While transcript counts (TC) generally outperformed other feature\nspaces, the VAE-derived latent spaces (LSs) captured meaningful biological\nvariation and enabled improved label recovery for specific cell types. LS2, in\nparticular, trained solely on morphological input, also exhibited moderate\npredictive power for a handful of genes in a ridge regression model. Notably,\ncombining TC with LSs through multiplex clustering led to consistent gains in\ncluster homogeneity, a trend that also held when augmenting only subsets of TC\nwith the stain-derived LS2. In contrast, CellProfiler-derived features\nunderperformed relative to LSs, highlighting the advantage of learned\nrepresentations over hand-crafted features. Collectively, these findings\ndemonstrate that even under constrained conditions, VAEs can extract\nbiologically meaningful signals from imaging data and constitute a promising\nstrategy for multi-modal integration."}
{"id": "2507.22256", "pdf": "https://arxiv.org/pdf/2507.22256", "abs": "https://arxiv.org/abs/2507.22256", "authors": ["Jun Won Park", "Kangyu Zhao", "Sanket Rane"], "title": "Spatiodynamic inference using vision-based generative modelling", "categories": ["q-bio.QM", "q-bio.PE"], "comment": null, "summary": "Biological systems commonly exhibit complex spatiotemporal patterns whose\nunderlying generative mechanisms pose a significant analytical challenge.\nTraditional approaches to spatiodynamic inference rely on dimensionality\nreduction through summary statistics, which sacrifice complexity and\ninterdependent structure intrinsic to these data in favor of parameter\nidentifiability. This imposes a fundamental constraint on reliably extracting\nmechanistic insights from spatiotemporal data, highlighting the need for\nanalytical frameworks that preserve the full richness of these dynamical\nsystems. To address this, we developed a simulation-based inference framework\nthat employs vision transformer-driven variational encoding to generate compact\nrepresentations of the data, exploiting the inherent contextual dependencies.\nThese representations are subsequently integrated into a likelihood-free\nBayesian approach for parameter inference. The central idea is to construct a\nfine-grained, structured mesh of latent representations from simulated dynamics\nthrough systematic exploration of the parameter space. This encoded mesh of\nlatent embeddings then serves as a reference map for retrieving parameter\nvalues that correspond to observed data. By integrating generative modeling\nwith Bayesian principles, our approach provides a unified inference framework\nto identify both spatial and temporal patterns that manifest in multivariate\ndynamical systems."}
{"id": "2507.22587", "pdf": "https://arxiv.org/pdf/2507.22587", "abs": "https://arxiv.org/abs/2507.22587", "authors": ["Alexandre Durrmeyer", "Jean-Christophe Palauqui", "Philippe Andrey"], "title": "Deep learning of geometrical cell division rules", "categories": ["cs.LG", "q-bio.CB", "q-bio.QM", "I.2.6; I.6; J.3"], "comment": "44 pages, 6 figures, 1 supplementary table, 15 supplementary figures", "summary": "The positioning of new cellular walls during cell division plays a key role\nin shaping plant tissue organization. The influence of cell geometry on the\npositioning of division planes has been previously captured into various\ngeometrical rules. Accordingly, linking cell shape to division orientation has\nrelied on the comparison between observed division patterns and predictions\nunder specific rules. The need to define a priori the tested rules is a\nfundamental limitation of this hypothesis-driven approach. As an alternative,\nwe introduce a data-based approach to investigate the relation between cell\ngeometry and division plane positioning, exploiting the ability of deep neural\nnetwork to learn complex relationships across multidimensional spaces. Adopting\nan image-based cell representation, we show how division patterns can be\nlearned and predicted from mother cell geometry using a UNet architecture\nmodified to operate on cell masks. Using synthetic data and A. thaliana embryo\ncells, we evaluate the model performances on a wide range of diverse cell\nshapes and division patterns. We find that the trained model accounted for\nembryo division patterns that were previously irreconcilable under existing\ngeometrical rules. Our work shows the potential of deep networks to understand\ncell division patterns and to generate new hypotheses on the control of cell\ndivision positioning."}
{"id": "2507.22710", "pdf": "https://arxiv.org/pdf/2507.22710", "abs": "https://arxiv.org/abs/2507.22710", "authors": ["Filippo Utro", "Meltem Tolunay", "Kahn Rhrissorrakrai", "Tanvi P. Gujarati", "Jie Shi", "Sara Capponi", "Mirko Amico", "Nate Earnest-Noble", "Laxmi Parida"], "title": "Enhanced Prediction of CAR T-Cell Cytotoxicity with Quantum-Kernel Methods", "categories": ["cs.LG", "q-bio.QM", "quant-ph"], "comment": null, "summary": "Chimeric antigen receptor (CAR) T-cells are T-cells engineered to recognize\nand kill specific tumor cells. Through their extracellular domains, CAR T-cells\nbind tumor cell antigens which triggers CAR T activation and proliferation.\nThese processes are regulated by co-stimulatory domains present in the\nintracellular region of the CAR T-cell. Through integrating novel signaling\ncomponents into the co-stimulatory domains, it is possible to modify CAR T-cell\nphenotype. Identifying and experimentally testing new CAR constructs based on\nlibraries of co-stimulatory domains is nontrivial given the vast combinatorial\nspace defined by such libraries. This leads to a highly data constrained,\npoorly explored combinatorial problem, where the experiments undersample all\npossible combinations. We propose a quantum approach using a Projected Quantum\nKernel (PQK) to address this challenge. PQK operates by embedding classical\ndata into a high dimensional Hilbert space and employs a kernel method to\nmeasure sample similarity. Using 61 qubits on a gate-based quantum computer, we\ndemonstrate the largest PQK application to date and an enhancement in the\nclassification performance over purely classical machine learning methods for\nCAR T cytotoxicity prediction. Importantly, we show improved learning for\nspecific signaling domains and domain positions, particularly where there was\nlower information highlighting the potential for quantum computing in\ndata-constrained problems."}
