{"id": "2508.05705", "pdf": "https://arxiv.org/pdf/2508.05705", "abs": "https://arxiv.org/abs/2508.05705", "authors": ["Valentina Roquemen-Echeverri", "Taisa Kushner", "Peter G. Jacobs", "Clara Mosquera-Lopez"], "title": "A Physiologically-Constrained Neural Network Digital Twin Framework for Replicating Glucose Dynamics in Type 1 Diabetes", "categories": ["q-bio.QM", "cs.AI", "cs.LG"], "comment": null, "summary": "Simulating glucose dynamics in individuals with type 1 diabetes (T1D) is\ncritical for developing personalized treatments and supporting data-driven\nclinical decisions. Existing models often miss key physiological aspects and\nare difficult to individualize. Here, we introduce physiologically-constrained\nneural network (NN) digital twins to simulate glucose dynamics in T1D. To\nensure interpretability and physiological consistency, we first build a\npopulation-level NN state-space model aligned with a set of ordinary\ndifferential equations (ODEs) describing glucose regulation. This model is\nformally verified to conform to known T1D dynamics. Digital twins are then\ncreated by augmenting the population model with individual-specific models,\nwhich include personal data, such as glucose management and contextual\ninformation, capturing both inter- and intra-individual variability. We\nvalidate our approach using real-world data from the T1D Exercise Initiative\nstudy. Two weeks of data per participant were split into 5-hour sequences and\nsimulated glucose profiles were compared to observed ones. Clinically relevant\noutcomes were used to assess similarity via paired equivalence t-tests with\npredefined clinical equivalence margins. Across 394 digital twins, glucose\noutcomes were equivalent between simulated and observed data: time in range\n(70-180 mg/dL) was 75.1$\\pm$21.2% (simulated) vs. 74.4$\\pm$15.4% (real;\nP<0.001); time below range (<70 mg/dL) 2.5$\\pm$5.2% vs. 3.0$\\pm$3.3% (P=0.022);\nand time above range (>180 mg/dL) 22.4$\\pm$22.0% vs. 22.6$\\pm$15.9% (P<0.001).\nOur framework can incorporate unmodeled factors like sleep and activity while\npreserving key dynamics. This approach enables personalized in silico testing\nof treatments, supports insulin optimization, and integrates physics-based and\ndata-driven modeling. Code: https://github.com/mosqueralopez/T1DSim_AI"}
{"id": "2508.05800", "pdf": "https://arxiv.org/pdf/2508.05800", "abs": "https://arxiv.org/abs/2508.05800", "authors": ["Erik Serrano", "John Peters", "Jesko Wagner", "Rebecca E. Graham", "Zhenghao Chen", "Brian Feng", "Gisele Miranda", "Alexandr A. Kalinin", "Loan Vulliard", "Jenna Tomkinson", "Cameron Mattson", "Michael J. Lippincott", "Ziqi Kang", "Divya Sitani", "Dave Bunten", "Srijit Seal", "Neil O. Carragher", "Anne E. Carpenter", "Shantanu Singh", "Paula A. Marin Zapata", "Juan C. Caicedo", "Gregory P. Way"], "title": "Progress and new challenges in image-based profiling", "categories": ["q-bio.QM", "eess.IV"], "comment": "3 figures, 2 boxes, 5 tables", "summary": "For over two decades, image-based profiling has revolutionized cellular\nphenotype analysis. Image-based profiling processes rich, high-throughput,\nmicroscopy data into unbiased measurements that reveal phenotypic patterns\npowerful for drug discovery, functional genomics, and cell state\nclassification. Here, we review the evolving computational landscape of\nimage-based profiling, detailing current procedures, discussing limitations,\nand highlighting future development directions. Deep learning has fundamentally\nreshaped image-based profiling, improving feature extraction, scalability, and\nmultimodal data integration. Methodological advancements such as single-cell\nanalysis and batch effect correction, drawing inspiration from single-cell\ntranscriptomics, have enhanced analytical precision. The growth of open-source\nsoftware ecosystems and the development of community-driven standards have\nfurther democratized access to image-based profiling, fostering reproducibility\nand collaboration across research groups. Despite these advancements, the field\nstill faces significant challenges requiring innovative solutions. By focusing\non the technical evolution of image-based profiling rather than the\nwide-ranging biological applications, our aim with this review is to provide\nresearchers with a roadmap for navigating the progress and new challenges in\nthis rapidly advancing domain."}
{"id": "2508.05692", "pdf": "https://arxiv.org/pdf/2508.05692", "abs": "https://arxiv.org/abs/2508.05692", "authors": ["Xiao-Xuan Cai", "Jing-Shan Liao", "Jia-Jun Ma", "Yu-Xuan Pang", "Yi-Gang Chen", "Yang-Chi-Dung Lin", "Yi-Dan Chen", "Xin Cao", "Yi-Cheng Zhang", "Tao-Sheng Xu", "Tzong-Yi Lee", "Hsi-Yuan Huang", "Hsien-Da Huang"], "title": "SiCmiR Atlas: Single-Cell miRNA Landscapes Reveals Hub-miRNA and Network Signatures in Human Cancers", "categories": ["q-bio.GN"], "comment": null, "summary": "microRNA are pivotal post-transcriptional regulators whose single-cell\nbehavior has remained largely inaccessible owing to technical barriers in\nsingle-cell small-RNA profiling. We present SiCmiR, a two-layer neural network\nthat predicts miRNA expression profile from only 977 LINCS L1000 landmark genes\nreducing sensitivity to dropout of single-cell RNA-seq data. Proof-of-concept\nanalyses illustrate how SiCmiR can uncover candidate hub-miRNAs in bulk-seq\ncell lines and hepatocellular carcinoma, scRNA-seq pancreatic ductal carcinoma\nand ACTH-secreting pituitary adenoma and extracellular-vesicle-mediated\ncrosstalk in glioblastoma. Trained on 6462 TCGA paired miRNA-mRNA samples,\nSiCmiR attains state-of-the-art accuracy on held-out cancers and generalizes to\nunseen cancer types, drug perturbations and scRNA-seq. We next constructed\nSiCmiR-Atlas, containing 632 public datasets, 9.36 million cells, 726 cell\ntypes, which is the first dedicated database of single-cell mature miRNA\nexpression--providing interactive visualization, biomarker identification and\ncell-type-resolved miRNA-target networks. SiCmiR transforms bulk-derived\nstatistical power into a single-cell view of miRNA biology and provides a\ncommunity resource SiCmiR Atlas for biomarker discovery. SiCmiR Atlas is\navilable at https://awi.cuhk.edu.cn/~SiCmiR/."}
