{"id": "2511.05529", "pdf": "https://arxiv.org/pdf/2511.05529", "abs": "https://arxiv.org/abs/2511.05529", "authors": ["Jophy Lin"], "title": "Selective Diabetic Retinopathy Screening with Accuracy-Weighted Deep Ensembles and Entropy-Guided Abstention", "categories": ["q-bio.QM", "cs.AI", "cs.CV"], "comment": null, "summary": "Diabetic retinopathy (DR), a microvascular complication of diabetes and a leading cause of preventable blindness, is projected to affect more than 130 million individuals worldwide by 2030. Early identification is essential to reduce irreversible vision loss, yet current diagnostic workflows rely on methods such as fundus photography and expert review, which remain costly and resource-intensive. This, combined with DR's asymptomatic nature, results in its underdiagnosis rate of approximately 25 percent. Although convolutional neural networks (CNNs) have demonstrated strong performance in medical imaging tasks, limited interpretability and the absence of uncertainty quantification restrict clinical reliability. Therefore, in this study, a deep ensemble learning framework integrated with uncertainty estimation is introduced to improve robustness, transparency, and scalability in DR detection. The ensemble incorporates seven CNN architectures-ResNet-50, DenseNet-121, MobileNetV3 (Small and Large), and EfficientNet (B0, B2, B3)- whose outputs are fused through an accuracy-weighted majority voting strategy. A probability-weighted entropy metric quantifies prediction uncertainty, enabling low-confidence samples to be excluded or flagged for additional review. Training and validation on 35,000 EyePACS retinal fundus images produced an unfiltered accuracy of 93.70 percent (F1 = 0.9376). Uncertainty-filtering later was conducted to remove unconfident samples, resulting in maximum-accuracy of 99.44 percent (F1 = 0.9932). The framework shows that uncertainty-aware, accuracy-weighted ensembling improves reliability without hindering performance. With confidence-calibrated outputs and a tunable accuracy-coverage trade-off, it offers a generalizable paradigm for deploying trustworthy AI diagnostics in high-risk care."}
{"id": "2511.06426", "pdf": "https://arxiv.org/pdf/2511.06426", "abs": "https://arxiv.org/abs/2511.06426", "authors": ["Kaikwan Lau", "Gary P. T. Choi"], "title": "Geometric and statistical analysis of avian skull morphology", "categories": ["q-bio.QM"], "comment": null, "summary": "Understanding the growth and form of shapes is one of the most fundamental problems in biology. While many prior works have analyzed the beak shapes of Darwin's finches, other cranial features are relatively less explored. In this work, we develop geometric and statistical methods for analyzing the skull morphology of Darwin's finches and their relatives, focusing on the relationship between their skull dimensions, orbit curvature, and neurocranial geometries. Specifically, by utilizing tools in computational geometry, differential geometry, and numerical optimization, we develop efficient algorithms for quantifying various key geometric features of the skull. We then perform a statistical analysis and discover a strong correlation between skull size and orbit curvature. Based on our findings, we further establish a predictive model that can estimate the orbit curvature using easily obtainable linear skull measurements. Our results show that the predictive model is highly effective and is capable of explaining 85.48\\% of the variance (R-squared) in curvature with an average prediction error of only 6.35\\%. Altogether, our work provides a quantitative foundation for understanding the functional and evolutionary pressures that shape avian skulls, thereby offering a validated framework for future studies in comparative anatomy and evolutionary biology."}
{"id": "2511.06662", "pdf": "https://arxiv.org/pdf/2511.06662", "abs": "https://arxiv.org/abs/2511.06662", "authors": ["Franklin Lee", "Tengfei Ma"], "title": "Dual-Pathway Fusion of EHRs and Knowledge Graphs for Predicting Unseen Drug-Drug Interactions", "categories": ["cs.LG", "q-bio.QM"], "comment": "ML4H 2025 Findings", "summary": "Drug-drug interactions (DDIs) remain a major source of preventable harm, and many clinically important mechanisms are still unknown. Existing models either rely on pharmacologic knowledge graphs (KGs), which fail on unseen drugs, or on electronic health records (EHRs), which are noisy, temporal, and site-dependent. We introduce, to our knowledge, the first system that conditions KG relation scoring on patient-level EHR context and distills that reasoning into an EHR-only model for zero-shot inference. A fusion \"Teacher\" learns mechanism-specific relations for drug pairs represented in both sources, while a distilled \"Student\" generalizes to new or rarely used drugs without KG access at inference. Both operate under a shared ontology (set) of pharmacologic mechanisms (drug relations) to produce interpretable, auditable alerts rather than opaque risk scores. Trained on a multi-institution EHR corpus paired with a curated DrugBank DDI graph, and evaluated using a clinically aligned, decision-focused protocol with leakage-safe negatives that avoid artificially easy pairs, the system maintains precision across multi-institutuion test data, produces mechanism-specific, clinically consistent predictions, reduces false alerts (higher precision) at comparable overall detection performance (F1), and misses fewer true interactions compared to prior methods. Case studies further show zero-shot identification of clinically recognized CYP-mediated and pharmacodynamic mechanisms for drugs absent from the KG, supporting real-world use in clinical decision support and pharmacovigilance."}
