{"id": "2509.16301", "pdf": "https://arxiv.org/pdf/2509.16301", "abs": "https://arxiv.org/abs/2509.16301", "authors": ["Tiantian Yang", "Zhiqian Chen"], "title": "TF-DWGNet: A Directed Weighted Graph Neural Network with Tensor Fusion for Multi-Omics Cancer Subtype Classification", "categories": ["q-bio.QM", "cs.LG", "62R07"], "comment": "9 pages, 4 figures, 4 tables", "summary": "Integration and analysis of multi-omics data provide valuable insights for\ncancer subtype classification. However, such data are inherently heterogeneous,\nhigh-dimensional, and exhibit complex intra- and inter-modality dependencies.\nRecent advances in graph neural networks (GNNs) offer powerful tools for\nmodeling such structure. Yet, most existing methods rely on prior knowledge or\npredefined similarity networks to construct graphs, which are often undirected\nor unweighted, failing to capture the directionality and strength of biological\ninteractions. Interpretability at both the modality and feature levels also\nremains limited. To address these challenges, we propose TF-DWGNet, a novel\nGraph Neural Network framework that combines tree-based Directed Weighted graph\nconstruction with Tensor Fusion for multiclass cancer subtype classification.\nTF-DWGNet introduces two key innovations: a supervised tree-based approach for\nconstructing directed, weighted graphs tailored to each omics modality, and a\ntensor fusion mechanism that captures unimodal, bimodal, and trimodal\ninteractions using low-rank decomposition for efficiency. TF-DWGNet enables\nmodality-specific representation learning, joint embedding fusion, and\ninterpretable subtype prediction. Experiments on real-world cancer datasets\nshow that TF-DWGNet consistently outperforms state-of-the-art baselines across\nmultiple metrics and statistical tests. Moreover, it provides biologically\nmeaningful insights by ranking influential features and modalities. These\nresults highlight TF-DWGNet's potential for effective and interpretable\nmulti-omics integration in cancer research."}
{"id": "2509.16486", "pdf": "https://arxiv.org/pdf/2509.16486", "abs": "https://arxiv.org/abs/2509.16486", "authors": ["Travis E. Gibson"], "title": "Comment on \"mbtransfer: Microbiome intervention analysis using transfer functions and mirror statistics\": Implementation errors, theoretical misapplication, and methodological flaws", "categories": ["q-bio.QM"], "comment": "10 pages, 2 figures. Comment on arXiv:2306.06364, with the published\n  version in PLOS Computational Biology as doi:10.1371/journal.pcbi.1012196", "summary": "There are a number of errors in \"mbtransfer: Microbiome intervention analysis\nusing transfer functions and mirror statistics\" PLOS Comp Bio (2024) spanning\nmultiple aspects of the paper. The wrong inputs were provided to comparator\nmethods for model training, when forecasting one method was provided initial\nconditions in the wrong units, and performance metrics were calculated without\nproper unit conversion. The false discovery rate and power analysis conclusions\nprovided in the text are not supported by theory or the empirical testing that\nwas performed within the paper. The paper also has data leakage issues,\nequations are written down incorrectly, and incorrect definitions/terminology\nare used."}
{"id": "2509.16571", "pdf": "https://arxiv.org/pdf/2509.16571", "abs": "https://arxiv.org/abs/2509.16571", "authors": ["R. He"], "title": "Enhancing Antimicrobial Molecule Prediction via Dynamic Routing Capsule Networks and Multi-Source Molecular Embeddings", "categories": ["q-bio.QM"], "comment": null, "summary": "Antibiotics are a vital class of drugs closely associated with the prevention\nand treatment of bacterial infections. Accurate prediction of molecular\nantimicrobial activity remains a key challenge in the pursuit of novel\nantibiotic candidates. However, laboratory-based antimicrobial compounds\nidentification is costly, time-consuming, and prone to rediscovering known\nantibiotics, highlighting the urgent need for efficient and accurate\ncomputational models. Recent advances in machine learning (ML) and deep\nlearning (DL) have significantly enhanced the ability to explore chemical space\nand identify potential antimicrobial compounds. In this study, we particularly\nemphasize deep learning models and employ five chemistry language models\ntailored for chemical data to encode small molecules. Our model incorporates a\nunique capsule network architecture and introduces innovations in loss function\nselection and feature processing modules, demonstrating superior performance in\npredicting inhibitory activities against Escherichia coli and Acinetobacter\nbaumannii. We conducted a series of ablation studies to elucidate the\ncontributions of network design and input features. Case studies validated the\nusability and effectiveness of our model.To facilitate accessibility, we\ndeveloped an intuitive web portal to disseminate this novel tool. Our results\nindicate that the proposed approach offers improved predictive accuracy and\nenhanced interpretability, underscoring the potential of interpretable\nartificial intelligence methods in accelerating antibiotic discovery and\naddressing the urgent challenge of antimicrobial resistance."}
{"id": "2509.16908", "pdf": "https://arxiv.org/pdf/2509.16908", "abs": "https://arxiv.org/abs/2509.16908", "authors": ["Sixtus Dakurah"], "title": "Discrete Heat Kernels on Simplicial Complexes and Its Application to Functional Brain Networks", "categories": ["q-bio.QM", "q-bio.NC"], "comment": null, "summary": "Networks constitute fundamental organizational structures across biological\nsystems, although conventional graph-theoretic analyses capture exclusively\npairwise interactions, thereby omitting the intricate higher-order\nrelationships that characterize network complexity. This work proposes a\nunified framework for heat kernel smoothing on simplicial complexes, extending\nclassical signal processing methodologies from vertices and edges to cycles and\nhigher-dimensional structures. Through Hodge Laplacian, a discrete heat kernel\non a finite simplicial complex $\\mathcal{K}$ is constructed to smooth signals\non $k$-simplices via the boundary operator $\\partial_k$. Computationally\nefficient sparse algorithms for constructing boundary operators are developed\nto implement linear diffusion processes on $k$-simplices. The methodology\ngeneralizes heat kernel smoothing to $k$-simplices, utilizing boundary\nstructure to localize topological features while maintaining homological\ninvariance. Simulation studies demonstrate qualitative signal enhancement\nacross vertex and edge domains following diffusion processes. Application to\nparcellated human brain functional connectivity networks reveals that\nsimplex-space smoothing attenuates spurious connections while amplifying\ncoherent anatomical architectures, establishing practical significance for\ncomputational neuroscience applications."}
{"id": "2509.17594", "pdf": "https://arxiv.org/pdf/2509.17594", "abs": "https://arxiv.org/abs/2509.17594", "authors": ["Erika M. Herrera Machado", "Jakob L. Andersen", "Rolf Fagerberg", "Daniel Merkle"], "title": "A Sensitivity Analysis Methodology For Rule-Based Stochastic Chemical Systems", "categories": ["q-bio.QM", "q-bio.MN"], "comment": null, "summary": "In this study, we introduce a sensitivity analysis methodology for stochastic\nsystems in chemistry, where dynamics are often governed by random processes.\nOur approach is based on gradient estimation via finite differences, averaging\nsimulation outcomes, and analyzing variability under intrinsic noise. We\ncharacterize gradient uncertainty as an angular range within which all\nplausible gradient directions are expected to lie. This uncertainty measure\nadaptively guides the number of simulations performed for each\nnominal-perturbation pair of points in order to minimize unnecessary\ncomputations while maintaining robustness.\n  Systematically exploring a range of parameter values across the parameter\nspace, rather than focusing on a single value, allows us to identify not only\nsensitive parameters but also regions of parameter space associated with\ndifferent levels of sensitivity. These results are visualized through vector\nfield plots to offer an intuitive representation of local sensitivity across\nparameter space. Additionally, global sensitivity coefficients are computed to\ncapture overall trends.\n  Flexibility regarding the choice of output observable measures is another key\nfeature of our method: while traditional sensitivity analyses often focus on\nspecies concentrations, our framework allows for the definition of a large\nrange of problem-specific observables. This makes it broadly applicable in\ndiverse chemical and biochemical scenarios. We demonstrate our approach on two\nsystems: classical Michaelis-Menten kinetics and a rule-based model of the\nformose reaction, using the cheminformatics software M{\\O}D for Gillespie-based\nstochastic simulations."}
{"id": "2509.18050", "pdf": "https://arxiv.org/pdf/2509.18050", "abs": "https://arxiv.org/abs/2509.18050", "authors": ["Katherina Cortes", "Daniel Korn", "Sarah Gehrke", "Kevin Schaper", "Corey Cox", "Patrick Golden", "Aaron Odell", "Bryan Laraway", "Madan Krishnamurthy", "Justin Reese", "Harry Caufield", "Sierra Moxon", "Ellen Elias", "Christopher J Mungall", "Melissa Haendel"], "title": "Why we need all the organisms: an exploration of the Monarch knowledge graph to aid mechanism discovery", "categories": ["q-bio.QM"], "comment": null, "summary": "Research done using model organisms has been fundamental to the biological\nunderstanding of human genes, diseases and phenotypes. Model organisms provide\ntractable systems for experiments to enhance understanding of biological\nmechanisms conserved across the evolutionary tree. Decades of model organism\nresearch has generated vast amounts of data; however, this data is split across\nmany domains, organisms, and biological fields of research. Knowledge graphs\n(KGs) are a computational way to aggregate and compile disparate information in\na parsable format. By unifying data across studies, organisms and time points,\nKG researchers can create novel targeted hypotheses. Here we demonstrate how\nmodel organisms are connected to humans and other organisms through genes,\ndiseases and phenotypes allowing for a broader understanding of genetic biology\nthan just one organism alone can provide. Utilizing resources such as the\nMonarch KG is a great way to reduce redundant experiments and find directions\npreviously unexplored."}
{"id": "2509.16629", "pdf": "https://arxiv.org/pdf/2509.16629", "abs": "https://arxiv.org/abs/2509.16629", "authors": ["Kaichen Xu", "Yihang Du", "Mianpeng Liu", "Zimu Yu", "Xiaobo Sun"], "title": "Causality-Induced Positional Encoding for Transformer-Based Representation Learning of Non-Sequential Features", "categories": ["cs.LG", "q-bio.QM"], "comment": "Accepted by NeurIPS 2025", "summary": "Positional encoding is essential for supplementing transformer with\npositional information of tokens. Existing positional encoding methods demand\npredefined token/feature order, rendering them unsuitable for real-world data\nwith non-sequential yet causally-related features. To address this limitation,\nwe propose CAPE, a novel method that identifies underlying causal structure\nover non-sequential features as a weighted directed acyclic graph (DAG) using\ngeneralized structural equation modeling. The DAG is then embedded in\nhyperbolic space where its geometric structure is well-preserved using a\nhyperboloid model-based approach that effectively captures two important causal\ngraph properties (causal strength & causal specificity). This step yields\ncausality-aware positional encodings for the features, which are converted into\ntheir rotary form for integrating with transformer's self-attention mechanism.\nTheoretical analysis reveals that CAPE-generated rotary positional encodings\npossess three valuable properties for enhanced self-attention, including causal\ndistance-induced attenuation, causal generality-induced attenuation, and\nrobustness to positional disturbances. We evaluate CAPE over both synthetic and\nreal-word datasets, empirically demonstrating its theoretical properties and\neffectiveness in enhancing transformer for data with non-sequential features.\nOur code is available at https://github.com/Catchxu/CAPE."}
{"id": "2509.17174", "pdf": "https://arxiv.org/pdf/2509.17174", "abs": "https://arxiv.org/abs/2509.17174", "authors": ["Kijung Yoon"], "title": "Self-Supervised Discovery of Neural Circuits in Spatially Patterned Neural Responses with Graph Neural Networks", "categories": ["q-bio.NC", "cs.LG", "q-bio.QM"], "comment": "To appear in NeurIPS 2025", "summary": "Inferring synaptic connectivity from neural population activity is a\nfundamental challenge in computational neuroscience, complicated by partial\nobservability and mismatches between inference models and true circuit\ndynamics. In this study, we propose a graph-based neural inference model that\nsimultaneously predicts neural activity and infers latent connectivity by\nmodeling neurons as interacting nodes in a graph. The architecture features two\ndistinct modules: one for learning structural connectivity and another for\npredicting future spiking activity via a graph neural network (GNN). Our model\naccommodates unobserved neurons through auxiliary nodes, allowing for inference\nin partially observed circuits. We evaluate this approach using synthetic data\nfrom ring attractor networks and real spike recordings from head direction\ncells in mice. Across a wide range of conditions, including varying recurrent\nconnectivity, external inputs, and incomplete observations, our model\nconsistently outperforms standard baselines, resolving spurious correlations\nmore effectively and recovering accurate weight profiles. When applied to real\ndata, the inferred connectivity aligns with theoretical predictions of\ncontinuous attractor models. These results highlight the potential of GNN-based\nmodels to infer latent neural circuitry through self-supervised structure\nlearning, while leveraging the spike prediction task to flexibly link\nconnectivity and dynamics across both simulated and biological neural systems."}
{"id": "2509.17305", "pdf": "https://arxiv.org/pdf/2509.17305", "abs": "https://arxiv.org/abs/2509.17305", "authors": ["Jiarui Li", "Zixiang Yin", "Zhengming Ding", "Samuel J. Landry", "Ramgopal R. Mettu"], "title": "Rational Multi-Modal Transformers for TCR-pMHC Prediction", "categories": ["cs.CE", "q-bio.QM"], "comment": "The 16th ACM Conference on Bioinformatics, Computational Biology, and\n  Health Informatics (ACM-BCB 2025)", "summary": "T cell receptor (TCR) recognition of peptide-MHC (pMHC) complexes is\nfundamental to adaptive immunity and central to the development of T cell-based\nimmunotherapies. While transformer-based models have shown promise in\npredicting TCR-pMHC interactions, most lack a systematic and explainable\napproach to architecture design. We present an approach that uses a new\npost-hoc explainability method to inform the construction of a novel\nencoder-decoder transformer model. By identifying the most informative\ncombinations of TCR and epitope sequence inputs, we optimize cross-attention\nstrategies, incorporate auxiliary training objectives, and introduce a novel\nearly-stopping criterion based on explanation quality. Our framework achieves\nstate-of-the-art predictive performance while simultaneously improving\nexplainability, robustness, and generalization. This work establishes a\nprincipled, explanation-driven strategy for modeling TCR-pMHC binding and\noffers mechanistic insights into sequence-level binding behavior through the\nlens of deep learning."}
{"id": "2509.17891", "pdf": "https://arxiv.org/pdf/2509.17891", "abs": "https://arxiv.org/abs/2509.17891", "authors": ["Tahir Yusufaly", "Hamid Abdollahi", "Babak Saboury", "Arman Rahmim"], "title": "Quantitative and Computational Radiobiology for Precision Radiopharmaceutical Therapies", "categories": ["physics.med-ph", "q-bio.QM"], "comment": null, "summary": "This article reviews the evolving field of radiobiology, emphasizing the need\nfor advanced multiscale, mechanistic models to optimize radiopharmaceutical\ntherapies (RPT). While the traditional linear-quadratic (LQ) model underpins\nexternal beam radiation therapy (EBRT), RPT's unique biological and spatial\ncomplexities demand new approaches. First-principles simulations of DNA damage,\nrepair, and multicellular responses are crucial for understanding therapeutic\nefficacy and toxicity. The integration of these models into personalized,\ndigital twin frameworks promises transformative clinical applications, but\nprogress depends on deep mechanistic insights, experimental validation, and\nbalancing model complexity with practicality for clinical use."}
