{"id": "2511.05183", "pdf": "https://arxiv.org/pdf/2511.05183", "abs": "https://arxiv.org/abs/2511.05183", "authors": ["Gregory Verghese", "Anthony Baptista", "Chima Eke", "Holly Rafique", "Mengyuan Li", "Fathima Mohamed", "Ananya Bhalla", "Lucy Ryan", "Michael Pitcher", "Enrico Parisini", "Concetta Piazzese", "Liz Ing-Simmons", "Anita Grigoriadis"], "title": "PySlyde: A Lightweight, Open-Source Toolkit for Pathology Preprocessing", "categories": ["q-bio.QM", "cs.CV", "eess.IV"], "comment": null, "summary": "The integration of artificial intelligence (AI) into pathology is advancing\nprecision medicine by improving diagnosis, treatment planning, and patient\noutcomes. Digitised whole-slide images (WSIs) capture rich spatial and\nmorphological information vital for understanding disease biology, yet their\ngigapixel scale and variability pose major challenges for standardisation and\nanalysis. Robust preprocessing, covering tissue detection, tessellation, stain\nnormalisation, and annotation parsing is critical but often limited by\nfragmented and inconsistent workflows. We present PySlyde, a lightweight,\nopen-source Python toolkit built on OpenSlide to simplify and standardise WSI\npreprocessing. PySlyde provides an intuitive API for slide loading, annotation\nmanagement, tissue detection, tiling, and feature extraction, compatible with\nmodern pathology foundation models. By unifying these processes, it streamlines\nWSI preprocessing, enhances reproducibility, and accelerates the generation of\nAI-ready datasets, enabling researchers to focus on model development and\ndownstream analysis."}
{"id": "2511.04825", "pdf": "https://arxiv.org/pdf/2511.04825", "abs": "https://arxiv.org/abs/2511.04825", "authors": ["Luigi Caputi", "Nicholas Meadows", "Henri Riihimäki"], "title": "Persistent reachability homology in machine learning applications", "categories": ["cs.LG", "math.AT", "q-bio.QM"], "comment": "19 pages; any comments welcome", "summary": "We explore the recently introduced persistent reachability homology (PRH) of\ndigraph data, i.e. data in the form of directed graphs. In particular, we study\nthe effectiveness of PRH in network classification task in a key neuroscience\nproblem: epilepsy detection. PRH is a variation of the persistent homology of\ndigraphs, more traditionally based on the directed flag complex (DPH). A main\nadvantage of PRH is that it considers the condensations of the digraphs\nappearing in the persistent filtration and thus is computed from smaller\ndigraphs. We compare the effectiveness of PRH to that of DPH and we show that\nPRH outperforms DPH in the classification task. We use the Betti curves and\ntheir integrals as topological features and implement our pipeline on support\nvector machine."}
{"id": "2511.04854", "pdf": "https://arxiv.org/pdf/2511.04854", "abs": "https://arxiv.org/abs/2511.04854", "authors": ["Alvaro Prat", "Leo Zhang", "Charlotte M. Deane", "Yee Whye Teh", "Garrett M. Morris"], "title": "SigmaDock: Untwisting Molecular Docking With Fragment-Based SE(3) Diffusion", "categories": ["cs.LG", "q-bio.QM"], "comment": "Preprint", "summary": "Determining the binding pose of a ligand to a protein, known as molecular\ndocking, is a fundamental task in drug discovery. Generative approaches promise\nfaster, improved, and more diverse pose sampling than physics-based methods,\nbut are often hindered by chemically implausible outputs, poor\ngeneralisability, and high computational cost. To address these challenges, we\nintroduce a novel fragmentation scheme, leveraging inductive biases from\nstructural chemistry, to decompose ligands into rigid-body fragments. Building\non this decomposition, we present SigmaDock, an SE(3) Riemannian diffusion\nmodel that generates poses by learning to reassemble these rigid bodies within\nthe binding pocket. By operating at the level of fragments in SE(3), SigmaDock\nexploits well-established geometric priors while avoiding overly complex\ndiffusion processes and unstable training dynamics. Experimentally, we show\nSigmaDock achieves state-of-the-art performance, reaching Top-1 success rates\n(RMSD<2 & PB-valid) above 79.9% on the PoseBusters set, compared to 12.7-30.8%\nreported by recent deep learning approaches, whilst demonstrating consistent\ngeneralisation to unseen proteins. SigmaDock is the first deep learning\napproach to surpass classical physics-based docking under the PB train-test\nsplit, marking a significant leap forward in the reliability and feasibility of\ndeep learning for molecular modelling."}
{"id": "2511.04998", "pdf": "https://arxiv.org/pdf/2511.04998", "abs": "https://arxiv.org/abs/2511.04998", "authors": ["Daniel S. Lee", "Mayra S. Haedo-Cruz", "Chen Jiang", "Oshin Miranda", "LiRong Wang"], "title": "BiPETE: A Bi-Positional Embedding Transformer Encoder for Risk Assessment of Alcohol and Substance Use Disorder with Electronic Health Records", "categories": ["cs.LG", "cs.AI", "q-bio.QM"], "comment": "20 pages, 2 figures, 6 tables, 2 supplementary figures, 4\n  supplementary tables, submitted to Journal of Biomedical Informatics on 6\n  Nov, 2025", "summary": "Transformer-based deep learning models have shown promise for disease risk\nprediction using electronic health records(EHRs), but modeling temporal\ndependencies remains a key challenge due to irregular visit intervals and lack\nof uniform structure. We propose a Bi-Positional Embedding Transformer Encoder\nor BiPETE for single-disease prediction, which integrates rotary positional\nembeddings to encode relative visit timing and sinusoidal embeddings to\npreserve visit order. Without relying on large-scale pretraining, BiPETE is\ntrained on EHR data from two mental health cohorts-depressive disorder and\npost-traumatic stress disorder (PTSD)-to predict the risk of alcohol and\nsubstance use disorders (ASUD). BiPETE outperforms baseline models, improving\nthe area under the precision-recall curve (AUPRC) by 34% and 50% in the\ndepression and PTSD cohorts, respectively. An ablation study further confirms\nthe effectiveness of the dual positional encoding strategy. We apply the\nIntegrated Gradients method to interpret model predictions, identifying key\nclinical features associated with ASUD risk and protection, such as abnormal\ninflammatory, hematologic, and metabolic markers, as well as specific\nmedications and comorbidities. Overall, these key clinical features identified\nby the attribution methods contribute to a deeper understanding of the risk\nassessment process and offer valuable clues for mitigating potential risks. In\nsummary, our study presents a practical and interpretable framework for disease\nrisk prediction using EHR data, which can achieve strong performance."}
