{"id": "2510.02416", "pdf": "https://arxiv.org/pdf/2510.02416", "abs": "https://arxiv.org/abs/2510.02416", "authors": ["Omer Abid", "Gholamreza Rafiee"], "title": "Cross-Platform DNA Methylation Classifier for the Eight Molecular Subtypes of Group 3 & 4 Medulloblastoma", "categories": ["q-bio.GN", "cs.AI"], "comment": "9 pages, 5 figures, 5 tables", "summary": "Medulloblastoma is a malignant pediatric brain cancer, and the discovery of\nmolecular subgroups is enabling personalized treatment strategies. In 2019, a\nconsensus identified eight novel subtypes within Groups 3 and 4, each\ndisplaying heterogeneous characteristics. Classifiers are essential for\ntranslating these findings into clinical practice by supporting clinical\ntrials, personalized therapy development and application, and patient\nmonitoring. This study presents a DNA methylation-based, cross-platform machine\nlearning classifier capable of distinguishing these subtypes on both HM450 and\nEPIC methylation array samples. Across two independent test sets, the model\nachieved weighted F1 = 0.95 and balanced accuracy = 0.957, consistent across\nplatforms. As the first cross-platform solution, it provides backward\ncompatibility while extending applicability to a newer platform, also enhancing\naccessibility. It also has the potential to become the first publicly available\nclassifier for these subtypes once deployed through a web application, as\nplanned in the future. This work overall takes steps in the direction of\nadvancing precision medicine and improving clinical outcomes for patients\nwithin the majority prevalence medulloblastoma subgroups, groups 3 and 4."}
{"id": "2510.02403", "pdf": "https://arxiv.org/pdf/2510.02403", "abs": "https://arxiv.org/abs/2510.02403", "authors": ["Jalil Jalili", "Yashraj Gavhane", "Evan Walker", "Anna Heinke", "Christopher Bowd", "Akram Belghith", "Massimo A. Fazio", "Christopher A. Girkin", "C. Gustavo De Moraes", "Jeffrey M. Liebmann", "Sally L. Baxter", "Robert N. Weinreb", "Linda M. Zangwill", "Mark Christopher"], "title": "Glaucoma Detection and Structured OCT Report Generation via a Fine-tuned Multimodal Large Language Model", "categories": ["q-bio.QM", "cs.AI", "cs.CV"], "comment": null, "summary": "Objective: To develop an explainable multimodal large language model (MM-LLM)\nthat (1) screens optic nerve head (ONH) OCT circle scans for quality and (2)\ngenerates structured clinical reports that include glaucoma diagnosis and\nsector-wise retinal nerve fiber layer (RNFL) thinning assessments. Design:\nRetrospective cohort study of 1,310 subjects contributing 43,849 Spectralis ONH\nOCT circle scans (1,331 glaucomatous and 867 healthy eyes) from the DIGS and\nADAGES cohorts. Methods: A MM-LLM (Llama 3.2 Vision-Instruct model) was\nfine-tuned to generate clinical descriptions of OCT imaging data. Training data\nincluded paired OCT images and automatically generated, structured clinical\nreports that described global and sectoral RNFL thinning. Poor-quality scans\nwere labeled as unusable and paired with a fixed refusal statement. The model\nwas evaluated on a held-out test set for three tasks: quality assessment,\nglaucoma detection, and RNFL thinning classification across seven anatomical\nsectors. Evaluation metrics included accuracy, sensitivity, specificity,\nprecision, and F1-score. Model description quality was also evaluated using\nstandard text evaluation metrics. Results: The model achieved 0.90 accuracy and\n0.98 specificity for quality triage. For glaucoma detection, accuracy was 0.86\n(sensitivity 0.91, specificity 0.73, F1-score 0.91). RNFL thinning prediction\naccuracy ranged from 0.83 to 0.94, with highest performance in global and\ntemporal sectors. Text generation scores showed strong alignment with reference\nreports (BLEU: 0.82; ROUGE-1: 0.94; ROUGE-2: 0.87; ROUGE-L: 0.92; BERTScore-F1:\n0.99). Conclusions: The fine-tuned MM-LLM generated accurate clinical\ndescriptions based on OCT imaging. The model achieved high accuracy in\nidentifying image quality issues and detecting glaucoma. The model also\nprovided sectoral descriptions of RNFL thinning to help support clinical OCT\nevaluation."}
{"id": "2510.02533", "pdf": "https://arxiv.org/pdf/2510.02533", "abs": "https://arxiv.org/abs/2510.02533", "authors": ["Mahya Beheshti", "John_Ross Rizzo", "Sarah Bergquist-Kosumi", "Ajayrangan Kasturirangan", "Sharvari Deshpande", "Todd E Hudson"], "title": "Head and Eye Control in Persons with Low Vision during Urban Navigation", "categories": ["q-bio.QM", "92C10"], "comment": "16 pages, 5 figures", "summary": "Low vision involves a range of visual impairments that significantly impact\ndaily activities, particularly navigation in urban environments. Individuals\nwith low vision often develop adaptive strategies to compensate for visual\ndeficits, relying on head movements to bring objects into their remaining\nfunctional field of vision. Research suggests that they focus on road surface\nmarkings and building edges to aid in wayfinding and collision avoidance.\nHowever, urban navigation presents additional challenges, as obstacles, moving\nhazards, and tripping dangers may enter their visual loss field, increasing the\nrisk of injury. Traditional eye movement studies are typically conducted in\ncontrolled laboratory settings with fixed head positions, limiting the\nunderstanding of head-eye coordination in real-world environments. To bridge\nthis gap, we designed a naturalistic, \"free-head\" experiment using eye-tracking\ntechnology to examine head and eye movement patterns during urban navigation.\nParticipants with low vision were compared to a control cohort without visual\nimpairment to test the hypothesis that eye and head movements become decoupled\nin visually impaired individuals. Findings indicate that individuals with\nperipheral field loss exhibit significant eye-head decoupling, while those with\nacuity loss demonstrate more synchronized movements. Results for individuals\nwith central field loss were inconclusive but revealed distinct movement\npatterns. These insights provide valuable direction for rehabilitation\nstrategies, assistive-mobility technologies, and urban design improvements. By\nexpanding research on eye-head coordination, this study contributes to the\ndevelopment of interventions that enhance safety, mobility, and independence\nfor individuals with low vision in complex urban environments."}
{"id": "2510.02476", "pdf": "https://arxiv.org/pdf/2510.02476", "abs": "https://arxiv.org/abs/2510.02476", "authors": ["Jie Li", "Andrew McCarthy", "Zhizhuo Zhang", "Stephen Young"], "title": "Uncertainty-Guided Model Selection for Tabular Foundation Models in Biomolecule Efficacy Prediction", "categories": ["cs.LG", "q-bio.QM"], "comment": "NeurIPS 2025 workshop: 2nd Workshop on Multi-modal Foundation Models\n  and Large Language Models for Life Sciences", "summary": "In-context learners like TabPFN are promising for biomolecule efficacy\nprediction, where established molecular feature sets and relevant experimental\nresults can serve as powerful contextual examples. However, their performance\nis highly sensitive to the provided context, making strategies like post-hoc\nensembling of models trained on different data subsets a viable approach. An\nopen question is how to select the best models for the ensemble without access\nto ground truth labels. In this study, we investigate an uncertainty-guided\nstrategy for model selection. We demonstrate on an siRNA knockdown efficacy\ntask that a TabPFN model using simple sequence-based features can surpass\nspecialized state-of-the-art predictors. We also show that the model's\npredicted inter-quantile range (IQR), a measure of its uncertainty, has a\nnegative correlation with true prediction error. By selecting and averaging an\nensemble of models with the lowest mean IQR, we achieve superior performance\ncompared to naive ensembling or using a single model trained on all available\ndata. This finding highlights model uncertainty as a powerful, label-free\nheuristic for optimizing biomolecule efficacy predictions."}
{"id": "2510.02482", "pdf": "https://arxiv.org/pdf/2510.02482", "abs": "https://arxiv.org/abs/2510.02482", "authors": ["Meiou Song", "Colin C. Anderson", "Nakul Sridhar", "Julie A. Reisz", "Leyla Akh", "Yu Gao", "Angelo D'Alessandro", "Xiaoyun Ding"], "title": "Surface Acoustic Wave Hemolysis Assay for Evaluating Stored Red Blood Cells", "categories": ["physics.med-ph", "physics.bio-ph", "q-bio.QM"], "comment": null, "summary": "Blood transfusion remains a cornerstone of modern medicine, saving countless\nlives daily. Yet the quality of transfused blood varies dramatically among\ndonors-a critical factor often overlooked in clinical practice. Rapid,\nbenchtop, and cost-effective methods for evaluating stored red blood cells\n(RBCs) at the site of transfusion are lacking, with concerns persisting about\nthe association between metabolic signatures of stored RBC quality and\ntransfusion outcomes. Recent studies utilizing metabolomics approaches to\nevaluate stored erythrocytes find that donor biology (e.g., genetics, age,\nlifestyle factors) underlies the heterogeneity associated with blood storage\nand transfusion. The appreciation of donor-intrinsic factors provides\nopportunities for precision transfusion medicine approaches for the evaluation\nof storage quality and prediction of transfusion efficacy. Here we propose a\nnew platform, the Surface Acoustic Wave Hemolysis Assay (SAW-HA), for on-site\nevaluation of stored RBCs utilizing SAW Hemolysis Temperature (SAWHT) as a\nmarker for RBC quality. We report SAWHT as a mechanism-dependent reproducible\nmethodology for evaluating stored human RBCs up to 42 days. Our results define\nunique signatures for SAW hemolysis and metabolic profiles in RBCs from two of\nthe six donors in which high body mass index (BMI) and RBC triglycerides\nassociated with increased susceptibility to hemolysis. Metabolic age of the\nstored RBCs - a recently appreciated predictor of post-transfusion\nefficacy-reveal that RBCs from the two low SAWHT units were characterized by\ndisrupted redox control, deficient tryptophan metabolism, and high BMI.\nTogether, these findings indicate the potential of the SAW-HA as a\npoint-of-care analysis for transfusion medicine."}
{"id": "2510.02979", "pdf": "https://arxiv.org/pdf/2510.02979", "abs": "https://arxiv.org/abs/2510.02979", "authors": ["Jonathan Baum", "Chamot-Nonin Manon", "Oppelt Vera", "David Guiraud", "Christine Azevedo Coste", "Thomas Guiho"], "title": "Towards Electrophysiological and Histological Mapping of Upper Limb Nerves in Pigs Using Epineural Stimulation", "categories": ["eess.SP", "q-bio.QM"], "comment": "FESWS 2025 - 15th Vienna International Workshop on Functional\n  Electrical Stimulation & 30 years IFESS Anniversary, IFESS, Sep 2025, Vienna,\n  Austria", "summary": "Understanding the relationship between nerve anatomy and the functional\noutcomes of electrical stimulation is critical for optimizing neural interface\ndesign. In this study, we conducted acute experiments on four pigs in which\nepineural cuff electrodes with multiple contacts were placed around upper limb\nnerves. A subset of electrical stimulation configurations -- previously\nidentified via computational study -- was applied, and the resulting evoked\nelectromyographic (EMG) responses were recorded from target muscles. Muscle\nrecruitment curves were extracted and analysed offline to quantify activation\npatterns. Following the electrophysiological experiments, the stimulated nerves\nwere harvested and processed for histological analysis to visualize fascicular\norganization and distribution. This work presents preliminary results from the\ncombined analysis of muscle activation profiles and fascicle anatomy in one\nanimal. Our findings aim to inform the design of stimulation strategies by\nlinking electrode configuration to selective muscle recruitment, ultimately\ncontributing to more effective neuromodulation and neuroprosthetic\napplications."}
