{"id": "2512.13724", "pdf": "https://arxiv.org/pdf/2512.13724", "abs": "https://arxiv.org/abs/2512.13724", "authors": ["Ayush Noori", "Joaquín Polonuer", "Katharina Meyer", "Bogdan Budnik", "Shad Morton", "Xinyuan Wang", "Sumaiya Nazeen", "Yingnan He", "Iñaki Arango", "Lucas Vittor", "Matthew Woodworth", "Richard C. Krolewski", "Michelle M. Li", "Ninning Liu", "Tushar Kamath", "Evan Macosko", "Dylan Ritter", "Jalwa Afroz", "Alexander B. H. Henderson", "Lorenz Studer", "Samuel G. Rodriques", "Andrew White", "Noa Dagan", "David A. Clifton", "George M. Church", "Sudeshna Das", "Jenny M. Tam", "Vikram Khurana", "Marinka Zitnik"], "title": "Graph AI generates neurological hypotheses validated in molecular, organoid, and clinical systems", "categories": ["q-bio.QM", "cs.AI", "q-bio.NC"], "comment": null, "summary": "Neurological diseases are the leading global cause of disability, yet most lack disease-modifying treatments. We present PROTON, a heterogeneous graph transformer that generates testable hypotheses across molecular, organoid, and clinical systems. To evaluate PROTON, we apply it to Parkinson's disease (PD), bipolar disorder (BD), and Alzheimer's disease (AD). In PD, PROTON linked genetic risk loci to genes essential for dopaminergic neuron survival and predicted pesticides toxic to patient-derived neurons, including the insecticide endosulfan, which ranked within the top 1.29% of predictions. In silico screens performed by PROTON reproduced six genome-wide $α$-synuclein experiments, including a split-ubiquitin yeast two-hybrid system (normalized enrichment score [NES] = 2.30, FDR-adjusted $p < 1 \\times 10^{-4}$), an ascorbate peroxidase proximity labeling assay (NES = 2.16, FDR $< 1 \\times 10^{-4}$), and a high-depth targeted exome sequencing study in 496 synucleinopathy patients (NES = 2.13, FDR $< 1 \\times 10^{-4}$). In BD, PROTON predicted calcitriol as a candidate drug that reversed proteomic alterations observed in cortical organoids derived from BD patients. In AD, we evaluated PROTON predictions in health records from $n = 610,524$ patients at Mass General Brigham, confirming that five PROTON-predicted drugs were associated with reduced seven-year dementia risk (minimum hazard ratio = 0.63, 95% CI: 0.53-0.75, $p < 1 \\times 10^{-7}$). PROTON generated neurological hypotheses that were evaluated across molecular, organoid, and clinical systems, defining a path for AI-driven discovery in neurological disease."}
{"id": "2512.12101", "pdf": "https://arxiv.org/pdf/2512.12101", "abs": "https://arxiv.org/abs/2512.12101", "authors": ["Swarn S. Warshaneyan", "Maksims Ivanovs", "Blaž Cugmas", "Inese Bērziņa", "Laura Goldberga", "Mindaugas Tamosiunas", "Roberts Kadiķis"], "title": "AI-Augmented Pollen Recognition in Optical and Holographic Microscopy for Veterinary Imaging", "categories": ["cs.CV", "cs.LG", "q-bio.QM"], "comment": "10 pages, 10 figures, 2 tables, 22 references. Journal submission undergoing peer review", "summary": "We present a comprehensive study on fully automated pollen recognition across both conventional optical and digital in-line holographic microscopy (DIHM) images of sample slides. Visually recognizing pollen in unreconstructed holographic images remains challenging due to speckle noise, twin-image artifacts and substantial divergence from bright-field appearances. We establish the performance baseline by training YOLOv8s for object detection and MobileNetV3L for classification on a dual-modality dataset of automatically annotated optical and affinely aligned DIHM images. On optical data, detection mAP50 reaches 91.3% and classification accuracy reaches 97%, whereas on DIHM data, we achieve only 8.15% for detection mAP50 and 50% for classification accuracy. Expanding the bounding boxes of pollens in DIHM images over those acquired in aligned optical images achieves 13.3% for detection mAP50 and 54% for classification accuracy. To improve object detection in DIHM images, we employ a Wasserstein GAN with spectral normalization (WGAN-SN) to create synthetic DIHM images, yielding an FID score of 58.246. Mixing real-world and synthetic data at the 1.0 : 1.5 ratio for DIHM images improves object detection up to 15.4%. These results demonstrate that GAN-based augmentation can reduce the performance divide, bringing fully automated DIHM workflows for veterinary imaging a small but important step closer to practice."}
{"id": "2512.13720", "pdf": "https://arxiv.org/pdf/2512.13720", "abs": "https://arxiv.org/abs/2512.13720", "authors": ["Serhii V Marchenko"], "title": "Absement: Quantitative Assessment of Metabolic Cost during Quasi-Isometric Muscle Loading", "categories": ["physics.bio-ph", "q-bio.QM"], "comment": null, "summary": "Accurate quantitative assessment of metabolic cost during static posture holding is a strategically important problem in biomechanics and physiology. Traditional metrics such as ``time under tension'' are fundamentally insufficient, because they are scalar quantities that ignore the temporal history of deviations, that is, the microdynamics of posture, which has nontrivial energetic consequences. In this work, we propose a theoretically grounded methodology to address this problem by introducing the concept of the \\textbf{deviation absement} ($Δ\\mathcal{A}_\\ell$), defined as the time integral of the deviation of the muscle--tendon unit length from a reference value.\n  We rigorously prove that, for a broad class of quasi-static models, absement appears as the leading first-order state variable. For small deviations in a neighbourhood of a reference posture, the total metabolic cost $\\mathcal{E}_{\\mathrm{met}}(\\ell)$ admits a universal asymptotic expansion of the form \\begin{equation*} \\mathcal{E}_{\\mathrm{met}}(\\ell) = P_0 T + C_1 Δ\\mathcal{A}_\\ell + C_2 \\int_0^T(\\ell(t)-\\ell_0)^2\\,dt + O(\\|\\ell-\\ell_0\\|_{L^\\infty}^3), \\end{equation*} where $T$ is the duration of loading, and $P_0, C_1, C_2$ are constants determined by local properties of the system.\n  Thus, the deviation absement ($Δ\\mathcal{A}_\\ell$) is the \\textbf{unique first-order sufficient statistic} that allows one to quantify and separate the energetic contribution of systematic drift of the mean posture from the contribution of micro-oscillations (tremor), which is described by the quadratic term. This result has direct consequences for parameter identification: the proposed formalism makes it possible to recover physically meaningful coefficients $(P_0, C_1, C_2)$ by means of linear regression of experimental data obtained from standard kinematic measurements and indirect calorimetry."}
{"id": "2512.13927", "pdf": "https://arxiv.org/pdf/2512.13927", "abs": "https://arxiv.org/abs/2512.13927", "authors": ["Sophia Tang"], "title": "A Complete Guide to Spherical Equivariant Graph Transformers", "categories": ["cs.LG", "q-bio.QM"], "comment": "This paper is a technical version of the article originally published in Alchemy Bio (99 pages, 46 figures)", "summary": "Spherical equivariant graph neural networks (EGNNs) provide a principled framework for learning on three-dimensional molecular and biomolecular systems, where predictions must respect the rotational symmetries inherent in physics. These models extend traditional message-passing GNNs and Transformers by representing node and edge features as spherical tensors that transform under irreducible representations of the rotation group SO(3), ensuring that predictions change in physically meaningful ways under rotations of the input. This guide develops a complete, intuitive foundation for spherical equivariant modeling - from group representations and spherical harmonics, to tensor products, Clebsch-Gordan decomposition, and the construction of SO(3)-equivariant kernels. Building on this foundation, we construct the Tensor Field Network and SE(3)-Transformer architectures and explain how they perform equivariant message-passing and attention on geometric graphs. Through clear mathematical derivations and annotated code excerpts, this guide serves as a self-contained introduction for researchers and learners seeking to understand or implement spherical EGNNs for applications in chemistry, molecular property prediction, protein structure modeling, and generative modeling."}
{"id": "2512.13935", "pdf": "https://arxiv.org/pdf/2512.13935", "abs": "https://arxiv.org/abs/2512.13935", "authors": ["Qi Chen", "Fabio Ramos", "Alán Aspuru-Guzik", "Florian Shkurti"], "title": "Informing Acquisition Functions via Foundation Models for Molecular Discovery", "categories": ["cs.LG", "cs.AI", "q-bio.QM"], "comment": null, "summary": "Bayesian Optimization (BO) is a key methodology for accelerating molecular discovery by estimating the mapping from molecules to their properties while seeking the optimal candidate. Typically, BO iteratively updates a probabilistic surrogate model of this mapping and optimizes acquisition functions derived from the model to guide molecule selection. However, its performance is limited in low-data regimes with insufficient prior knowledge and vast candidate spaces. Large language models (LLMs) and chemistry foundation models offer rich priors to enhance BO, but high-dimensional features, costly in-context learning, and the computational burden of deep Bayesian surrogates hinder their full utilization. To address these challenges, we propose a likelihood-free BO method that bypasses explicit surrogate modeling and directly leverages priors from general LLMs and chemistry-specific foundation models to inform acquisition functions. Our method also learns a tree-structured partition of the molecular search space with local acquisition functions, enabling efficient candidate selection via Monte Carlo Tree Search. By further incorporating coarse-grained LLM-based clustering, it substantially improves scalability to large candidate sets by restricting acquisition function evaluations to clusters with statistically higher property values. We show through extensive experiments and ablations that the proposed method substantially improves scalability, robustness, and sample efficiency in LLM-guided BO for molecular discovery."}
{"id": "2512.14011", "pdf": "https://arxiv.org/pdf/2512.14011", "abs": "https://arxiv.org/abs/2512.14011", "authors": ["Yue Wan", "Jiayi Yuan", "Zhiwei Feng", "Xiaowei Jia"], "title": "Accelerating MHC-II Epitope Discovery via Multi-Scale Prediction in Antigen Presentation", "categories": ["cs.LG", "q-bio.QM"], "comment": null, "summary": "Antigenic epitope presented by major histocompatibility complex II (MHC-II) proteins plays an essential role in immunotherapy. However, compared to the more widely studied MHC-I in computational immunotherapy, the study of MHC-II antigenic epitope poses significantly more challenges due to its complex binding specificity and ambiguous motif patterns. Consequently, existing datasets for MHC-II interactions are smaller and less standardized than those available for MHC-I. To address these challenges, we present a well-curated dataset derived from the Immune Epitope Database (IEDB) and other public sources. It not only extends and standardizes existing peptide-MHC-II datasets, but also introduces a novel antigen-MHC-II dataset with richer biological context. Leveraging this dataset, we formulate three major machine learning (ML) tasks of peptide binding, peptide presentation, and antigen presentation, which progressively capture the broader biological processes within the MHC-II antigen presentation pathway. We further employ a multi-scale evaluation framework to benchmark existing models, along with a comprehensive analysis over various modeling designs to this problem with a modular framework. Overall, this work serves as a valuable resource for advancing computational immunotherapy, providing a foundation for future research in ML guided epitope discovery and predictive modeling of immune responses."}
{"id": "2512.14019", "pdf": "https://arxiv.org/pdf/2512.14019", "abs": "https://arxiv.org/abs/2512.14019", "authors": ["Juseung Yun", "Sunwoo Yu", "Sumin Ha", "Jonghyun Kim", "Janghyeon Lee", "Jongseong Jang", "Soonyoung Lee"], "title": "EXAONE Path 2.5: Pathology Foundation Model with Multi-Omics Alignment", "categories": ["cs.LG", "q-bio.QM"], "comment": null, "summary": "Cancer progression arises from interactions across multiple biological layers, especially beyond morphological and across molecular layers that remain invisible to image-only models. To capture this broader biological landscape, we present EXAONE Path 2.5, a pathology foundation model that jointly models histologic, genomic, epigenetic and transcriptomic modalities, producing an integrated patient representation that reflects tumor biology more comprehensively. Our approach incorporates three key components: (1) multimodal SigLIP loss enabling all-pairwise contrastive learning across heterogeneous modalities, (2) a fragment-aware rotary positional encoding (F-RoPE) module that preserves spatial structure and tissue-fragment topology in WSI, and (3) domain-specialized internal foundation models for both WSI and RNA-seq to provide biologically grounded embeddings for robust multimodal alignment. We evaluate EXAONE Path 2.5 against six leading pathology foundation models across two complementary benchmarks: an internal real-world clinical dataset and the Patho-Bench benchmark covering 80 tasks. Our framework demonstrates high data and parameter efficiency, achieving on-par performance with state-of-the-art foundation models on Patho-Bench while exhibiting the highest adaptability in the internal clinical setting. These results highlight the value of biologically informed multimodal design and underscore the potential of integrated genotype-to-phenotype modeling for next-generation precision oncology."}
{"id": "2512.14461", "pdf": "https://arxiv.org/pdf/2512.14461", "abs": "https://arxiv.org/abs/2512.14461", "authors": ["Niklas Grieger", "Jannik Raskob", "Siamak Mehrkanoon", "Stephan Bialonski"], "title": "AnySleep: a channel-agnostic deep learning system for high-resolution sleep staging in multi-center cohorts", "categories": ["cs.LG", "eess.SP", "q-bio.QM"], "comment": "18 pages, 6 figures, 2 tables", "summary": "Sleep is essential for good health throughout our lives, yet studying its dynamics requires manual sleep staging, a labor-intensive step in sleep research and clinical care. Across centers, polysomnography (PSG) recordings are traditionally scored in 30-s epochs for pragmatic, not physiological, reasons and can vary considerably in electrode count, montage, and subject characteristics. These constraints present challenges in conducting harmonized multi-center sleep studies and discovering novel, robust biomarkers on shorter timescales. Here, we present AnySleep, a deep neural network model that uses any electroencephalography (EEG) or electrooculography (EOG) data to score sleep at adjustable temporal resolutions. We trained and validated the model on over 19,000 overnight recordings from 21 datasets collected across multiple clinics, spanning nearly 200,000 hours of EEG and EOG data, to promote robust generalization across sites. The model attains state-of-the-art performance and surpasses or equals established baselines at 30-s epochs. Performance improves as more channels are provided, yet remains strong when EOG is absent or when only EOG or single EEG derivations (frontal, central, or occipital) are available. On sub-30-s timescales, the model captures short wake intrusions consistent with arousals and improves prediction of physiological characteristics (age, sex) and pathophysiological conditions (sleep apnea), relative to standard 30-s scoring. We make the model publicly available to facilitate large-scale studies with heterogeneous electrode setups and to accelerate the discovery of novel biomarkers in sleep."}
