{"id": "2512.12052", "pdf": "https://arxiv.org/pdf/2512.12052", "abs": "https://arxiv.org/abs/2512.12052", "authors": ["Gorkem Kadir Solun", "Ugur Dogrusoz"], "title": "An algorithm to align a chain of sequences to paths in a pangenome graph", "categories": ["q-bio.GN"], "comment": null, "summary": "Affordable, high-quality whole-genome assemblies have made it possible to construct rich pangenomes that capture haplotype diversity across many species. As these datasets grow, they motivate the development of specialized techniques capable of handling the dense sequence variation found in large groups of related genomes. A common strategy is to encode pangenomic information in graph form, which provides a flexible substrate for improving algorithms in areas such as alignment, visualization, and functional analysis. Methods built on these graph models have already shown clear advantages in core bioinformatics workflows, including read mapping, variant discovery, and genotyping. By integrating multiple sequence and coordinate representations into a single structure, pangenome graphs offer a unified and expressive framework for comparative genomics. Although it remains unclear whether graph-based references will ultimately supplant traditional linear genomes, their versatility ensures that they will play a central role in emerging pangenomic approaches. This paper introduces an algorithm to mine a chain of sequences in pangenome graphs that might be useful in the functional analysis of pangenome graphs. Specifically, the algorithm calculates all maximal paths in a pangenome graph aligning with a given chain of sequences in the segments of the path vertices, possibly with some maximal gap as specified by the user."}
{"id": "2512.12113", "pdf": "https://arxiv.org/pdf/2512.12113", "abs": "https://arxiv.org/abs/2512.12113", "authors": ["La Ode Aman", "Arfan Arfan", "Aiyi Asnaw", "Purnawan Pontana Putra", "Hamsidar Hasan", "Dizky Ramadani Putri Papeo"], "title": "Prediction of PLX-4720 Sensitivity in Cancer Cell Lines through Multi-Omics Integration and Attention-Based Fusion Modeling", "categories": ["q-bio.GN"], "comment": null, "summary": "Predicting the sensitivity of cancer cell lines to PLX-4720, a preclinical BRAF inhibitor, requires models capable of capturing the multilayered regulation of oncogenic signaling. Single-omics predictors are often insufficient because drug response is shaped by interactions among genomic alterations, epigenetic regulation, transcriptional activity, protein signaling, metabolic state, and network-level context. In this study we develop an attention-based multi-omics integration framework using genomic, epigenomic, transcriptomic, proteomic, metabolomic, and protein interaction data from the GDSC1 panel. Each modality is encoded into a latent representation using feed-forward neural networks or graph convolutional networks, and fused through an attention mechanism that assigns modality-specific importance weights. A regression model is then used to predict PLX-4720 response. Across single- and multi-omics configurations, the best performance is achieved by integrating genomics and transcriptomics, which yields validation R2 values above 0.92. This reflects the complementary roles of mutational status and downstream transcriptional activation in shaping sensitivity to BRAF inhibition. Epigenomics is the strongest single-omics predictor, while metabolomics and PPI data contribute additional context when combined with other modalities. Integration of three to five omics layers improves stability but does not surpass the accuracy of the best two-modality combinations, likely due to information redundancy and sample-size imbalance. These findings highlight the importance of modality selection rather than maximal data depth. The proposed framework provides an efficient and biologically grounded strategy for drug response prediction and supports the development of precision pharmacogenomics."}
{"id": "2512.11927", "pdf": "https://arxiv.org/pdf/2512.11927", "abs": "https://arxiv.org/abs/2512.11927", "authors": ["Rijie Xi", "Weikang Xu", "Wei Xiong", "Yuannong Ye", "Bin Zhao"], "title": "Gene regulatory network inference algorithm based on spectral signed directed graph convolution", "categories": ["q-bio.MN", "cs.AI"], "comment": null, "summary": "Accurately reconstructing Gene Regulatory Networks (GRNs) is crucial for understanding gene functions and disease mechanisms. Single-cell RNA sequencing (scRNA-seq) technology provides vast data for computational GRN reconstruction. Since GRNs are ideally modeled as signed directed graphs to capture activation/inhibition relationships, the most intuitive and reasonable approach is to design feature extractors based on the topological structure of GRNs to extract structural features, then combine them with biological characteristics for research. However, traditional spectral graph convolution struggles with this representation. Thus, we propose MSGRNLink, a novel framework that explicitly models GRNs as signed directed graphs and employs magnetic signed Laplacian convolution. Experiments across simulated and real datasets demonstrate that MSGRNLink outperforms all baseline models in AUROC. Parameter sensitivity analysis and ablation studies confirmed its robustness and the importance of each module. In a bladder cancer case study, MSGRNLink predicted more known edges and edge signs than benchmark models, further validating its biological relevance."}
{"id": "2512.11837", "pdf": "https://arxiv.org/pdf/2512.11837", "abs": "https://arxiv.org/abs/2512.11837", "authors": ["Mahmut S. Gokmen", "Mitchell A. Klusty", "Evan W. Damron", "W. Vaiden Logan", "Aaron D. Mullen", "Caroline N. Leach", "Emily B. Collier", "Samuel E. Armstrong", "V. K. Cody Bumgardner"], "title": "Vision Foundry: A System for Training Foundational Vision AI Models", "categories": ["q-bio.QM", "cs.AI", "cs.CV", "cs.LG"], "comment": "10 pages, 4 figures, 3 tables, submitted to AMIA 2026 Informatics Summit", "summary": "Self-supervised learning (SSL) leverages vast unannotated medical datasets, yet steep technical barriers limit adoption by clinical researchers. We introduce Vision Foundry, a code-free, HIPAA-compliant platform that democratizes pre-training, adaptation, and deployment of foundational vision models. The system integrates the DINO-MX framework, abstracting distributed infrastructure complexities while implementing specialized strategies like Magnification-Aware Distillation (MAD) and Parameter-Efficient Fine-Tuning (PEFT). We validate the platform across domains, including neuropathology segmentation, lung cellularity estimation, and coronary calcium scoring. Our experiments demonstrate that models trained via Vision Foundry significantly outperform generic baselines in segmentation fidelity and regression accuracy, while exhibiting robust zero-shot generalization across imaging protocols. By bridging the gap between advanced representation learning and practical application, Vision Foundry enables domain experts to develop state-of-the-art clinical AI tools with minimal annotation overhead, shifting focus from engineering optimization to clinical discovery."}
{"id": "2512.11936", "pdf": "https://arxiv.org/pdf/2512.11936", "abs": "https://arxiv.org/abs/2512.11936", "authors": ["Zhengye Pan", "Jianwei Zuo", "Jiajia Luo"], "title": "GNN-Based Deep Surrogate Modeling of Knee Contact Mechanics: Generalizing Neuromuscular Control Patterns Across Subjects", "categories": ["q-bio.QM"], "comment": null, "summary": "Background: Accumulation of abnormal contact stress is a primary biomechanical driver of acute meniscal tears and chronic osteoarthritis. While Finite Element Analysis (FEA) provides the necessary fidelity to quantify these injury-inducing loads, its high computational cost precludes clinical utility. Emerging deep surrogate models promise real-time assessment but suffer a critical blind spot: they predominantly focus on learning anatomical variations, largely overlooking the neuromuscular control patterns. These dynamic, subject-specific motor strategies fundamentally dictate potentially injurious stress distributions inside the knee. Methods: This study investigates the generalization capability of the topology-aware MeshGraphNet regarding cross-subject neuromuscular control patterns under fixed anatomical conditions. We constructed a dataset using gait data from nine subjects via an OpenSim-FEBio co-simulation platform. The MGN was compared against a structure-agnostic Node-wise MLP using a rigorous grouped 3-fold cross-validation on unseen subjects. Results: The MGN demonstrated superior fidelity, achieving a correlation of 0.94 with ground truth (vs. 0.88 for MLP). In contrast to the MLP, which exhibited the \"peak shaving\" defect common in deep learning, MGN significantly reduced peak-stress prediction errors and achieved higher spatial overlap in high-risk regions. This indicates that MGN effectively captured the non-local force-transmission pathways unique to each subject's movement strategy. Conclusion: By mimicking the propagation of physical stress through message passing, MGN successfully decodes the heterogeneity of human neuromuscular control, even under fixed anatomy. This establishes GNNs as robust clinical tools capable of identifying functional injury risks that are invisible to purely geometry-based surrogate models."}
{"id": "2512.12184", "pdf": "https://arxiv.org/pdf/2512.12184", "abs": "https://arxiv.org/abs/2512.12184", "authors": ["Liangshou Zhang", "Yanbin Liu", "Hanchi Liu", "Zheng Sun", "Haozhi Zhang", "Yang Zhang", "Xin Ma"], "title": "DCAF-Net: Dual-Channel Attentive Fusion Network for Lower Limb Motion Intention Prediction in Stroke Rehabilitation Exoskeletons", "categories": ["q-bio.QM", "cs.HC"], "comment": "6 pages, 6 figures", "summary": "Rehabilitation exoskeletons have shown promising results in promoting recovery for stroke patients. Accurately and timely identifying the motion intentions of patients is a critical challenge in enhancing active participation during lower limb exoskeleton-assisted rehabilitation training. This paper proposes a Dual-Channel Attentive Fusion Network (DCAF-Net) that synergistically integrates pre-movement surface electromyography (sEMG) and inertial measurement unit (IMU) data for lower limb intention prediction in stroke patients. First, a dual-channel adaptive channel attention module is designed to extract discriminative features from 48 time-domain and frequency-domain features derived from bilateral gastrocnemius sEMG signals. Second, an IMU encoder combining convolutional neural network (CNN) and attention-based long short-term memory (attention-LSTM) layers is designed to decode temporal-spatial movement patterns. Third, the sEMG and IMU features are fused through concatenation to enable accurate recognition of motion intention. Extensive experiment on 11 participants (8 stroke subjects and 3 healthy subjects) demonstrate the effectiveness of DCAF-Net. It achieved a prediction accuracies of 97.19% for patients and 93.56% for healthy subjects. This study provides a viable solution for implementing intention-driven human-in-the-loop assistance control in clinical rehabilitation robotics."}
{"id": "2512.12221", "pdf": "https://arxiv.org/pdf/2512.12221", "abs": "https://arxiv.org/abs/2512.12221", "authors": ["Jakob Vanhoefer", "Antonia Körner", "Domagoj Doresic", "Jan Hasenauer", "Dilan Pathirana"], "title": "Scalable branch-and-bound model selection with non-monotonic criteria including AIC, BIC and Mallows's $\\mathit{C_p}$", "categories": ["q-bio.QM", "stat.ME", "stat.ML"], "comment": "28 pages, 4 figures", "summary": "Model selection is a pivotal process in the quantitative sciences, where researchers must navigate between numerous candidate models of varying complexity. Traditional information criteria, such as the corrected Akaike Information Criterion (AICc), Bayesian Information Criterion (BIC), and Mallows's $\\mathit{C_p}$, are valuable tools for identifying optimal models. However, the exponential increase in candidate models with each additional model parameter renders the evaluation of these criteria for all models -- a strategy known as exhaustive, or brute-force, searches -- computationally prohibitive. Consequently, heuristic approaches like stepwise regression are commonly employed, albeit without guarantees of finding the globally-optimal model.\n  In this study, we challenge the prevailing notion that non-monotonicity in information criteria precludes bounds on the search space. We introduce a simple but novel bound that enables the development of branch-and-bound algorithms tailored for these non-monotonic functions. We demonstrate that our approach guarantees identification of the optimal model(s) across diverse model classes, sizes, and applications, often with orders of magnitude computational speedups. For instance, in one previously-published model selection task involving $2^{32}$ (approximately 4 billion) candidate models, our method achieves a computational speedup exceeding 6,000. These findings have broad implications for the scalability and effectiveness of model selection in complex scientific domains."}
{"id": "2512.12272", "pdf": "https://arxiv.org/pdf/2512.12272", "abs": "https://arxiv.org/abs/2512.12272", "authors": ["Yuhan Chen", "Shang Qu", "Zhiqiang Gao", "Yuejin Yang", "Xiang Zhang", "Sheng Xu", "Xinjie Mao", "Liujia Qian", "Jiaqi Wei", "Zijie Qiu", "Chenyu You", "Lei Bai", "Ning Ding", "Tiannan Guo", "Bowen Zhou", "Siqi Sun"], "title": "Accurate de novo sequencing of the modified proteome with OmniNovo", "categories": ["q-bio.QM", "cs.AI"], "comment": null, "summary": "Post-translational modifications (PTMs) serve as a dynamic chemical language regulating protein function, yet current proteomic methods remain blind to a vast portion of the modified proteome. Standard database search algorithms suffer from a combinatorial explosion of search spaces, limiting the identification of uncharacterized or complex modifications. Here we introduce OmniNovo, a unified deep learning framework for reference-free sequencing of unmodified and modified peptides directly from tandem mass spectra. Unlike existing tools restricted to specific modification types, OmniNovo learns universal fragmentation rules to decipher diverse PTMs within a single coherent model. By integrating a mass-constrained decoding algorithm with rigorous false discovery rate estimation, OmniNovo achieves state-of-the-art accuracy, identifying 51\\% more peptides than standard approaches at a 1\\% false discovery rate. Crucially, the model generalizes to biological sites unseen during training, illuminating the dark matter of the proteome and enabling unbiased comprehensive analysis of cellular regulation."}
{"id": "2512.12709", "pdf": "https://arxiv.org/pdf/2512.12709", "abs": "https://arxiv.org/abs/2512.12709", "authors": ["Chiara Barà", "Yuri Antonacci", "Laura Sparacino", "Helder Pinto", "Michal Javorka", "Sebastiano Stramaglia", "Luca Faes"], "title": "Investigating High-Order Behaviors in Multivariate Cardiovascular Interactions via Nonlinear Prediction and Information-Theoretic Tools", "categories": ["q-bio.QM", "physics.data-an"], "comment": null, "summary": "Assessing the synergistic high-order behaviors (HOBs) that emerge from underlying structural mechanisms is crucial to characterize complex systems. This work leverages the combined use of predictability and information measures to detect and quantify HOBs in synthetic and physiological network systems. After providing formal definitions of mechanisms and behaviors in a complex system, measures of statistical synergy are defined as the whole-minus-sum excess of mutual predictability ($Δ_\\textrm{MP}$) or mutual information ($Δ_\\textrm{MI}$) obtained when considering the system as a whole rather than as a combination of its units. The two measures are computed using model-free methods based on nonlinear prediction and entropy estimation. The application to simulated linear Gaussian systems and nonlinear deterministic and stochastic dynamic systems shows that $Δ_\\textrm{MP}$ tends to vanish for target variables influenced by additive effects of single independent source variables and is positive in the presence of group interactions between sources, while $Δ_\\textrm{MI}$ exhibits a higher propensity to display positive values. The analysis of physiological variables shows significant values of $Δ_\\textrm{MI}$ when investigating the additive effect of systolic and diastolic arterial pressure on mean arterial pressure, and of both $Δ_\\textrm{MP}$ and $Δ_\\textrm{MI}$ when assessing how diastolic pressure is modulated by pre-ejection and left-ventricular ejection times. HOBs can be more clearly identified by information-theoretic measures, while prediction measures are more sensitive to synergy arising from the governing rules of the system analyzed rather than from pure statistical dependencies. Quantifying HOBs through measures sensitive to structural mechanisms can provide biomarkers to assess physio-pathological alterations of cardiovascular networks."}
{"id": "2512.12974", "pdf": "https://arxiv.org/pdf/2512.12974", "abs": "https://arxiv.org/abs/2512.12974", "authors": ["Sixtus Dakurah"], "title": "Cycles Communities from the Perspective of Dendrograms and Gradient Sampling", "categories": ["q-bio.QM", "cs.CG", "stat.ML"], "comment": null, "summary": "Identifying and comparing topological features, particularly cycles, across different topological objects remains a fundamental challenge in persistent homology and topological data analysis. This work introduces a novel framework for constructing cycle communities through two complementary approaches. First, a dendrogram-based methodology leverages merge-tree algorithms to construct hierarchical representations of homology classes from persistence intervals. The Wasserstein distance on merge trees is introduced as a metric for comparing dendrograms, establishing connections to hierarchical clustering frameworks. Through simulation studies, the discriminative power of dendrogram representations for identifying cycle communities is demonstrated. Second, an extension of Stratified Gradient Sampling simultaneously learns multiple filter functions that yield cycle barycenter functions capable of faithfully reconstructing distinct sets of cycles. The set of cycles each filter function can reconstruct constitutes cycle communities that are non-overlapping and partition the space of all cycles. Together, these approaches transform the problem of cycle matching into both a hierarchical clustering and topological optimization framework, providing principled methods to identify similar topological structures both within and across groups of topological objects."}
{"id": "2512.13455", "pdf": "https://arxiv.org/pdf/2512.13455", "abs": "https://arxiv.org/abs/2512.13455", "authors": ["Richard Tanburn", "Danny Hendron", "Philip Maini", "Silviana Amethyst", "Emilie Dufresne", "Heather A. Harrington"], "title": "Nondimensionalization is more science than art", "categories": ["q-bio.QM", "math.AC", "math.DS"], "comment": "31 pages", "summary": "When faced with a mathematical model, often the first step is to reduce the complexity of the model by turning variables and parameters into dimensionless quantities. This process is often performed by hand, relying on a skill practiced over many years, and attempted for small models. Nondimensionalization is often considered an art, as there is no formal method accessible to applied scientists. Here we show how to systematically perform nondimensionalization for arbitrarily sized models described by rational first order ordinary differential equations. We translate and extend an existing approach for computing rational invariants of the maximal scaling symmetry, which combines ideas from differential algebra, invariant theory and linear algebra, to the setting arising in biological models. The modeler inputs the system of equations and our implemented algorithm outputs the nondimensional quantities for the corresponding nondimensionalized model. We extend the algorithm to include initial conditions, and the modeler's choice of invariants, thereby including a larger class of nondimensionalizations. We further prove that any dimensionally consistent change of variables preserves the dimension of the maximal scaling symmetry. We showcase the framework on various models, including the classical Michaelis-Menten equations, which serves as a benchmark for asking and answering specific modeling questions."}
{"id": "2512.12198", "pdf": "https://arxiv.org/pdf/2512.12198", "abs": "https://arxiv.org/abs/2512.12198", "authors": ["Jirui Jin", "Cheng Zeng", "Pawan Prakash", "Ellad B. Tadmor", "Adrian Roitberg", "Richard G. Hennig", "Stefano Martiniani", "Mingjie Liu"], "title": "MolGuidance: Advanced Guidance Strategies for Conditional Molecular Generation with Flow Matching", "categories": ["cs.LG", "q-bio.QM"], "comment": "19 pages, 5 figures, code: https://github.com/Liu-Group-UF/MolGuidance", "summary": "Key objectives in conditional molecular generation include ensuring chemical validity, aligning generated molecules with target properties, promoting structural diversity, and enabling efficient sampling for discovery. Recent advances in computer vision introduced a range of new guidance strategies for generative models, many of which can be adapted to support these goals. In this work, we integrate state-of-the-art guidance methods -- including classifier-free guidance, autoguidance, and model guidance -- in a leading molecule generation framework built on an SE(3)-equivariant flow matching process. We propose a hybrid guidance strategy that separately guides continuous and discrete molecular modalities -- operating on velocity fields and predicted logits, respectively -- while jointly optimizing their guidance scales via Bayesian optimization. Our implementation, benchmarked on the QM9 and QMe14S datasets, achieves new state-of-the-art performance in property alignment for de novo molecular generation. The generated molecules also exhibit high structural validity. Furthermore, we systematically compare the strengths and limitations of various guidance methods, offering insights into their broader applicability."}
