{"id": "2507.12699", "pdf": "https://arxiv.org/pdf/2507.12699", "abs": "https://arxiv.org/abs/2507.12699", "authors": ["Hamidreza Akef", "Minki Hhan", "David Soloveichik"], "title": "Computing and Bounding Equilibrium Concentrations in Athermic Chemical Systems", "categories": ["cs.DS", "q-bio.MN", "G.2.1; J.2"], "comment": "To be published in DNA31 (31st International Conference on DNA\n  Computing and Molecular Programming)", "summary": "Computing equilibrium concentrations of molecular complexes is generally\nanalytically intractable and requires numerical approaches. In this work we\nfocus on the polymer-monomer level, where indivisible molecules (monomers)\ncombine to form complexes (polymers). Rather than employing free-energy\nparameters for each polymer, we focus on the athermic setting where all\ninteractions preserve enthalpy. This setting aligns with the strongly bonded\n(domain-based) regime in DNA nanotechnology when strands can bind in different\nways, but always with maximum overall bonding -- and is consistent with the\nsaturated configurations in the Thermodynamic Binding Networks (TBNs) model.\nWithin this context, we develop an iterative algorithm for assigning polymer\nconcentrations to satisfy detailed-balance, where on-target (desired) polymers\nare in high concentrations and off-target (undesired) polymers are in low. Even\nif not directly executed, our algorithm provides effective insights into upper\nbounds on concentration of off-target polymers, connecting combinatorial\narguments about discrete configurations such as those in the TBN model to\nreal-valued concentrations. We conclude with an application of our method to\ndecreasing leak in DNA logic and signal propagation. Our results offer a new\nframework for design and verification of equilibrium concentrations when\nconfigurations are distinguished by entropic forces."}
{"id": "2507.12500", "pdf": "https://arxiv.org/pdf/2507.12500", "abs": "https://arxiv.org/abs/2507.12500", "authors": ["Shuaitong Zhang", "Yuchen Sun", "Yong Ao", "Xuehuan Zhang", "Ruoshui Yang", "Jiantao Xu", "Zuwu Ai", "Haike Zhang", "Xiang Yang", "Yao Xu", "Kunwei Li", "Duanduan Chen"], "title": "GLOMIA-Pro: A Generalizable Longitudinal Medical Image Analysis Framework for Disease Progression Prediction", "categories": ["q-bio.QM", "eess.IV"], "comment": "This work has been submitted to the IEEE for possible publication", "summary": "Longitudinal medical images are essential for monitoring disease progression\nby capturing spatiotemporal changes associated with dynamic biological\nprocesses. While current methods have made progress in modeling spatiotemporal\npatterns, they face three key limitations: (1) lack of generalizable framework\napplicable to diverse disease progression prediction tasks; (2) frequent\noverlook of the ordinal nature inherent in disease staging; (3) susceptibility\nto representation collapse due to structural similarities between adjacent time\npoints, which can obscure subtle but discriminative progression biomarkers. To\naddress these limitations, we propose a Generalizable LOngitudinal Medical\nImage Analysis framework for disease Progression prediction (GLOMIA-Pro).\nGLOMIA-Pro consists of two core components: progression representation\nextraction and progression-aware fusion. The progression representation\nextraction module introduces a piecewise orthogonal attention mechanism and\nemploys a novel ordinal progression constraint to disentangle finegrained\ntemporal imaging variations relevant to disease progression. The\nprogression-aware fusion module incorporates a redesigned skip connection\narchitecture which integrates the learned progression representation with\ncurrent imaging representation, effectively mitigating representation collapse\nduring cross-temporal fusion. Validated on two distinct clinical applications:\nknee osteoarthritis severity prediction and esophageal cancer treatment\nresponse assessment, GLOMIA-Pro consistently outperforms seven state-of-the-art\nlongitudinal analysis methods. Ablation studies further confirm the\ncontribution of individual components, demonstrating the robustness and\ngeneralizability of GLOMIA-Pro across diverse clinical scenarios."}
{"id": "2507.13077", "pdf": "https://arxiv.org/pdf/2507.13077", "abs": "https://arxiv.org/abs/2507.13077", "authors": ["Sergio E. Mares", "Ariel Espinoza Weinberger", "Nilah M. Ioannidis"], "title": "Continued domain-specific pre-training of protein language models for pMHC-I binding prediction", "categories": ["q-bio.QM"], "comment": "Accepted to the 20th Machine Learning in Computational Biology (MLCB)\n  Proceedings of Machine Learning Research", "summary": "Predicting peptide--major histocompatibility complex I (pMHC-I) binding\naffinity remains challenging due to extreme allelic diversity ($\\sim$30,000 HLA\nalleles), severe data scarcity for most alleles, and noisy experimental\nmeasurements. Current methods particularly struggle with underrepresented\nalleles and quantitative binding prediction. We test whether domain-specific\ncontinued pre-training of protein language models is beneficial for their\napplication to pMHC-I binding affinity prediction. Starting from ESM Cambrian\n(300M parameters), we perform masked-language modeling (MLM)-based continued\npre-training on HLA-associated peptides (epitopes), testing two input formats:\nepitope sequences alone versus epitopes concatenated with HLA heavy chain\nsequences. We then fine-tune for functional IC$_{50}$ binding affinity\nprediction using only high-quality quantitative data, avoiding mass\nspectrometry biases that are inherited by existing methods."}
{"id": "2507.12574", "pdf": "https://arxiv.org/pdf/2507.12574", "abs": "https://arxiv.org/abs/2507.12574", "authors": ["Yifan Deng", "Spencer S. Ericksen", "Anthony Gitter"], "title": "Assay2Mol: large language model-based drug design using BioAssay context", "categories": ["cs.LG", "cs.AI", "q-bio.QM"], "comment": "23 pages, 10 figures", "summary": "Scientific databases aggregate vast amounts of quantitative data alongside\ndescriptive text. In biochemistry, molecule screening assays evaluate the\nfunctional responses of candidate molecules against disease targets.\nUnstructured text that describes the biological mechanisms through which these\ntargets operate, experimental screening protocols, and other attributes of\nassays offer rich information for new drug discovery campaigns but has been\nuntapped because of that unstructured format. We present Assay2Mol, a large\nlanguage model-based workflow that can capitalize on the vast existing\nbiochemical screening assays for early-stage drug discovery. Assay2Mol\nretrieves existing assay records involving targets similar to the new target\nand generates candidate molecules using in-context learning with the retrieved\nassay screening data. Assay2Mol outperforms recent machine learning approaches\nthat generate candidate ligand molecules for target protein structures, while\nalso promoting more synthesizable molecule generation."}
{"id": "2507.12679", "pdf": "https://arxiv.org/pdf/2507.12679", "abs": "https://arxiv.org/abs/2507.12679", "authors": ["Arthur J. Funnell", "Panayiotis Petousis", "Fabrice Harel-Canada", "Ruby Romero", "Alex A. T. Bui", "Adam Koncsol", "Hritika Chaturvedi", "Chelsea Shover", "David Goodman-Meza"], "title": "Improving Drug Identification in Overdose Death Surveillance using Large Language Models", "categories": ["cs.CL", "q-bio.QM", "I.2.7; J.3"], "comment": "30 pages, 1 figure, 4 tables, 2 supplemental figures, 4 supplemental\n  tables, submitted to Journal of Forensic Sciences (JFS)", "summary": "The rising rate of drug-related deaths in the United States, largely driven\nby fentanyl, requires timely and accurate surveillance. However, critical\noverdose data are often buried in free-text coroner reports, leading to delays\nand information loss when coded into ICD (International Classification of\nDisease)-10 classifications. Natural language processing (NLP) models may\nautomate and enhance overdose surveillance, but prior applications have been\nlimited. A dataset of 35,433 death records from multiple U.S. jurisdictions in\n2020 was used for model training and internal testing. External validation was\nconducted using a novel separate dataset of 3,335 records from 2023-2024.\nMultiple NLP approaches were evaluated for classifying specific drug\ninvolvement from unstructured death certificate text. These included\ntraditional single- and multi-label classifiers, as well as fine-tuned\nencoder-only language models such as Bidirectional Encoder Representations from\nTransformers (BERT) and BioClinicalBERT, and contemporary decoder-only large\nlanguage models such as Qwen 3 and Llama 3. Model performance was assessed\nusing macro-averaged F1 scores, and 95% confidence intervals were calculated to\nquantify uncertainty. Fine-tuned BioClinicalBERT models achieved near-perfect\nperformance, with macro F1 scores >=0.998 on the internal test set. External\nvalidation confirmed robustness (macro F1=0.966), outperforming conventional\nmachine learning, general-domain BERT models, and various decoder-only large\nlanguage models. NLP models, particularly fine-tuned clinical variants like\nBioClinicalBERT, offer a highly accurate and scalable solution for overdose\ndeath classification from free-text reports. These methods can significantly\naccelerate surveillance workflows, overcoming the limitations of manual ICD-10\ncoding and supporting near real-time detection of emerging substance use\ntrends."}
{"id": "2507.13176", "pdf": "https://arxiv.org/pdf/2507.13176", "abs": "https://arxiv.org/abs/2507.13176", "authors": ["Moritz Leuthner", "Rafael Vorländer", "Oliver Hayden"], "title": "Disentangling coincident cell events using deep transfer learning and compressive sensing", "categories": ["eess.SP", "q-bio.QM"], "comment": null, "summary": "Accurate single-cell analysis is critical for diagnostics, immunomonitoring,\nand cell therapy, but coincident events - where multiple cells overlap in a\nsensing zone - can severely compromise signal fidelity. We present a hybrid\nframework combining a fully convolutional neural network (FCN) with compressive\nsensing (CS) to disentangle such overlapping events in one-dimensional sensor\ndata. The FCN, trained on bead-derived datasets, accurately estimates\ncoincident event counts and generalizes to immunomagnetically labeled CD4+ and\nCD14+ cells in whole blood without retraining. Using this count, the CS module\nreconstructs individual signal components with high fidelity, enabling precise\nrecovery of single-cell features, including velocity, amplitude, and\nhydrodynamic diameter. Benchmarking against conventional state-machine\nalgorithms shows superior performance - recovering up to 21% more events and\nimproving classification accuracy beyond 97%. Explinability via class\nactivation maps and parameterized Gaussian template fitting ensures\ntransparency and clinical interpretability. Demonstrated with magnetic flow\ncytometry (MFC), the framework is compatible with other waveform-generating\nmodalities, including impedance cytometry, nanopore, and resistive pulse\nsensing. This work lays the foundation for next-generation non-optical\nsingle-cell sensing platforms that are automated, generalizable, and capable of\nresolving overlapping events, broadening the utility of cytometry in\ntranslational medicine and precision diagnostics, e.g. cell-interaction\nstudies."}
