{"id": "2512.17106", "pdf": "https://arxiv.org/pdf/2512.17106", "abs": "https://arxiv.org/abs/2512.17106", "authors": ["Eugenio Simao"], "title": "Weak Independence and Coupled Parallelism in Biological Petri Nets", "categories": ["q-bio.MN", "q-bio.QM"], "comment": "7 pages, 2 figures, 5 tables", "summary": "Motivation: Biological Petri Nets (Bio-PNs) model biochemical pathways where multiple reactions simultaneously affect shared metabolites through convergent production or regulatory coupling. However, classical Petri net independence theory requires transitions to share no places -- a constraint that fails to capture biological reality. This mismatch prevents parallel simulation and incorrectly flags biologically valid models as structurally problematic.\n  Results: To resolve this fundamental limitation, we introduce weak independence -- a novel formalization distinguishing resource conflicts from biological coupling. Building on this theory, we extend the Bio-PN definition from a classical 5-tuple to a 12-tuple by adding regulatory structure, environmental exchange classification, dependency taxonomy, heterogeneous transition types, and biochemical formula tracking. This extended formalism enables systematic classification of three place-sharing modes: competitive (conflict), convergent (superposition), and regulatory (read-only). Validating our approach on 100 diverse BioModels (1,775 species, 2,234 reactions across metabolism, signaling, and gene regulation), we find that 96.93% of transition pairs exhibit weak independence -- confirming that biological networks inherently favor cooperation over competition. Our SHYpn implementation demonstrates the practical impact, achieving up to 2.6x speedup on 30% of evaluated models.\n  Availability and Implementation: Open-source at https://github.com/simao-eugenio/shypn (MIT License)."}
{"id": "2512.17129", "pdf": "https://arxiv.org/pdf/2512.17129", "abs": "https://arxiv.org/abs/2512.17129", "authors": ["Seong Ho Pahng", "Guoye Guan", "Benjamin Fefferman", "Sahand Hormoz"], "title": "DiffeoMorph: Learning to Morph 3D Shapes Using Differentiable Agent-Based Simulations", "categories": ["cs.LG", "cs.MA", "cs.RO", "q-bio.QM"], "comment": null, "summary": "Biological systems can form complex three-dimensional structures through the collective behavior of identical agents -- cells that follow the same internal rules and communicate without central control. How such distributed control gives rise to precise global patterns remains a central question not only in developmental biology but also in distributed robotics, programmable matter, and multi-agent learning. Here, we introduce DiffeoMorph, an end-to-end differentiable framework for learning a morphogenesis protocol that guides a population of agents to morph into a target 3D shape. Each agent updates its position and internal state using an attention-based SE(3)-equivariant graph neural network, based on its own internal state and signals received from other agents. To train this system, we introduce a new shape-matching loss based on the 3D Zernike polynomials, which compares the predicted and target shapes as continuous spatial distributions, not as discrete point clouds, and is invariant to agent ordering, number of agents, and rigid-body transformations. To enforce full SO(3) invariance -- invariant to rotations yet sensitive to reflections, we include an alignment step that optimally rotates the predicted Zernike spectrum to match the target before computing the loss. This results in a bilevel problem, with the inner loop optimizing a unit quaternion for the best alignment and the outer loop updating the agent model. We compute gradients through the alignment step using implicit differentiation. We perform systematic benchmarking to establish the advantages of our shape-matching loss over other standard distance metrics for shape comparison tasks. We then demonstrate that DiffeoMorph can form a range of shapes -- from simple ellipsoids to complex morphologies -- using only minimal spatial cues."}
{"id": "2512.17146", "pdf": "https://arxiv.org/pdf/2512.17146", "abs": "https://arxiv.org/abs/2512.17146", "authors": ["Huixin Zhan"], "title": "Biosecurity-Aware AI: Agentic Risk Auditing of Soft Prompt Attacks on ESM-Based Variant Predictors", "categories": ["cs.CR", "cs.LG", "q-bio.QM"], "comment": null, "summary": "Genomic Foundation Models (GFMs), such as Evolutionary Scale Modeling (ESM), have demonstrated remarkable success in variant effect prediction. However, their security and robustness under adversarial manipulation remain largely unexplored. To address this gap, we introduce the Secure Agentic Genomic Evaluator (SAGE), an agentic framework for auditing the adversarial vulnerabilities of GFMs. SAGE functions through an interpretable and automated risk auditing loop. It injects soft prompt perturbations, monitors model behavior across training checkpoints, computes risk metrics such as AUROC and AUPR, and generates structured reports with large language model-based narrative explanations. This agentic process enables continuous evaluation of embedding-space robustness without modifying the underlying model. Using SAGE, we find that even state-of-the-art GFMs like ESM2 are sensitive to targeted soft prompt attacks, resulting in measurable performance degradation. These findings reveal critical and previously hidden vulnerabilities in genomic foundation models, showing the importance of agentic risk auditing in securing biomedical applications such as clinical variant interpretation."}
{"id": "2512.17126", "pdf": "https://arxiv.org/pdf/2512.17126", "abs": "https://arxiv.org/abs/2512.17126", "authors": ["Xiaoxiao Zhou", "Zihan Wang", "Jingbo Shang", "Yang E. Li"], "title": "DNAMotifTokenizer: Towards Biologically Informed Tokenization of Genomic Sequences", "categories": ["q-bio.GN"], "comment": "Preprint", "summary": "DNA language models have advanced genomics, but their downstream performance varies widely due to differences in tokenization, pretraining data, and architecture. We argue that a major bottleneck lies in tokenizing sparse and unevenly distributed DNA sequence motifs, which are critical for accurate and interpretable models. To investigate, we systematically benchmark k-mer and Byte-Pair Encoding (BPE) tokenizers under controlled pretraining budget, evaluating across multiple downstream tasks from five datasets. We find that tokenizer choice induces task-specific trade-offs, and that vocabulary size and tokenizer training data strongly influence the biological knowledge captured. Notably, BPE tokenizers achieve strong performance when trained on smaller but biologically significant data. Building on these insights, we introduce DNAMotifTokenizer, which directly incorporates domain knowledge of DNA sequence motifs into the tokenization process. DNAMotifTokenizer consistently outperforms BPE across diverse benchmarks, demonstrating that knowledge-infused tokenization is crucial for learning powerful, interpretable, and generalizable genomic representations."}
{"id": "2512.17512", "pdf": "https://arxiv.org/pdf/2512.17512", "abs": "https://arxiv.org/abs/2512.17512", "authors": ["Vipin Kumar", "Roberto Rossini", "Jonas Paulsen", "Anthony Mathelier"], "title": "BHiCect 2.0: Multi-resolution clustering of Hi-C data", "categories": ["q-bio.GN"], "comment": null, "summary": "Chromatin conformation capture technologies such as Hi-C have revealed that the genome is organized in a hierarchy of structures spanning multiple scales observed at different resolutions. Current algorithms often focus on specific interaction patterns found at a specific Hi-C resolution. We present BHi-Cect 2.0, a method that leverages Hi-C data at multiple resolutions to describe chromosome architecture as nested preferentially self-interacting clusters using spectral clustering. This new version describes the hierarchical configuration of chromosomes by now integrating multiple Hi-C data resolutions. Our new implementation offers a more comprehensive description of the multi-scale architecture of the chromosomes. We further provide these functionalities as an R package to assist their integration with other computational pipelines. The BHiCect 2.0 R packages is available on github at https://github.com/princeps091-binf/BHiCect2with the version used for this manuscript on Zenodo at https://doi.org/10.5281/zenodo.17985844."}
