{"id": "2508.01490", "pdf": "https://arxiv.org/pdf/2508.01490", "abs": "https://arxiv.org/abs/2508.01490", "authors": ["Rushin H. Gindra", "Giovanni Palla", "Mathias Nguyen", "Sophia J. Wagner", "Manuel Tran", "Fabian J Theis", "Dieter Saur", "Lorin Crawford", "Tingying Peng"], "title": "A Large-Scale Benchmark of Cross-Modal Learning for Histology and Gene Expression in Spatial Transcriptomics", "categories": ["q-bio.GN", "cs.AI", "cs.CV", "cs.LG", "q-bio.TO", "stat.AP"], "comment": "The code is accessible at: https://github.com/peng-lab/hescape", "summary": "Spatial transcriptomics enables simultaneous measurement of gene expression\nand tissue morphology, offering unprecedented insights into cellular\norganization and disease mechanisms. However, the field lacks comprehensive\nbenchmarks for evaluating multimodal learning methods that leverage both\nhistology images and gene expression data. Here, we present HESCAPE, a\nlarge-scale benchmark for cross-modal contrastive pretraining in spatial\ntranscriptomics, built on a curated pan-organ dataset spanning 6 different gene\npanels and 54 donors. We systematically evaluated state-of-the-art image and\ngene expression encoders across multiple pretraining strategies and assessed\ntheir effectiveness on two downstream tasks: gene mutation classification and\ngene expression prediction. Our benchmark demonstrates that gene expression\nencoders are the primary determinant of strong representational alignment, and\nthat gene models pretrained on spatial transcriptomics data outperform both\nthose trained without spatial data and simple baseline approaches. However,\ndownstream task evaluation reveals a striking contradiction: while contrastive\npretraining consistently improves gene mutation classification performance, it\ndegrades direct gene expression prediction compared to baseline encoders\ntrained without cross-modal objectives. We identify batch effects as a key\nfactor that interferes with effective cross-modal alignment. Our findings\nhighlight the critical need for batch-robust multimodal learning approaches in\nspatial transcriptomics. To accelerate progress in this direction, we release\nHESCAPE, providing standardized datasets, evaluation protocols, and\nbenchmarking tools for the community"}
{"id": "2508.02061", "pdf": "https://arxiv.org/pdf/2508.02061", "abs": "https://arxiv.org/abs/2508.02061", "authors": ["Shanshan Ren", "Thomas E. Bartlett", "Lina Gerontogianni", "Swati Chandna"], "title": "A Bayesian approach to model uncertainty in single-cell genomic data", "categories": ["q-bio.GN", "q-bio.QM"], "comment": null, "summary": "Network models provide a powerful framework for analysing single-cell count\ndata, facilitating the characterisation of cellular identities, disease\nmechanisms, and developmental trajectories. However, uncertainty modeling in\nunsupervised learning with genomic data remains insufficiently explored.\nConventional clustering methods assign a singular identity to each cell,\npotentially obscuring transitional states during differentiation or mutation.\nThis study introduces a variational Bayesian framework for clustering and\nanalysing single-cell genomic data, employing a Bayesian Gaussian mixture model\nto estimate the probabilistic association of cells with distinct clusters. This\napproach captures cellular transitions, yielding biologically coherent insights\ninto neurogenesis and breast cancer progression. The inferred clustering\nprobabilities enable further analyses, including Differential Expression\nAnalysis and pseudotime analysis. Furthermore, we propose utilising the\nmisclustering rate and Area Under the Curve in clustering scRNA-seq data as an\ninnovative metric to quantitatively evaluate overall clustering performance.\nThis methodological advancement enhances the resolution of single-cell data\nanalysis, enabling a more nuanced characterisation of dynamic cellular\nidentities in development and disease."}
{"id": "2508.00953", "pdf": "https://arxiv.org/pdf/2508.00953", "abs": "https://arxiv.org/abs/2508.00953", "authors": ["Junyi Qi", "Thorkil Casse", "Masayoshi Harada", "Linh Thi Hoai Nguyen", "Ton Viet Ta"], "title": "Quantifying Fish School Fragmentation under Predation Using Stochastic Differential Equations", "categories": ["q-bio.QM", "math.DS", "q-bio.PE"], "comment": null, "summary": "This study builds upon our previously proposed stochastic differential\nequation (SDE)-based model to further investigate fish school fragmentation\nunder predation. Specifically, we explore structural dynamics by incorporating\ngraph-theoretic metrics--namely, the number of connected components--to\nquantify changes in prey school organization. Two quantitative indicators,\nfirst split time and final component count, are introduced to assess the timing\nand extent of group disintegration. Sensitivity analyses are performed on key\nparameters to evaluate their influence on group stability under nearest attack\nand center attack strategies. We independently examine the effect of\nenvironmental noise on fish school cohesion. Simulation results show that\nparameter changes impact fish school fragmentation differently under the two\npredation strategies. High environmental noise also makes it difficult for the\nschool to stay cohesive. This framework provides a structured and quantitative\nbasis for assessing how fish schools respond to different predation strategies\nand environmental noise levels."}
{"id": "2508.01228", "pdf": "https://arxiv.org/pdf/2508.01228", "abs": "https://arxiv.org/abs/2508.01228", "authors": ["Maximilian Pichler", "Yannek Käber"], "title": "Inferring processes within dynamic forest models using hybrid modeling", "categories": ["q-bio.QM", "cs.LG", "stat.ML"], "comment": "29 pages, 16 figures", "summary": "Modeling forest dynamics under novel climatic conditions requires a careful\nbalance between process-based understanding and empirical flexibility. Dynamic\nVegetation Models (DVM) represent ecological processes mechanistically, but\ntheir performance is prone to misspecified assumptions about functional forms.\nInferring the structure of these processes and their functional forms correctly\nfrom data remains a major challenge because current approaches, such as plug-in\nestimators, have proven ineffective. We introduce Forest Informed Neural\nNetworks (FINN), a hybrid modeling approach that combines a forest gap model\nwith deep neural networks (DNN). FINN replaces processes with DNNs, which are\nthen calibrated alongside the other mechanistic components in one unified step.\nIn a case study on the Barro Colorado Island 50-ha plot we demonstrate that\nreplacing the growth process with a DNN improves predictive performance and\nsuccession trajectories compared to a fully mechanistic version of FINN.\nFurthermore, we discovered that the DNN learned an ecologically plausible,\nimproved functional form of growth, which we extracted from the DNN using\nexplainable AI. In conclusion, our new hybrid modeling approach offers a\nversatile opportunity to infer forest dynamics from data and to improve\nforecasts of ecosystem trajectories under unprecedented environmental change."}
{"id": "2508.02400", "pdf": "https://arxiv.org/pdf/2508.02400", "abs": "https://arxiv.org/abs/2508.02400", "authors": ["Deep S Banerjee", "Jozef Skakala", "David Ford"], "title": "Combining machine learning with data assimilation to improve the quality of phytoplankton forecasting in a shelf sea environment", "categories": ["q-bio.QM"], "comment": "21 pages, 8 figures, submitted to QJRMS", "summary": "We demonstrate that combining machine learning with data assimilation leads\nto a major improvement in phytoplankton short-range (1-5 day) forecasts for the\nNorth-West European Shelf (NWES) seas. We show that excess nitrate\nconcentrations are a major reason behind known biases in phytoplankton\nforecasts during late Spring and Summer, which can grow fast with lead time.\nAssimilating observations of nitrate would potentially help address this, but\nNWES nitrate data are typically not available in sufficient abundance to be\neffectively assimilated. We have therefore used a recently developed and\nvalidated neural network (NN) model predicting surface nitrate concentrations\nfrom a range of observable variables and implemented its assimilation within a\nresearch and development version of the Met Office's NWES operational\nforecasting system. As a result of nitrate assimilation the phytoplankton\nforecast skill improves by up to 30%. We show that although much of this\nimprovement can be achieved by using a weekly nitrate climatology predicted by\nthe NN model, there is a clear advantage in using flow-dependent nitrate data.\nWe discuss the impacts of this improvement on a range of additional\neutrophication indicators, such as dissolved inorganic phosphorus and sea\nbottom oxygen. We argue that it should be feasible to implement this hybrid\nmachine learning - data assimilation approach within the near-real time NWES\noperational forecasting system."}
{"id": "2508.01055", "pdf": "https://arxiv.org/pdf/2508.01055", "abs": "https://arxiv.org/abs/2508.01055", "authors": ["Xuan Liu", "Siru Ouyang", "Xianrui Zhong", "Jiawei Han", "Huimin Zhao"], "title": "FGBench: A Dataset and Benchmark for Molecular Property Reasoning at Functional Group-Level in Large Language Models", "categories": ["cs.LG", "cs.AI", "q-bio.BM", "q-bio.QM"], "comment": "20 pages, 20 figures", "summary": "Large language models (LLMs) have gained significant attention in chemistry.\nHowever, most existing datasets center on molecular-level property prediction\nand overlook the role of fine-grained functional group (FG) information.\nIncorporating FG-level data can provide valuable prior knowledge that links\nmolecular structures with textual descriptions, which can be used to build more\ninterpretable, structure-aware LLMs for reasoning on molecule-related tasks.\nMoreover, LLMs can learn from such fine-grained information to uncover hidden\nrelationships between specific functional groups and molecular properties,\nthereby advancing molecular design and drug discovery. Here, we introduce\nFGBench, a dataset comprising 625K molecular property reasoning problems with\nfunctional group information. Functional groups are precisely annotated and\nlocalized within the molecule, which ensures the dataset's interoperability\nthereby facilitating further multimodal applications. FGBench includes both\nregression and classification tasks on 245 different functional groups across\nthree categories for molecular property reasoning: (1) single functional group\nimpacts, (2) multiple functional group interactions, and (3) direct molecular\ncomparisons. In the benchmark of state-of-the-art LLMs on 7K curated data, the\nresults indicate that current LLMs struggle with FG-level property reasoning,\nhighlighting the need to enhance reasoning capabilities in LLMs for chemistry\ntasks. We anticipate that the methodology employed in FGBench to construct\ndatasets with functional group-level information will serve as a foundational\nframework for generating new question-answer pairs, enabling LLMs to better\nunderstand fine-grained molecular structure-property relationships. The dataset\nand evaluation code are available at\n\\href{https://github.com/xuanliugit/FGBench}{https://github.com/xuanliugit/FGBench}."}
{"id": "2508.01277", "pdf": "https://arxiv.org/pdf/2508.01277", "abs": "https://arxiv.org/abs/2508.01277", "authors": ["Raphael Schwinger", "Paria Vali Zadeh", "Lukas Rauch", "Mats Kurz", "Tom Hauschild", "Sam Lapp", "Sven Tomforde"], "title": "Foundation Models for Bioacoustics -- a Comparative Review", "categories": ["cs.SD", "cs.LG", "eess.AS", "q-bio.QM"], "comment": "Preprint", "summary": "Automated bioacoustic analysis is essential for biodiversity monitoring and\nconservation, requiring advanced deep learning models that can adapt to diverse\nbioacoustic tasks. This article presents a comprehensive review of large-scale\npretrained bioacoustic foundation models and systematically investigates their\ntransferability across multiple bioacoustic classification tasks. We overview\nbioacoustic representation learning including major pretraining data sources\nand benchmarks. On this basis, we review bioacoustic foundation models by\nthoroughly analysing design decisions such as model architecture, pretraining\nscheme, and training paradigm. Additionally, we evaluate selected foundation\nmodels on classification tasks from the BEANS and BirdSet benchmarks, comparing\nthe generalisability of learned representations under both linear and attentive\nprobing strategies. Our comprehensive experimental analysis reveals that\nBirdMAE, trained on large-scale bird song data with a self-supervised\nobjective, achieves the best performance on the BirdSet benchmark. On BEANS,\nBEATs$_{NLM}$, the extracted encoder of the NatureLM-audio large audio model,\nis slightly better. Both transformer-based models require attentive probing to\nextract the full performance of their representations. ConvNext$_{BS}$ and\nPerch models trained with supervision on large-scale bird song data remain\ncompetitive for passive acoustic monitoring classification tasks of BirdSet in\nlinear probing settings. Training a new linear classifier has clear advantages\nover evaluating these models without further training. While on BEANS, the\nbaseline model BEATs trained with self-supervision on AudioSet outperforms\nbird-specific models when evaluated with attentive probing. These findings\nprovide valuable guidance for practitioners selecting appropriate models to\nadapt them to new bioacoustic classification tasks via probing."}
{"id": "2508.01501", "pdf": "https://arxiv.org/pdf/2508.01501", "abs": "https://arxiv.org/abs/2508.01501", "authors": ["Shah Ishmam Mohtashim"], "title": "RinQ: Predicting central sites in proteins on current quantum computers", "categories": ["quant-ph", "cond-mat.soft", "physics.bio-ph", "q-bio.QM"], "comment": null, "summary": "We introduce RinQ, a hybrid quantum-classical framework for identifying\nfunctionally critical residues in proteins, utilizing techniques in quantum\noptimization. To that end, protein structures are modeled as residue\ninteraction networks (RINs), and the centrality detection task is cast as a\nQuadratic Unconstrained Binary Optimization (QUBO) problem. Solved using\nD-Wave's simulated annealing, this approach is applied to a diverse set of\nproteins, including small peptides and biologically significant regulatory\nproteins. RinQ consistently finds residues that align with classical centrality\nbenchmarks, underscoring the accuracy and reliability of the approach. This\nwork highlights the promise of near-term quantum and quantum-inspired methods\nfor advancing protein network analysis and lays the groundwork for future\nextensions to larger systems using real quantum hardware."}
{"id": "2508.01806", "pdf": "https://arxiv.org/pdf/2508.01806", "abs": "https://arxiv.org/abs/2508.01806", "authors": ["Ugur G. Abdulla", "Jose H. Rodrigues", "Jean-Jacques Slotine"], "title": "Quantum Optimal Control for Coherent Spin Dynamics of Radical Pairs via Pontryagin Maximum Principle", "categories": ["quant-ph", "q-bio.QM", "81Q93 (Primary), 49J50, 49K15, 49M05,", "G.1.6; G.1.7; G.4; I.6.4"], "comment": "36 pages, 18 figures", "summary": "This paper aims at devising the shape of the external electromagnetic field\nwhich drives the spin dynamics of radical pairs to quantum coherent state\nthrough maximization of the triplet-singlet yield in biochemical reactions. The\nmodel is a Schr\\\"{o}dinger system with spin Hamiltonians given by the sum of\nZeeman interaction and hyperfine coupling interaction terms. We introduce a\none-parameter family of optimal control problems by coupling the\nSchr\\\"{o}dinger system to a control field through filtering equations for the\nelectromagnetic field. Fr\\'echet differentiability and the Pontryagin Maximum\nPrinciple in Hilbert space is proved, and the bang-bang structure of the\noptimal control is established. A new iterative Pontryagin Maximum Principle\n(IPMP) method for the identification of the bang-bang optimal control is\ndeveloped. Numerical simulations based on IPMP and the gradient projection\nmethod (GPM) in Hilbert spaces are pursued, and the convergence, stability and\nthe regularization effect are demonstrated. Comparative analysis of filtering\nwith regular optimal electromagnetic field versus non-filtering with bang-bang\noptimal field ({\\it Abdulla et al, Quantum Sci. Technol., {\\bf9}, 4, 2024})\ndemonstrates the change of the maxima of the singlet yield is less than 1\\%.\nThe results open a venue for a potential experimental work for the\nmagnetoreception as a manifestation of quantum biological phenomena."}
{"id": "2508.01920", "pdf": "https://arxiv.org/pdf/2508.01920", "abs": "https://arxiv.org/abs/2508.01920", "authors": ["Rahul Biswas", "SuryaNarayana Sripada", "Somabha Mukherjee", "Reza Abbasi-Asl"], "title": "CITS: Nonparametric Statistical Causal Modeling for High-Resolution Neural Time Series", "categories": ["q-bio.NC", "q-bio.QM", "stat.AP"], "comment": "arXiv admin note: text overlap with arXiv:2312.09604", "summary": "Understanding how signals propagate through neural circuits is central to\ndeciphering brain computation. While functional connectivity captures\nstatistical associations, it does not reveal directionality or causal\nmechanisms. We introduce CITS (Causal Inference in Time Series), a\nnon-parametric method for inferring statistically causal neural circuitry from\nhigh-resolution time series data. CITS models neural dynamics using a\nstructural causal model with arbitrary Markov order and tests for time-lagged\nconditional independence using either Gaussian or distribution-free statistics.\nUnlike classical Granger Causality, which assumes linear autoregressive models\nand Gaussian noise, or the Peter-Clark algorithm, which assumes i.i.d. data and\nno temporal structure, CITS handles temporally dependent, potentially\nnon-Gaussian data with flexible testing procedures. We prove consistency under\nmild mixing assumptions and validate CITS on simulated linear, nonlinear, and\ncontinuous-time recurrent neural network data, where it outperforms\nstate-of-the-art methods. We then apply CITS to Neuropixels recordings from\nmouse brain during visual tasks. CITS uncovers interpretable, stimulus-specific\ncausal circuits linking cortical, thalamic, and hippocampal regions, consistent\nwith experimental literature. It also reveals that neurons with similar\norientation selectivity indices are more likely to be causally connected. Our\nresults demonstrate the utility of CITS in uncovering biologically meaningful\npathways and generating hypotheses for future experimental studies."}
{"id": "2508.02061", "pdf": "https://arxiv.org/pdf/2508.02061", "abs": "https://arxiv.org/abs/2508.02061", "authors": ["Shanshan Ren", "Thomas E. Bartlett", "Lina Gerontogianni", "Swati Chandna"], "title": "A Bayesian approach to model uncertainty in single-cell genomic data", "categories": ["q-bio.GN", "q-bio.QM"], "comment": null, "summary": "Network models provide a powerful framework for analysing single-cell count\ndata, facilitating the characterisation of cellular identities, disease\nmechanisms, and developmental trajectories. However, uncertainty modeling in\nunsupervised learning with genomic data remains insufficiently explored.\nConventional clustering methods assign a singular identity to each cell,\npotentially obscuring transitional states during differentiation or mutation.\nThis study introduces a variational Bayesian framework for clustering and\nanalysing single-cell genomic data, employing a Bayesian Gaussian mixture model\nto estimate the probabilistic association of cells with distinct clusters. This\napproach captures cellular transitions, yielding biologically coherent insights\ninto neurogenesis and breast cancer progression. The inferred clustering\nprobabilities enable further analyses, including Differential Expression\nAnalysis and pseudotime analysis. Furthermore, we propose utilising the\nmisclustering rate and Area Under the Curve in clustering scRNA-seq data as an\ninnovative metric to quantitatively evaluate overall clustering performance.\nThis methodological advancement enhances the resolution of single-cell data\nanalysis, enabling a more nuanced characterisation of dynamic cellular\nidentities in development and disease."}
{"id": "2508.02276", "pdf": "https://arxiv.org/pdf/2508.02276", "abs": "https://arxiv.org/abs/2508.02276", "authors": ["Xiangru Tang", "Zhuoyun Yu", "Jiapeng Chen", "Yan Cui", "Daniel Shao", "Weixu Wang", "Fang Wu", "Yuchen Zhuang", "Wenqi Shi", "Zhi Huang", "Arman Cohan", "Xihong Lin", "Fabian Theis", "Smita Krishnaswamy", "Mark Gerstein"], "title": "CellForge: Agentic Design of Virtual Cell Models", "categories": ["cs.LG", "cs.AI", "cs.CL", "q-bio.QM"], "comment": null, "summary": "Virtual cell modeling represents an emerging frontier at the intersection of\nartificial intelligence and biology, aiming to predict quantities such as\nresponses to diverse perturbations quantitatively. However, autonomously\nbuilding computational models for virtual cells is challenging due to the\ncomplexity of biological systems, the heterogeneity of data modalities, and the\nneed for domain-specific expertise across multiple disciplines. Here, we\nintroduce CellForge, an agentic system that leverages a multi-agent framework\nthat transforms presented biological datasets and research objectives directly\ninto optimized computational models for virtual cells. More specifically, given\nonly raw single-cell multi-omics data and task descriptions as input, CellForge\noutputs both an optimized model architecture and executable code for training\nvirtual cell models and inference. The framework integrates three core modules:\nTask Analysis for presented dataset characterization and relevant literature\nretrieval, Method Design, where specialized agents collaboratively develop\noptimized modeling strategies, and Experiment Execution for automated\ngeneration of code. The agents in the Design module are separated into experts\nwith differing perspectives and a central moderator, and have to\ncollaboratively exchange solutions until they achieve a reasonable consensus.\nWe demonstrate CellForge's capabilities in single-cell perturbation prediction,\nusing six diverse datasets that encompass gene knockouts, drug treatments, and\ncytokine stimulations across multiple modalities. CellForge consistently\noutperforms task-specific state-of-the-art methods. Overall, CellForge\ndemonstrates how iterative interaction between LLM agents with differing\nperspectives provides better solutions than directly addressing a modeling\nchallenge. Our code is publicly available at\nhttps://github.com/gersteinlab/CellForge."}
