{"id": "2510.22008", "pdf": "https://arxiv.org/pdf/2510.22008", "abs": "https://arxiv.org/abs/2510.22008", "authors": ["Md Saiful Islam Sajol", "Magesh Rajasekaran", "Hayden Gemeinhardt", "Adam Bess", "Chris Alvin", "Supratik Mukhopadhyay"], "title": "A Multimodal Human Protein Embeddings Database: DeepDrug Protein Embeddings Bank (DPEB)", "categories": ["cs.LG", "q-bio.MN"], "comment": null, "summary": "Computationally predicting protein-protein interactions (PPIs) is challenging\ndue to the lack of integrated, multimodal protein representations. DPEB is a\ncurated collection of 22,043 human proteins that integrates four embedding\ntypes: structural (AlphaFold2), transformer-based sequence (BioEmbeddings),\ncontextual amino acid patterns (ESM-2: Evolutionary Scale Modeling), and\nsequence-based n-gram statistics (ProtVec]). AlphaFold2 protein structures are\navailable through public databases (e.g., AlphaFold2 Protein Structure\nDatabase), but the internal neural network embeddings are not. DPEB addresses\nthis gap by providing AlphaFold2-derived embeddings for computational modeling.\nOur benchmark evaluations show GraphSAGE with BioEmbedding achieved the highest\nPPI prediction performance (87.37% AUROC, 79.16% accuracy). The framework also\nachieved 77.42% accuracy for enzyme classification and 86.04% accuracy for\nprotein family classification. DPEB supports multiple graph neural network\nmethods for PPI prediction, enabling applications in systems biology, drug\ntarget identification, pathway analysis, and disease mechanism studies."}
{"id": "2510.22167", "pdf": "https://arxiv.org/pdf/2510.22167", "abs": "https://arxiv.org/abs/2510.22167", "authors": ["Chengxuan Li", "August George", "Reece Neff", "Doo Nam Kim", "Trevor Moser", "Kate Baldwin", "Malio Nelson", "Arsam Firoozfar", "James E Evans", "Margaret S Cheung"], "title": "Graph Identification of Proteins in Tomograms (GRIP-Tomo) 2.0: Topologically Aware Classification for Proteins", "categories": ["q-bio.QM", "q-bio.MN"], "comment": null, "summary": "Cryo-electron tomography (cryo-ET) enables structural characterization of\nbiomolecules under near-native conditions. Existing approaches for interpreting\nthe resulting three-dimensional volumes are computationally expensive and have\ndifficulty interpreting density associated with small proteins/complexes. To\nexplore alternate approaches for identifying proteins in cryo-ET data we\npursued a Graph Network and topologically invariant approach. Here, we report\non a fast algorithm that distinguishes volumes containing protein density from\nnoise by searching for nuances of evolutionarily conversed motifs and the\ngeometrical characteristics of protein structure. GRIP-Tomo 2.0 is a\nmachine-learning pipeline that extracts interpretable topological features of\nprotein structures within noisy experimental backgrounds. Compared to version\n1.0, the new pipeline includes three upgrades that significantly improve\nperformance including synthetic tomogram generation simulating realistic noise,\ngraph-based persistent feature extraction as protein fingerprints, and\nhigh-performance computing acceleration. GRIP-Tomo 2.0 achieves over 90%\naccuracy in distinguishing proteins from noise for synthetic datasets and over\n80% accuracy for real datasets, which represents a foundational step toward\nadvancing cryo-ET workflows and empowering automated detection of both small\nand large proteins for visual proteomics."}
{"id": "2510.22130", "pdf": "https://arxiv.org/pdf/2510.22130", "abs": "https://arxiv.org/abs/2510.22130", "authors": ["Mushal Zia", "Faisal Suwayyid", "Yuta Hozumi", "JunJie Wee", "Hongsong Feng", "Guo-Wei Wei"], "title": "CAP: Commutative Algebra Prediction of Protein-Nucleic Acid Binding Affinities", "categories": ["q-bio.QM"], "comment": null, "summary": "An accurate prediction of protein-nucleic acid binding affinity is vital for\ndeciphering genomic processes, yet existing approaches often struggle in\nreconciling high accuracy with interpretability and computational efficiency.\nIn this study, we introduce commutative algebra prediction (CAP), which couples\npersistent Stanley-Reisner theory with advanced sequence embedding for\npredicting protein-nucleic acid binding affinities. CAP encodes proteins\nthrough transformer-learned embeddings that retain long-range evolutionary\ncontext and represents DNA and RNA with $\\textit{k}$-mer algebra embeddings\nderived from persistent facet ideals, which capture fine-scale nucleotide\ngeometry. We demonstrate that CAP surpasses the SVSBI protein-nucleic acid\nbenchmark and, in a further test, maintains reasonable performance on newly\ncurated protein-RNA and protein-nucleic acid datasets. Leveraging only primary\nsequences, CAP generalizes to any protein-nucleic acid pair with minimal\npreprocessing, enabling genome-scale analyses without 3D structural data and\npromising faster virtual screening for drug discovery and protein engineering."}
{"id": "2510.22167", "pdf": "https://arxiv.org/pdf/2510.22167", "abs": "https://arxiv.org/abs/2510.22167", "authors": ["Chengxuan Li", "August George", "Reece Neff", "Doo Nam Kim", "Trevor Moser", "Kate Baldwin", "Malio Nelson", "Arsam Firoozfar", "James E Evans", "Margaret S Cheung"], "title": "Graph Identification of Proteins in Tomograms (GRIP-Tomo) 2.0: Topologically Aware Classification for Proteins", "categories": ["q-bio.QM", "q-bio.MN"], "comment": null, "summary": "Cryo-electron tomography (cryo-ET) enables structural characterization of\nbiomolecules under near-native conditions. Existing approaches for interpreting\nthe resulting three-dimensional volumes are computationally expensive and have\ndifficulty interpreting density associated with small proteins/complexes. To\nexplore alternate approaches for identifying proteins in cryo-ET data we\npursued a Graph Network and topologically invariant approach. Here, we report\non a fast algorithm that distinguishes volumes containing protein density from\nnoise by searching for nuances of evolutionarily conversed motifs and the\ngeometrical characteristics of protein structure. GRIP-Tomo 2.0 is a\nmachine-learning pipeline that extracts interpretable topological features of\nprotein structures within noisy experimental backgrounds. Compared to version\n1.0, the new pipeline includes three upgrades that significantly improve\nperformance including synthetic tomogram generation simulating realistic noise,\ngraph-based persistent feature extraction as protein fingerprints, and\nhigh-performance computing acceleration. GRIP-Tomo 2.0 achieves over 90%\naccuracy in distinguishing proteins from noise for synthetic datasets and over\n80% accuracy for real datasets, which represents a foundational step toward\nadvancing cryo-ET workflows and empowering automated detection of both small\nand large proteins for visual proteomics."}
{"id": "2510.23108", "pdf": "https://arxiv.org/pdf/2510.23108", "abs": "https://arxiv.org/abs/2510.23108", "authors": ["Marlene J E Mayer", "Nicolas B Garnier", "Clara Becker", "Marta C Antonelli", "Silvia M Lobmaier", "Martin G Frasch"], "title": "Heart Rate Variability Patterns Reflect Yoga Intervention in Chronically Stressed Pregnant Women: A Quasi-Randomized Controlled Trial", "categories": ["q-bio.QM"], "comment": null, "summary": "Prenatal maternal stress (PS) is a risk factor for adverse offspring\nneurodevelopment. Heart rate variability (HRV) complexity provides a\nnon-invasive marker of maternal autonomic regulation and may be influenced by\nmind--body interventions such as Yoga. In this quasi-randomized controlled\ntrial, 28 chronically stressed pregnant women were followed from the second\ntrimester until birth: 14 participated in weekly Hatha Yoga with\nelectrocardiogram (ECG) recordings, and 14 received standard obstetric care\nwith monthly ECGs. Group allocation was based on availability, with\nparticipants unaware of their assignment at enrollment. HRV complexity was\nassessed first with Sample Entropy and Entropy Rate and then expanded to 94 HRV\nmetrics spanning temporal, frequency, nonlinear, and information-theoretical\ndomains. All metrics were covariate-adjusted (maternal age, BMI, gestational\nage), standardized, and analyzed using timepoint-specific principal component\nanalysis (PCA). From this, a unified HRV index was derived. Analyses revealed\nthat HRV metric relationships changed dynamically across pregnancy, with PCA\nloadings shifting from frequency toward complexity measures in late gestation.\nThe mixed effects model identified a significant time x group interaction\neffect (p = 0.041). These findings suggest a restructuring of HRV\nsignal-analytical domains with advancing pregnancy attributable to Yoga and\nhighlight the utility of advanced HRV analysis frameworks for future, larger\ntrials."}
{"id": "2510.21980", "pdf": "https://arxiv.org/pdf/2510.21980", "abs": "https://arxiv.org/abs/2510.21980", "authors": ["Starlika Bauskar", "Jade Jiao", "Narayanan Kannan", "Alexander Kimm", "Justin M. Baker", "Matthew J. Tyler", "Andrea L. Bertozzi", "Anne M. Andrews"], "title": "Boltzmann Graph Ensemble Embeddings for Aptamer Libraries", "categories": ["cs.LG", "math.PR", "q-bio.QM", "stat.ML"], "comment": null, "summary": "Machine-learning methods in biochemistry commonly represent molecules as\ngraphs of pairwise intermolecular interactions for property and structure\npredictions. Most methods operate on a single graph, typically the minimal free\nenergy (MFE) structure, for low-energy ensembles (conformations) representative\nof structures at thermodynamic equilibrium. We introduce a thermodynamically\nparameterized exponential-family random graph (ERGM) embedding that models\nmolecules as Boltzmann-weighted ensembles of interaction graphs. We evaluate\nthis embedding on SELEX datasets, where experimental biases (e.g., PCR\namplification or sequencing noise) can obscure true aptamer-ligand affinity,\nproducing anomalous candidates whose observed abundance diverges from their\nactual binding strength. We show that the proposed embedding enables robust\ncommunity detection and subgraph-level explanations for aptamer ligand\naffinity, even in the presence of biased observations. This approach may be\nused to identify low-abundance aptamer candidates for further experimental\nevaluation."}
{"id": "2510.22033", "pdf": "https://arxiv.org/pdf/2510.22033", "abs": "https://arxiv.org/abs/2510.22033", "authors": ["Tianxiang Wang", "Yingtong Ke", "Dhananjay Bhaskar", "Smita Krishnaswamy", "Alexander Cloninger"], "title": "Linearized Optimal Transport for Analysis of High-Dimensional Point-Cloud and Single-Cell Data", "categories": ["cs.LG", "q-bio.QM", "stat.ML", "68T05"], "comment": "11 pages, 5 figures", "summary": "Single-cell technologies generate high-dimensional point clouds of cells,\nenabling detailed characterization of complex patient states and treatment\nresponses. Yet each patient is represented by an irregular point cloud rather\nthan a simple vector, making it difficult to directly quantify and compare\nbiological differences between individuals. Nonlinear methods such as kernels\nand neural networks achieve predictive accuracy but act as black boxes,\noffering little biological interpretability.\n  To address these limitations, we adapt the Linear Optimal Transport (LOT)\nframework to this setting, embedding irregular point clouds into a\nfixed-dimensional Euclidean space while preserving distributional structure.\nThis embedding provides a principled linear representation that preserves\noptimal transport geometry while enabling downstream analysis. It also forms a\nregistration between any two patients, enabling direct comparison of their\ncellular distributions. Within this space, LOT enables: (i) \\textbf{accurate\nand interpretable classification} of COVID-19 patient states, where classifier\nweights map back to specific markers and spatial regions driving predictions;\nand (ii) \\textbf{synthetic data generation} for patient-derived organoids,\nexploiting the linearity of the LOT embedding. LOT barycenters yield averaged\ncellular profiles representing combined conditions or samples, supporting drug\ninteraction testing.\n  Together, these results establish LOT as a unified framework that bridges\npredictive performance, interpretability, and generative modeling. By\ntransforming heterogeneous point clouds into structured embeddings directly\ntraceable to the original data, LOT opens new opportunities for understanding\nimmune variation and treatment effects in high-dimensional biological systems."}
{"id": "2510.22239", "pdf": "https://arxiv.org/pdf/2510.22239", "abs": "https://arxiv.org/abs/2510.22239", "authors": ["Jahidul Arafat", "Sanjaya Poudel"], "title": "Synthetic-to-Real Transfer Learning for Chromatin-Sensitive PWS Microscopy", "categories": ["eess.IV", "cs.LG", "q-bio.QM", "68T45, 92C55", "I.4.6; I.2.10; I.5.4"], "comment": "24 pages, 5 figures and 4 tables", "summary": "Chromatin sensitive partial wave spectroscopic (csPWS) microscopy enables\nlabel free detection of nanoscale chromatin packing alterations that occur\nbefore visible cellular transformation. However, manual nuclear segmentation\nlimits population scale analysis needed for biomarker discovery in early cancer\ndetection. The lack of annotated csPWS imaging data prevents direct use of\nstandard deep learning methods. We present CFU Net, a hierarchical segmentation\narchitecture trained with a three stage curriculum on synthetic multimodal\ndata. CFU Net achieves near perfect performance on held out synthetic test data\nthat represent diverse spectroscopic imaging conditions without manual\nannotations (Dice 0.9879, IoU 0.9895). Our approach uses physics based\nrendering that incorporates empirically supported chromatin packing statistics,\nMie scattering models, and modality specific noise, combined with a curriculum\nthat progresses from adversarial RGB pretraining to spectroscopic fine tuning\nand histology validation. CFU Net integrates five architectural elements\n(ConvNeXt backbone, Feature Pyramid Network, UNet plus plus dense connections,\ndual attention, and deep supervision) that together improve Dice over a\nbaseline UNet by 8.3 percent. We demonstrate deployment ready INT8 quantization\nwith 74.9 percent compression and 0.15 second inference, giving a 240 times\nthroughput gain over manual analysis. Applied to more than ten thousand\nautomatically segmented nuclei from synthetic test data, the pipeline extracts\nchromatin biomarkers that distinguish normal from pre cancerous tissue with\nlarge effect sizes (Cohens d between 1.31 and 2.98), reaching 94 percent\nclassification accuracy. This work provides a general framework for synthetic\nto real transfer learning in specialized microscopy and open resources for\ncommunity validation on clinical specimens."}
{"id": "2510.22293", "pdf": "https://arxiv.org/pdf/2510.22293", "abs": "https://arxiv.org/abs/2510.22293", "authors": ["Mary E. An", "Paul Griffin", "Jonathan G. Stine", "Ramakrishna Balakrishnan", "Ram Sriram", "Soundar Kumara"], "title": "Predicting Metabolic Dysfunction-Associated Steatotic Liver Disease using Machine Learning Methods", "categories": ["cs.LG", "cs.CY", "q-bio.QM"], "comment": null, "summary": "Background: Metabolic Dysfunction-Associated Steatotic Liver Disease (MASLD)\naffects ~33% of U.S. adults and is the most common chronic liver disease.\nAlthough often asymptomatic, progression can lead to cirrhosis. Early detection\nis important, as lifestyle interventions can prevent disease progression. We\ndeveloped a fair, rigorous, and reproducible MASLD prediction model and\ncompared it to prior methods using a large electronic health record database.\n  Methods: We evaluated LASSO logistic regression, random forest, XGBoost, and\na neural network for MASLD prediction using clinical feature subsets, including\nthe top 10 SHAP-ranked features. To reduce disparities in true positive rates\nacross racial and ethnic subgroups, we applied an equal opportunity\npostprocessing method.\n  Results: This study included 59,492 patients in the training data, 24,198 in\nthe validating data, and 25,188 in the testing data. The LASSO logistic\nregression model with the top 10 features was selected for its interpretability\nand comparable performance. Before fairness adjustment, the model achieved\nAUROC of 0.84, accuracy of 78%, sensitivity of 72%, specificity of 79%, and\nF1-score of 0.617. After equal opportunity postprocessing, accuracy modestly\nincreased to 81% and specificity to 94%, while sensitivity decreased to 41% and\nF1-score to 0.515, reflecting the fairness trade-off.\n  Conclusions: We developed the MASER prediction model (MASLD Static EHR Risk\nPrediction), a LASSO logistic regression model which achieved competitive\nperformance for MASLD prediction (AUROC 0.836, accuracy 77.6%), comparable to\npreviously reported ensemble and tree-based models. Overall, this approach\ndemonstrates that interpretable models can achieve a balance of predictive\nperformance and fairness in diverse patient populations."}
{"id": "2510.22364", "pdf": "https://arxiv.org/pdf/2510.22364", "abs": "https://arxiv.org/abs/2510.22364", "authors": ["Samir Damji", "Simrut Kurry", "Shazia'Ayn Babul", "Joydeep Bhattacharya", "Naznin Virji-Babul"], "title": "Tuned for Creativity? Graph-Theoretical Mapping of Resting-State EEG Reveals Neural Signatures of Creativity", "categories": ["q-bio.NC", "eess.SP", "q-bio.QM"], "comment": "27 pages, 6 figures, 2 tables", "summary": "Understanding how creativity is represented in the brain's intrinsic\nfunctional architecture remains a central challenge in cognitive neuroscience.\nWhile resting-state fMRI studies have revealed large-scale network correlates\nof creative potential, electroencephalography (EEG) offers a temporally precise\nand scalable approach to capture the fast oscillatory dynamics that underlie\nspontaneous neural organization. In this study, we used a data-driven network\napproach to examine whether resting-state EEG connectivity patterns\ndifferentiate individuals according to their creative abilities. Creativity was\nevaluated by: The Inventory of Creative Activities and Achievements (ICAA), The\nDivergent Association Task (DAT), The Matchstick Arithmetic Puzzles Task (MAPT)\nand Self-rating (SR) of creative ability in 30 healthy young adults.\nGraph-theoretical analyses were applied to functional connectivity matrices and\nclustered based on graph similarity. Two distinct participant clusters emerged,\ndiffering systematically across multiple dimensions of creativity. Cluster 1,\ncharacterized by consistently higher performance across multiple creativity\nvariables (ICAA, DAT, MAPT and SR), showed broad alpha-band hypoconnectivity,\nrelatively preserved left frontal connectivity and greater network modularity.\nCluster 0, associated with lower creativity scores, exhibited stronger overall\nconnectivity strength, reduced modularity and higher local clustering. These\nfindings suggest that resting-state EEG connectivity patterns can index stable\ncognitive traits such as creativity. More broadly, they point to an intrinsic\nneural signature of adaptive brain function marked by efficient yet flexible\nnetwork organization that may support creative and adaptive cognition."}
{"id": "2510.23273", "pdf": "https://arxiv.org/pdf/2510.23273", "abs": "https://arxiv.org/abs/2510.23273", "authors": ["Runjie Zheng", "Zhen Wang", "Anjie Qiao", "Jiancong Xie", "Jiahua Rao", "Yuedong Yang"], "title": "A Novel Framework for Multi-Modal Protein Representation Learning", "categories": ["cs.LG", "cs.AI", "q-bio.QM"], "comment": "35 pages, 5 figures, 4 tables", "summary": "Accurate protein function prediction requires integrating heterogeneous\nintrinsic signals (e.g., sequence and structure) with noisy extrinsic contexts\n(e.g., protein-protein interactions and GO term annotations). However, two key\nchallenges hinder effective fusion: (i) cross-modal distributional mismatch\namong embeddings produced by pre-trained intrinsic encoders, and (ii) noisy\nrelational graphs of extrinsic data that degrade GNN-based information\naggregation. We propose Diffused and Aligned Multi-modal Protein Embedding\n(DAMPE), a unified framework that addresses these through two core mechanisms.\nFirst, we propose Optimal Transport (OT)-based representation alignment that\nestablishes correspondence between intrinsic embedding spaces of different\nmodalities, effectively mitigating cross-modal heterogeneity. Second, we\ndevelop a Conditional Graph Generation (CGG)-based information fusion method,\nwhere a condition encoder fuses the aligned intrinsic embeddings to provide\ninformative cues for graph reconstruction. Meanwhile, our theoretical analysis\nimplies that the CGG objective drives this condition encoder to absorb\ngraph-aware knowledge into its produced protein representations. Empirically,\nDAMPE outperforms or matches state-of-the-art methods such as DPFunc on\nstandard GO benchmarks, achieving AUPR gains of 0.002-0.013 pp and Fmax gains\n0.004-0.007 pp. Ablation studies further show that OT-based alignment\ncontributes 0.043-0.064 pp AUPR, while CGG-based fusion adds 0.005-0.111 pp\nFmax. Overall, DAMPE offers a scalable and theoretically grounded approach for\nrobust multi-modal protein representation learning, substantially enhancing\nprotein function prediction."}
