{"id": "2510.09186", "pdf": "https://arxiv.org/pdf/2510.09186", "abs": "https://arxiv.org/abs/2510.09186", "authors": ["T. H. A. van der Reep", "W. Löffler"], "title": "Alignment conditions of the human eye for few-photon vision experiments", "categories": ["physics.optics", "q-bio.QM"], "comment": "8 pages, 5 figures", "summary": "In experiments probing human vision at the few-photon level, precise\nalignment of the eye is necessary such that stimuli reach the highest-density\nrod region of the retina. However, in literature there seems to be no consensus\non the optimal eye alignment for such experiments. Typically, experiments are\nperformed by presenting stimuli nasally or temporally, but the angle under\nwhich the few-photon pulses are presented varies between 7 deg and 23 deg. Here\nwe combine a $3$-dimensional eye model with retinal rod density measurements\nfrom literature in a ray tracing simulation to study the optimal eye alignment\nconditions and necessary alignment precision. We find that stimuli, directed at\nthe eye's nodal point, may be best presented under an inferior angle of 13.1\ndeg with respect to the visual axis. Defining a target area on the retina with\na radius of 0.5 mm around the optimum location, we find the horizontal and\nvertical angular precision should be better than 0.85 deg given a horizontal\nand vertical translational precision of 1 mm and a depth translational\nprecision of 5 mm."}
{"id": "2510.09554", "pdf": "https://arxiv.org/pdf/2510.09554", "abs": "https://arxiv.org/abs/2510.09554", "authors": ["Thomas C. Smits", "Nikolay Akhmetov", "Tiffany S. Liaw", "Mark S. Keller", "Eric Mörth", "Nils Gehlenborg"], "title": "scellop: A Scalable Redesign of Cell Population Plots for Single-Cell Data", "categories": ["cs.HC", "q-bio.QM"], "comment": "8 pages, 1 figure, supplemental (2 pages, 1 figure) at the end", "summary": "Summary: Cell population plots are visualizations showing cell population\ndistributions in biological samples with single-cell data, traditionally shown\nwith stacked bar charts. Here, we address issues with this approach,\nparticularly its limited scalability with increasing number of cell types and\nsamples, and present scellop, a novel interactive cell population viewer\ncombining visual encodings optimized for common user tasks in studying\npopulations of cells across samples or conditions.\n  Availability and Implementation: Scellop is available under the MIT licence\nat https://github.com/hms-dbmi/scellop, and is available on PyPI\n(https://pypi.org/project/cellpop/) and NPM\n(https://www.npmjs.com/package/cellpop). A demo is available at\nhttps://scellop.netlify.app/."}
