{"id": "2507.17775", "pdf": "https://arxiv.org/pdf/2507.17775", "abs": "https://arxiv.org/abs/2507.17775", "authors": ["Alexander D. Kalian", "Lennart Otte", "Jaewook Lee", "Emilio Benfenati", "Jean-Lou C. M. Dorne", "Claire Potter", "Olivia J. Osborne", "Miao Guo", "Christer Hogstrand"], "title": "Comparison of Optimised Geometric Deep Learning Architectures, over Varying Toxicological Assay Data Environments", "categories": ["q-bio.QM", "cs.AI", "cs.LG"], "comment": null, "summary": "Geometric deep learning is an emerging technique in Artificial Intelligence\n(AI) driven cheminformatics, however the unique implications of different Graph\nNeural Network (GNN) architectures are poorly explored, for this space. This\nstudy compared performances of Graph Convolutional Networks (GCNs), Graph\nAttention Networks (GATs) and Graph Isomorphism Networks (GINs), applied to 7\ndifferent toxicological assay datasets of varying data abundance and endpoint,\nto perform binary classification of assay activation. Following pre-processing\nof molecular graphs, enforcement of class-balance and stratification of all\ndatasets across 5 folds, Bayesian optimisations were carried out, for each GNN\napplied to each assay dataset (resulting in 21 unique Bayesian optimisations).\nOptimised GNNs performed at Area Under the Curve (AUC) scores ranging from\n0.728-0.849 (averaged across all folds), naturally varying between specific\nassays and GNNs. GINs were found to consistently outperform GCNs and GATs, for\nthe top 5 of 7 most data-abundant toxicological assays. GATs however\nsignificantly outperformed over the remaining 2 most data-scarce assays. This\nindicates that GINs are a more optimal architecture for data-abundant\nenvironments, whereas GATs are a more optimal architecture for data-scarce\nenvironments. Subsequent analysis of the explored higher-dimensional\nhyperparameter spaces, as well as optimised hyperparameter states, found that\nGCNs and GATs reached measurably closer optimised states with each other,\ncompared to GINs, further indicating the unique nature of GINs as a GNN\nalgorithm."}
{"id": "2507.17779", "pdf": "https://arxiv.org/pdf/2507.17779", "abs": "https://arxiv.org/abs/2507.17779", "authors": ["Camille Challier", "Xiaowu Sun", "Thabo Mahendiran", "Ortal Senouf", "Bernard De Bruyne", "Denise Auberson", "Olivier Müller", "Stephane Fournier", "Pascal Frossard", "Emmanuel Abbé", "Dorina Thanou"], "title": "CM-UNet: A Self-Supervised Learning-Based Model for Coronary Artery Segmentation in X-Ray Angiography", "categories": ["q-bio.QM", "cs.LG", "I.2; I.4; I.5; J.3"], "comment": "IEEE EMBC 2025, 7 pages, 6 figures", "summary": "Accurate segmentation of coronary arteries remains a significant challenge in\nclinical practice, hindering the ability to effectively diagnose and manage\ncoronary artery disease. The lack of large, annotated datasets for model\ntraining exacerbates this issue, limiting the development of automated tools\nthat could assist radiologists. To address this, we introduce CM-UNet, which\nleverages self-supervised pre-training on unannotated datasets and transfer\nlearning on limited annotated data, enabling accurate disease detection while\nminimizing the need for extensive manual annotations. Fine-tuning CM-UNet with\nonly 18 annotated images instead of 500 resulted in a 15.2% decrease in Dice\nscore, compared to a 46.5% drop in baseline models without pre-training. This\ndemonstrates that self-supervised learning can enhance segmentation performance\nand reduce dependence on large datasets. This is one of the first studies to\nhighlight the importance of self-supervised learning in improving coronary\nartery segmentation from X-ray angiography, with potential implications for\nadvancing diagnostic accuracy in clinical practice. By enhancing segmentation\naccuracy in X-ray angiography images, the proposed approach aims to improve\nclinical workflows, reduce radiologists' workload, and accelerate disease\ndetection, ultimately contributing to better patient outcomes. The source code\nis publicly available at\nhttps://github.com/CamilleChallier/Contrastive-Masked-UNet."}
{"id": "2507.17783", "pdf": "https://arxiv.org/pdf/2507.17783", "abs": "https://arxiv.org/abs/2507.17783", "authors": ["Charles Tapley Hoyt"], "title": "Improving reproducibility of cheminformatics workflows with chembl-downloader", "categories": ["q-bio.QM"], "comment": null, "summary": "Many modern cheminformatics workflows derive datasets from ChEMBL, but few of\nthese datasets are published with accompanying code for their generation.\nConsequently, their methodologies (e.g., selection, filtering, aggregation) are\nopaque, reproduction is difficult, and interpretation of results therefore\nlacks important context. Further, such static datasets quickly become\nout-of-date. For example, the current version of ChEMBL is v35 (as of December\n2024), but ExCAPE-DB uses v20, Deep Confidence uses v23, the consensus dataset\nfrom Isigkeit _et al._ (2022) uses v28, and Papyrus uses v30. Therefore, there\nis a need for tools that provide reproducible bulk access to the latest (or a\ngiven) version of ChEMBL in order to enable researchers to make their derived\ndatasets more transparent, updatable, and trustworthy. This article introduces\n`chembl-downloader`, a Python package for the reproducible acquisition, access,\nand manipulation of ChEMBL data through its FTP server. It can be downloaded\nunder the MIT license from https://github.com/cthoyt/chembl-downloader and\ninstalled from PyPI with `pip install chembl-downloader.`"}
{"id": "2507.18557", "pdf": "https://arxiv.org/pdf/2507.18557", "abs": "https://arxiv.org/abs/2507.18557", "authors": ["Zihan Yang", "Haipeng Gong"], "title": "Deep Learning for Blood-Brain Barrier Permeability Prediction", "categories": ["q-bio.QM"], "comment": null, "summary": "Predicting whether a molecule can cross the blood-brain barrier (BBB) is a\nkey step in early-stage neuropharmaceutical development, directly influencing\nboth research efficiency and success rates in drug discovery. Traditional\nempirical methods based on physicochemical properties are prone to systematic\nmisjudgements due to their reliance on static rules. Early machine learning\nmodels, although data-driven, often suffer from limited capacity, poor\ngeneralization, and insufficient interpretability. In recent years, artificial\nintelligence (AI) methods have become essential tools for predicting BBB\npermeability and guiding related drug design, owing to their ability to model\nmolecular structures and capture complex biological mechanisms. This article\nsystematically reviews the evolution of this field-from deep neural networks to\ngraph-based structural modeling-highlighting the advantages of multi-task and\nmultimodal learning strategies in identifying mechanism-relevant variables. We\nfurther explore the emerging potential of generative models and causal\ninference methods for integrating permeability prediction with mechanism-aware\ndrug design. BBB modeling is in the transition from static classification\ntoward mechanistic perception and structure-function modeling. This paradigm\nshift provides a methodological foundation and future roadmap for the\nintegration of AI into neuropharmacological development."}
{"id": "2507.17845", "pdf": "https://arxiv.org/pdf/2507.17845", "abs": "https://arxiv.org/abs/2507.17845", "authors": ["Jonah Kömen", "Edwin D. de Jong", "Julius Hense", "Hannah Marienwald", "Jonas Dippel", "Philip Naumann", "Eric Marcus", "Lukas Ruff", "Maximilian Alber", "Jonas Teuwen", "Frederick Klauschen", "Klaus-Robert Müller"], "title": "Towards Robust Foundation Models for Digital Pathology", "categories": ["eess.IV", "cs.AI", "cs.CV", "cs.LG", "q-bio.QM"], "comment": null, "summary": "Biomedical Foundation Models (FMs) are rapidly transforming AI-enabled\nhealthcare research and entering clinical validation. However, their\nsusceptibility to learning non-biological technical features -- including\nvariations in surgical/endoscopic techniques, laboratory procedures, and\nscanner hardware -- poses risks for clinical deployment. We present the first\nsystematic investigation of pathology FM robustness to non-biological features.\nOur work (i) introduces measures to quantify FM robustness, (ii) demonstrates\nthe consequences of limited robustness, and (iii) proposes a framework for FM\nrobustification to mitigate these issues. Specifically, we developed PathoROB,\na robustness benchmark with three novel metrics, including the robustness\nindex, and four datasets covering 28 biological classes from 34 medical\ncenters. Our experiments reveal robustness deficits across all 20 evaluated\nFMs, and substantial robustness differences between them. We found that\nnon-robust FM representations can cause major diagnostic downstream errors and\nclinical blunders that prevent safe clinical adoption. Using more robust FMs\nand post-hoc robustification considerably reduced (but did not yet eliminate)\nthe risk of such errors. This work establishes that robustness evaluation is\nessential for validating pathology FMs before clinical adoption and\ndemonstrates that future FM development must integrate robustness as a core\ndesign principle. PathoROB provides a blueprint for assessing robustness across\nbiomedical domains, guiding FM improvement efforts towards more robust,\nrepresentative, and clinically deployable AI systems that prioritize biological\ninformation over technical artifacts."}
{"id": "2507.17940", "pdf": "https://arxiv.org/pdf/2507.17940", "abs": "https://arxiv.org/abs/2507.17940", "authors": ["Timothy Wilson", "Owen J. L. Rackham", "Hendrik Ulbricht"], "title": "Oligonucleotide selective detection by levitated optomechanics", "categories": ["physics.optics", "q-bio.QM", "quant-ph"], "comment": "13 pages, 8 figures, comments welcome", "summary": "Here we examine the detection of oligonucleotide-specific signals in\nsensitive optomechanical experiments. Silica nanoparticles (SiNPs) were\nfunctionalized using ZnCl$_2$ and 25-mers of single-stranded deoxyadenosine and\ndeoxythymidine monophosphate which were optically trapped by a 1550 nm\nwavelength laser in vacuum. In the optical trap, SiNPs behave as harmonic\noscillators, and their oscillation frequency and amplitude can be precisely\ndetected by optical interferometry. The data was compared across particle\ntypes, revealing differences in frequency, width and amplitude of peaks with\nrespect to motion of the SiNPs which can be explained by a theoretical model.\nData obtained from this platform was analyzed by fitting Lorentzian curves to\nthe spectra. Linear discriminant analysis detected differences between the\nfunctionalized and non-functionalized SiNPs. Random forest modeling provided\nfurther evidence that the fitted data were different between the groups.\nTransmission electron microscopy was carried out, but did not reveal any visual\ndifferences between the particle types"}
