{"id": "2510.19867", "pdf": "https://arxiv.org/pdf/2510.19867", "abs": "https://arxiv.org/abs/2510.19867", "authors": ["Md Ashad Alam", "Md Amanullah"], "title": "Artificial Intelligence Powered Identification of Potential Antidiabetic Compounds in Ficus religiosa", "categories": ["q-bio.QM", "cs.LG"], "comment": "25 Pages, 3 figures, 3 tables", "summary": "Diabetes mellitus is a chronic metabolic disorder that necessitates novel\ntherapeutic innovations due to its gradual progression and the onset of various\nmetabolic complications. Research indicates that Ficus religiosa is a\nconventional medicinal plant that generates bioactive phytochemicals with\npotential antidiabetic properties. The investigation employs ecosystem-based\ncomputational approaches utilizing artificial intelligence to investigate and\nevaluate compounds derived from Ficus religiosa that exhibit antidiabetic\nproperties. A comprehensive computational procedure incorporated machine\nlearning methodologies, molecular docking techniques, and ADMET prediction\nsystems to assess phytochemical efficacy against the significant antidiabetic\nenzyme dipeptidyl peptidase-4 (DPP-4). DeepBindGCN and the AutoDock software\nfacilitated the investigation of binding interactions via deep learning\ntechnology. Flavonoids and alkaloids have emerged as attractive phytochemicals\ndue to their strong binding interactions and advantageous pharmacological\neffects, as indicated by the study. The introduction of AI accelerated\nscreening procedures and enhanced accuracy rates, demonstrating its efficacy in\nresearching plant-based antidiabetic agents. The scientific foundation now\nfacilitates future experimental validation of natural product therapies\ntailored for diabetic management."}
{"id": "2510.19870", "pdf": "https://arxiv.org/pdf/2510.19870", "abs": "https://arxiv.org/abs/2510.19870", "authors": ["Md Selim Reza", "Sabrin Afroz", "Mostafizer Rahman", "Md Ashad Alam"], "title": "Transforming Multi-Omics Integration with GANs: Applications in Alzheimer's and Cancer", "categories": ["q-bio.QM", "cs.LG", "stat.ML"], "comment": "24 Pages, 6 figues", "summary": "Multi-omics data integration is crucial for understanding complex diseases,\nyet limited sample sizes, noise, and heterogeneity often reduce predictive\npower. To address these challenges, we introduce Omics-GAN, a Generative\nAdversarial Network (GAN)-based framework designed to generate high-quality\nsynthetic multi-omics profiles while preserving biological relationships. We\nevaluated Omics-GAN on three omics types (mRNA, miRNA, and DNA methylation)\nusing the ROSMAP cohort for Alzheimer's disease (AD) and TCGA datasets for\ncolon and liver cancer. A support vector machine (SVM) classifier with repeated\n5-fold cross-validation demonstrated that synthetic datasets consistently\nimproved prediction accuracy compared to original omics profiles. The AUC of\nSVM for mRNA improved from 0.72 to 0.74 in AD, and from 0.68 to 0.72 in liver\ncancer. Synthetic miRNA enhanced classification in colon cancer from 0.59 to\n0.69, while synthetic methylation data improved performance in liver cancer\nfrom 0.64 to 0.71. Boxplot analyses confirmed that synthetic data preserved\nstatistical distributions while reducing noise and outliers. Feature selection\nidentified significant genes overlapping with original datasets and revealed\nadditional candidates validated by GO and KEGG enrichment analyses. Finally,\nmolecular docking highlighted potential drug repurposing candidates, including\nNilotinib for AD, Atovaquone for liver cancer, and Tecovirimat for colon\ncancer. Omics-GAN enhances disease prediction, preserves biological fidelity,\nand accelerates biomarker and drug discovery, offering a scalable strategy for\nprecision medicine applications."}
{"id": "2510.19874", "pdf": "https://arxiv.org/pdf/2510.19874", "abs": "https://arxiv.org/abs/2510.19874", "authors": ["Abbi Abdel-Rehim", "Emma Tate", "Larisa N. Soldatova", "Ross D. King"], "title": "Advancing Drug Development Through Strategic Cell Line and Compound Selection Using Drug Response Profiles", "categories": ["q-bio.QM"], "comment": "17 pages, 4 tables, 3 figures", "summary": "Early identification of sensitive cancer cell lines is essential for\naccelerating biomarker discovery and elucidating drug mechanism of action.\nGiven the efficiency and low cost of small-scale drug screens relative to\nextensive omics profiling, we compared drug-response panel (DRP) descriptors\nagainst omics features for predictive capacity using gradient boosting tree\nmodels across the GDSC and CCLE drug response datasets. DRP descriptors\nconsistently outperformed omics data across key performance metrics, with\nvariable performance across different drugs. Using complementary explainability\napproaches, we confirmed known MAPK-inhibitor sensitivity signatures, and\nidentified novel potential biomarker candidates for MEK1/2 and BTK/MNK\ninhibitors. Lastly, to demonstrate the utility of this approach in\ndistinguishing phenotypes, we applied our models to the breast cancer line MCF7\nversus the non-tumorigenic MCF10A, and successfully identified compounds that\nselectively inhibit MCF7 while sparing the non-tumorigenic MCF10A. This\nmethodology, developed using focused drug and cell line panels, supports\nearly-stage drug development by facilitating rational cell line selection and\ncompound prioritisation, enabling more efficient biomarker identification and\ncandidate assessment."}
{"id": "2510.19887", "pdf": "https://arxiv.org/pdf/2510.19887", "abs": "https://arxiv.org/abs/2510.19887", "authors": ["Télio Cropsal", "Rocío Mercado"], "title": "Compressing Biology: Evaluating the Stable Diffusion VAE for Phenotypic Drug Discovery", "categories": ["q-bio.QM", "cs.LG"], "comment": "Accepted to the 3rd Workshop on Imageomics: Discovering Biological\n  Knowledge from Images Using AI at the 39th Conference on Neural Information\n  Processing Systems (NeurIPS 2025)", "summary": "High-throughput phenotypic screens generate vast microscopy image datasets\nthat push the limits of generative models due to their large dimensionality.\nDespite the growing popularity of general-purpose models trained on natural\nimages for microscopy data analysis, their suitability in this domain has not\nbeen quantitatively demonstrated. We present the first systematic evaluation of\nStable Diffusion's variational autoencoder (SD-VAE) for reconstructing Cell\nPainting images, assessing performance across a large dataset with diverse\nmolecular perturbations and cell types. We find that SD-VAE reconstructions\npreserve phenotypic signals with minimal loss, supporting its use in microscopy\nworkflows. To benchmark reconstruction quality, we compare pixel-level,\nembedding-based, latent-space, and retrieval-based metrics for a biologically\ninformed evaluation. We show that general-purpose feature extractors like\nInceptionV3 match or surpass publicly available bespoke models in retrieval\ntasks, simplifying future pipelines. Our findings offer practical guidelines\nfor evaluating generative models on microscopy data and support the use of\noff-the-shelf models in phenotypic drug discovery."}
{"id": "2510.19948", "pdf": "https://arxiv.org/pdf/2510.19948", "abs": "https://arxiv.org/abs/2510.19948", "authors": ["Austin Polanco", "M. E. J. Newman"], "title": "Drug-disease networks and drug repurposing", "categories": ["q-bio.QM", "cs.SI"], "comment": "30 pages, 4 figures, 5 tables", "summary": "Repurposing existing drugs to treat new diseases is a cost-effective\nalternative to de novo drug development, but there are millions of potential\ndrug-disease combinations to be considered with only a small fraction being\nviable. In silico predictions of drug-disease associations can be invaluable\nfor reducing the size of the search space. In this work we present a novel\nnetwork of drugs and the diseases they treat, compiled using a combination of\nexisting textual and machine-readable databases, natural-language processing\ntools, and hand curation, and analyze it using network-based link prediction\nmethods to identify potential drug-disease combinations. We measure the\nefficacy of these methods using cross-validation tests and find that several\nmethods, particularly those based on graph embedding and network model fitting,\nachieve impressive prediction performance, significantly better than previous\napproaches, with area under the ROC curve above 0.95 and average precision\nalmost a thousand times better than chance."}
{"id": "2510.20788", "pdf": "https://arxiv.org/pdf/2510.20788", "abs": "https://arxiv.org/abs/2510.20788", "authors": ["Nicole Hayes", "Ekaterina Merkurjev", "Guo-Wei Wei"], "title": "Predicting Protein-Nucleic Acid Flexibility Using Persistent Sheaf Laplacians", "categories": ["q-bio.BM", "q-bio.QM"], "comment": null, "summary": "Understanding the flexibility of protein-nucleic acid complexes, often\ncharacterized by atomic B-factors, is essential for elucidating their\nstructure, dynamics, and functions, such as reactivity and allosteric pathways.\nTraditional models such as Gaussian Network Models (GNM) and Elastic Network\nModels (ENM) often fall short in capturing multiscale interactions, especially\nin large or complex biomolecular systems. In this work, we apply the Persistent\nSheaf Laplacian (PSL) framework for the B-factor prediction of protein-nucleic\nacid complexes. The PSL model integrates multiscale analysis, algebraic\ntopology, combinatoric Laplacians, and sheaf theory for data representation. It\nreveals topological invariants in its harmonic spectra and captures the\nhomotopic shape evolution of data with its non-harmonic spectra. Its\nlocalization enables accurate B-factor predictions. We benchmark our method on\nthree diverse datasets, including protein-RNA and nucleic-acid-only structures,\nand demonstrate that PSL consistently outperforms existing models such as GNM\nand multiscale FRI (mFRI), achieving up to a 21% improvement in Pearson\ncorrelation coefficient for B-factor prediction. These results highlight the\nrobustness and adaptability of PSL in modeling complex biomolecular\ninteractions and suggest its potential utility in broader applications such as\nmutation impact analysis and drug design."}
