{"id": "2510.18929", "pdf": "https://arxiv.org/pdf/2510.18929", "abs": "https://arxiv.org/abs/2510.18929", "authors": ["Marta Contreiras Silva", "Daniel Faria", "Laura Balbi", "Susana Nunes", "Ana Filipa Rodrigues", "Aleksander Palkowski", "Michal Waleron", "Emilia Daghir-Wojtkowiak", "Ashwin Adrian Kallor", "Christophe Battail", "Federico Maria Corazza", "Manuel Fiorelli", "Armando Stellato", "Javier Antonio Alfaro", "Fabio Massimo Zanzotto", "Catia Pesquita"], "title": "ECKO: Explainable Clinical Knowledge for Oncology", "categories": ["q-bio.QM"], "comment": "18 pages, 9 figures", "summary": "Personalized oncology aims to tailor treatment strategies to the unique\nmolecular and clinical profiles of individual patients, moving beyond the\ntraditional paradigm of treating the disease not the patient. Achieving this\nvision requires the integration and interpretation of vast, heterogeneous\nbiomedical data within a meaningful scientific framework. Knowledge graphs,\nstructured according to biomedical ontologies, offer a powerful approach to\ncontextualize and interconnect diverse datasets, enabling more precise and\ninformed clinical decision-making.\n  We present ECKO (Explainable Clinical Knowledge for Oncology), a\ncomprehensive knowledge graph that integrates 33 biomedical ontologies and\naggregates data from multiple studies to create a unified resource optimized\nfor data-driven clinical applications in oncology. Designed to support\npersonalized drug recommendations, ECKO facilitates the identification of\noptimal therapeutic options by linking patient-specific molecular data to\nrelevant pharmacological knowledge. It provides transparent, interpretable\nexplanations for drug recommendations, fostering greater trust and\nunderstanding among clinicians and researchers. This resource represents a\nsignificant advancement toward explainable, scalable, and clinically actionable\npersonalized medicine in oncology, with potential applications in biomarker\ndiscovery, treatment optimization, and translational research."}
{"id": "2510.19499", "pdf": "https://arxiv.org/pdf/2510.19499", "abs": "https://arxiv.org/abs/2510.19499", "authors": ["Mark S. Keller", "Nicholas Lucarelli", "Yijiang Chen", "Samuel Border", "Andrew Janowczyk", "Jonathan Himmelfarb", "Matthias Kretzler", "Jeffrey Hodgin", "Laura Barisoni", "Dawit Demeke", "Leal Herlitz", "Gilbert Moeckel", "Avi Z. Rosenberg", "Yanli Ding", "Pinaki Sarder", "Nils Gehlenborg"], "title": "Interactive visualization of kidney micro-compartmental segmentations and associated pathomics on whole slide images", "categories": ["q-bio.QM", "cs.HC"], "comment": null, "summary": "Application of machine learning techniques enables segmentation of functional\ntissue units in histology whole-slide images (WSIs). We built a pipeline to\napply previously validated segmentation models of kidney structures and extract\nquantitative features from these structures. Such quantitative analysis also\nrequires qualitative inspection of results for quality control, exploration,\nand communication. We extend the Vitessce web-based visualization tool to\nenable visualization of segmentations of multiple types of functional tissue\nunits, such as, glomeruli, tubules, arteries/arterioles in the kidney.\nMoreover, we propose a standard representation for files containing multiple\nsegmentation bitmasks, which we define polymorphically, such that existing\nformats including OME-TIFF, OME-NGFF, AnnData, MuData, and SpatialData can be\nused. We demonstrate that these methods enable researchers and the broader\npublic to interactively explore datasets containing multiple segmented entities\nand associated features, including for exploration of renal morphometry of\nbiopsies from the Kidney Precision Medicine Project (KPMP) and the Human\nBiomolecular Atlas Program (HuBMAP)."}
{"id": "2510.19090", "pdf": "https://arxiv.org/pdf/2510.19090", "abs": "https://arxiv.org/abs/2510.19090", "authors": ["Ming Han", "John Devany", "Michel Fruchart", "Margaret L. Gardel", "Vincenzo Vitelli"], "title": "Learning noisy tissue dynamics across time scales", "categories": ["cond-mat.soft", "cs.LG", "physics.bio-ph", "q-bio.QM"], "comment": "15 pages, 6 figures", "summary": "Tissue dynamics play a crucial role in biological processes ranging from\nwound healing to morphogenesis. However, these noisy multicellular dynamics are\nnotoriously hard to predict. Here, we introduce a biomimetic machine learning\nframework capable of inferring noisy multicellular dynamics directly from\nexperimental movies. This generative model combines graph neural networks,\nnormalizing flows and WaveNet algorithms to represent tissues as neural\nstochastic differential equations where cells are edges of an evolving graph.\nThis machine learning architecture reflects the architecture of the underlying\nbiological tissues, substantially reducing the amount of data needed to train\nit compared to convolutional or fully-connected neural networks. Taking\nepithelial tissue experiments as a case study, we show that our model not only\ncaptures stochastic cell motion but also predicts the evolution of cell states\nin their division cycle. Finally, we demonstrate that our method can accurately\ngenerate the experimental dynamics of developmental systems, such as the fly\nwing, and cell signaling processes mediated by stochastic ERK waves, paving the\nway for its use as a digital twin in bioengineering and clinical contexts."}
{"id": "2510.19455", "pdf": "https://arxiv.org/pdf/2510.19455", "abs": "https://arxiv.org/abs/2510.19455", "authors": ["Banan Alnemri", "Arwa Basbrain"], "title": "Automated Morphological Analysis of Neurons in Fluorescence Microscopy Using YOLOv8", "categories": ["eess.IV", "cs.CV", "q-bio.QM"], "comment": "7 pages, 2 figures and 2 tables", "summary": "Accurate segmentation and precise morphological analysis of neuronal cells in\nfluorescence microscopy images are crucial steps in neuroscience and biomedical\nimaging applications. However, this process is labor-intensive and\ntime-consuming, requiring significant manual effort and expertise to ensure\nreliable outcomes. This work presents a pipeline for neuron instance\nsegmentation and measurement based on a high-resolution dataset of\nstem-cell-derived neurons. The proposed method uses YOLOv8, trained on manually\nannotated microscopy images. The model achieved high segmentation accuracy,\nexceeding 97%. In addition, the pipeline utilized both ground truth and\npredicted masks to extract biologically significant features, including cell\nlength, width, area, and grayscale intensity values. The overall accuracy of\nthe extracted morphological measurements reached 75.32%, further supporting the\neffectiveness of the proposed approach. This integrated framework offers a\nvaluable tool for automated analysis in cell imaging and neuroscience research,\nreducing the need for manual annotation and enabling scalable, precise\nquantification of neuron morphology."}
{"id": "2510.19532", "pdf": "https://arxiv.org/pdf/2510.19532", "abs": "https://arxiv.org/abs/2510.19532", "authors": ["Selena Luo", "Mark S. Keller", "Tabassum Kakar", "Lisa Choy", "Nils Gehlenborg"], "title": "EasyVitessce: auto-magically adding interactivity to Scverse single-cell and spatial biology plots", "categories": ["cs.HC", "q-bio.QM"], "comment": null, "summary": "EasyVitessce is a Python package that turns existing static Scanpy and\nSpatialData plots into interactive visualizations by virtue of adding a single\nline of Python code. The package uses Vitessce internally to render interactive\nplots, and abstracts away technical details involved with configuration of\nVitessce. The resulting interactive plots can be viewed in computational\nnotebook environments or their configurations can be exported for usage in\nother contexts such as web applications, enhancing the utility of popular\nScverse Python plotting APIs. EasyVitessce is released under the MIT License\nand available on the Python Package Index (PyPI). The source code is publicly\navailable on GitHub."}
{"id": "2510.19749", "pdf": "https://arxiv.org/pdf/2510.19749", "abs": "https://arxiv.org/abs/2510.19749", "authors": ["Catherine Villeneuve", "Benjamin Akera", "Mélisande Teng", "David Rolnick"], "title": "BATIS: Bayesian Approaches for Targeted Improvement of Species Distribution Models", "categories": ["cs.LG", "q-bio.PE", "q-bio.QM"], "comment": null, "summary": "Species distribution models (SDMs), which aim to predict species occurrence\nbased on environmental variables, are widely used to monitor and respond to\nbiodiversity change. Recent deep learning advances for SDMs have been shown to\nperform well on complex and heterogeneous datasets, but their effectiveness\nremains limited by spatial biases in the data. In this paper, we revisit deep\nSDMs from a Bayesian perspective and introduce BATIS, a novel and practical\nframework wherein prior predictions are updated iteratively using limited\nobservational data. Models must appropriately capture both aleatoric and\nepistemic uncertainty to effectively combine fine-grained local insights with\nbroader ecological patterns. We benchmark an extensive set of uncertainty\nquantification approaches on a novel dataset including citizen science\nobservations from the eBird platform. Our empirical study shows how Bayesian\ndeep learning approaches can greatly improve the reliability of SDMs in\ndata-scarce locations, which can contribute to ecological understanding and\nconservation efforts."}
