{"id": "2506.20694", "pdf": "https://arxiv.org/pdf/2506.20694", "abs": "https://arxiv.org/abs/2506.20694", "authors": ["Andréa Ducos", "Audrey Denizot", "Thomas Guyet", "Hugues Berry"], "title": "Evaluating PDE discovery methods for multiscale modeling of biological signals", "categories": ["q-bio.QM", "cs.AI"], "comment": null, "summary": "Biological systems are non-linear, include unobserved variables and the\nphysical principles that govern their dynamics are partly unknown. This makes\nthe characterization of their behavior very challenging. Notably, their\nactivity occurs on multiple interdependent spatial and temporal scales that\nrequire linking mechanisms across scales. To address the challenge of bridging\ngaps between scales, we leverage partial differential equations (PDE)\ndiscovery. PDE discovery suggests meso-scale dynamics characteristics from\nmicro-scale data. In this article, we present our framework combining\nparticle-based simulations and PDE discovery and conduct preliminary\nexperiments to assess equation discovery in controlled settings. We evaluate\nfive state-of-the-art PDE discovery methods on particle-based simulations of\ncalcium diffusion in astrocytes. The performances of the methods are evaluated\non both the form of the discovered equation and the forecasted temporal\nvariations of calcium concentration. Our results show that several methods\naccurately recover the diffusion term, highlighting the potential of PDE\ndiscovery for capturing macroscopic dynamics in biological systems from\nmicroscopic data."}
{"id": "2506.20776", "pdf": "https://arxiv.org/pdf/2506.20776", "abs": "https://arxiv.org/abs/2506.20776", "authors": ["B. Vibishan", "Mohit Kumar Jolly", "Akshit Goyal"], "title": "Balancing the cellular budget: lessons in metabolism from microbes to cancer", "categories": ["q-bio.SC", "q-bio.PE", "q-bio.QM"], "comment": "18 pages and 1 figure Submitted to the journal BioSystems, see\n  https://www.sciencedirect.com/special-issue/10VK46MFTR8", "summary": "Cancer cells are often seen to prefer glycolytic metabolism over oxidative\nphosphorylation even in the presence of oxygen-a phenomenon termed the Warburg\neffect. Despite significant strides in the decades since its discovery, a clear\nbasis is yet to be established for the Warburg effect and why cancer cells show\nsuch a preference for aerobic glycolysis. In this review, we draw on what is\nknown about similar metabolic shifts both in normal mammalian physiology and\noverflow metabolism in microbes to shed new light on whether aerobic glycolysis\nin cancer represents some form of optimisation of cellular metabolism. From\nmicrobes to cancer, we find that metabolic shifts favouring glycolysis are\nsometimes driven by the need for faster growth, but the growth rate is by no\nmeans a universal goal of optimal metabolism. Instead, optimisation goals at\nthe cellular level are often multi-faceted and any given metabolic state must\nbe considered in the context of both its energetic costs and benefits over a\nrange of environmental contexts. For this purpose, we identify the conceptual\nframework of resource allocation as a potential testbed for the investigation\nof the cost-benefit balance of cellular metabolic strategies. Such a framework\nis also readily integrated with dynamical systems modelling, making it a\npromising avenue for new answers to the age-old question of why cells, from\ncancers to microbes, choose the metabolic strategies they do."}
{"id": "2506.21500", "pdf": "https://arxiv.org/pdf/2506.21500", "abs": "https://arxiv.org/abs/2506.21500", "authors": ["Priyanka Avhad", "Vedanti Kshirsagar", "Urvi Ranjan", "Mahek Nakhua"], "title": "Devising a solution to the problems of Cancer awareness in Telangana", "categories": ["cs.LG", "cs.CY", "q-bio.QM"], "comment": null, "summary": "According to the data, the percent of women who underwent screening for\ncervical cancer, breast and oral cancer in Telangana in the year 2020 was 3.3\npercent, 0.3 percent and 2.3 percent respectively. Although early detection is\nthe only way to reduce morbidity and mortality, people have very low awareness\nabout cervical and breast cancer signs and symptoms and screening practices. We\ndeveloped an ML classification model to predict if a person is susceptible to\nbreast or cervical cancer based on demographic factors. We devised a system to\nprovide suggestions for the nearest hospital or Cancer treatment centres based\non the users location or address. In addition to this, we can integrate the\nhealth card to maintain medical records of all individuals and conduct\nawareness drives and campaigns. For ML classification models, we used decision\ntree classification and support vector classification algorithms for cervical\ncancer susceptibility and breast cancer susceptibility respectively. Thus, by\ndevising this solution we come one step closer to our goal which is spreading\ncancer awareness, thereby, decreasing the cancer mortality and increasing\ncancer literacy among the people of Telangana."}
