{"id": "2507.02818", "pdf": "https://arxiv.org/pdf/2507.02818", "abs": "https://arxiv.org/abs/2507.02818", "authors": ["Johannes Schlüter", "Alexander Schönhuth"], "title": "Genetic Features for Drug Responses in Cancer -- Investigating an Ensemble-Feature-Selection Approach", "categories": ["q-bio.GN"], "comment": "14 pages, 8 figures", "summary": "Predicting drug responses using genetic and transcriptomic features is\ncrucial for enhancing personalized medicine. In this study, we implemented an\nensemble of machine learning algorithms to analyze the correlation between\ngenetic and transcriptomic features of cancer cell lines and IC50 values, a\nreliable metric for drug efficacy. Our analysis involved a reduction of the\nfeature set from an original pool of 38,977 features, demonstrating a strong\nlinear relationship between genetic features and drug responses across various\nalgorithms, including SVR, Linear Regression, and Ridge Regression. Notably,\ncopy number variations (CNVs) emerged as more predictive than mutations,\nsuggesting a significant reevaluation of biomarkers for drug response\nprediction. Through rigorous statistical methods, we identified a highly\nreduced set of 421 critical features. This set offers a novel perspective that\ncontrasts with traditional cancer driver genes, underscoring the potential for\nthese biomarkers in designing targeted therapies. Furthermore, our findings\nadvocate for IC50 values as a predictable measurement of drug responses and\nunderscore the need for more data that can represent the dimensionality of\ngenomic data in drug response prediction. Future work will aim to expand the\ndataset and refine feature selection to enhance the generalizability of the\npredictive model in clinical settings."}
{"id": "2507.02024", "pdf": "https://arxiv.org/pdf/2507.02024", "abs": "https://arxiv.org/abs/2507.02024", "authors": ["Danish Mahmood", "Stephanie Buczkowski", "Sahaj Shah", "Autumn Anthony", "Rohini Desetty", "Carlo R Bartoli"], "title": "TubuleTracker: a high-fidelity shareware software to quantify angiogenesis architecture and maturity", "categories": ["q-bio.QM", "cs.CV", "q-bio.CB"], "comment": "Abstract word count = [285] Total word count = [3910] Main body text\n  = [2179] References = [30] Table = [0] Figures = [4]", "summary": "Background: In vitro endothelial cell culture is widely used to study\nangiogenesis. Histomicrographic images of cell networks are often analyzed\nmanually, a process that is time-consuming and subjective. Automated tools like\nImageJ (NIH) can assist, but are often slow and inaccurate. Additionally, as\nendothelial networks grow more complex, traditional architectural metrics may\nnot fully reflect network maturity. To address these limitations, we developed\ntubuleTracker, a software tool that quantifies endothelial network architecture\nand maturity rapidly and objectively. Methods: Human umbilical vein endothelial\ncells were cultured in an extracellular matrix, and 54 images were acquired\nusing phase contrast microscopy. Each image was analyzed manually by three\nindependent reviewers, and by both ImageJ and tubuleTracker. Key metrics\nincluded tubule count, total length, node count, tubule area, and vessel\ncircularity. In parallel, trained scientists rated each image for angiogenesis\nmaturity on a 1-5 scale (1 = most mature). Results: Analysis time per image\ndiffered significantly: manual (8 min), ImageJ (58+/-4 s), and tubuleTracker\n(6+/-2 s) (p<0.0001). Significant differences were also found in tubule count\n(manual 168+/-SD, tubuleTracker 92+/-SD, ImageJ 433+/-SD), length, and node\ncount (all p<0.0001). tubuleTracker's metrics varied significantly across\nangiogenesis maturity scores, including tubule count, length, node count, area,\nand circularity (all p<0.0001). Conclusions: tubuleTracker was faster and more\nconsistent than both manual and ImageJ-based analysis. Vessel circularity\nproved especially effective in capturing angiogenesis maturity. tubuleTracker\nis available as free shareware for the biomedical research community."}
{"id": "2507.02734", "pdf": "https://arxiv.org/pdf/2507.02734", "abs": "https://arxiv.org/abs/2507.02734", "authors": ["Wenqi Zeng", "Lu Zhang", "Yuan Yao"], "title": "Leveraging Transformer Models to Capture Multi-Scale Dynamics in Biomolecules by nano-GPT", "categories": ["q-bio.QM"], "comment": null, "summary": "Long-term biomolecular dynamics are critical for understanding key\nevolutionary transformations in molecular systems. However, capturing these\nprocesses requires extended simulation timescales that often exceed the\npractical limits of conventional models. To address this, shorter simulations,\ninitialized with diverse perturbations, are commonly used to sample phase space\nand explore a wide range of behaviors. Recent advances have leveraged language\nmodels to infer long-term behavior from short trajectories, but methods such as\nlong short-term memory (LSTM) networks are constrained to low-dimensional\nreaction coordinates, limiting their applicability to complex systems. In this\nwork, we present nano-GPT, a novel deep learning model inspired by the GPT\narchitecture, specifically designed to capture long-term dynamics in molecular\nsystems with fine-grained conformational states and complex transitions. The\nmodel employs a two-pass training mechanism that incrementally replaces\nmolecular dynamics (MD) tokens with model-generated predictions, effectively\nmitigating accumulation errors inherent in the training window. We validate\nnano-GPT on three distinct systems: a four-state model potential, the alanine\ndipeptide, a well-studied simple molecule, and the Fip35 WW domain, a complex\nbiomolecular system. Our results show that nano-GPT effectively captures\nlong-timescale dynamics by learning high-order dependencies through attention\nmechanism, offering a novel perspective for interpreting biomolecular\nprocesses."}
{"id": "2507.02344", "pdf": "https://arxiv.org/pdf/2507.02344", "abs": "https://arxiv.org/abs/2507.02344", "authors": ["Trevor Reckell", "Beckett Sterner", "Petar Jevtić"], "title": "The Basic Reproduction Number for Petri Net Models: A Next-Generation Matrix Approach", "categories": ["math.AT", "q-bio.QM", "92D30, 37N25, 68Q85", "J.3; I.6.4"], "comment": "35 pages, 9 figures, 44 equations, 7 examples", "summary": "The basic reproduction number (R_0) is an epidemiological metric that\nrepresents the average number of new infections caused by a single infectious\nindividual in a completely susceptible population. The methodology for\ncalculating this metric is well-defined for numerous model types, including,\nmost prominently, Ordinary Differential Equations (ODEs). The basic\nreproduction number is used in disease modeling to predict the potential of an\noutbreak and the transmissibility of a disease, as well as by governments to\ninform public health interventions and resource allocation for controlling the\nspread of diseases. A Petri net (PN) is a directed bipartite graph where\nplaces, transitions, arcs, and the firing of the arcs determine the dynamic\nbehavior of the system. Petri net models have been an increasingly used tool\nwithin the epidemiology community. However, a generalized method for\ncalculating R_0 directly from PN models has not been established. Thus, in this\npaper, we present a general method for calculating R_0 for Petri nets.\nAdditionally, we show how a computational method implementing the\nnext-generation algorithm in ODE models can also be applied to Petri net\nmodels. We also provide multiple examples of how to use this approach to\ncalculate 0 for various SIR-type Petri net models."}
{"id": "2507.02367", "pdf": "https://arxiv.org/pdf/2507.02367", "abs": "https://arxiv.org/abs/2507.02367", "authors": ["Christian Salomonsen", "Luigi Tommaso Luppino", "Fredrik Aspheim", "Kristoffer Wickstrøm", "Elisabeth Wetzer", "Michael Kampffmeyer", "Rodrigo Berzaghi", "Rune Sundset", "Robert Jenssen", "Samuel Kuttner"], "title": "A robust and versatile deep learning model for prediction of the arterial input function in dynamic small animal $\\left[^{18}\\text{F}\\right]$FDG PET imaging", "categories": ["eess.IV", "cs.CV", "physics.med-ph", "q-bio.QM"], "comment": "22 pages, 12 figures", "summary": "Dynamic positron emission tomography (PET) and kinetic modeling are pivotal\nin advancing tracer development research in small animal studies. Accurate\nkinetic modeling requires precise input function estimation, traditionally\nachieved via arterial blood sampling. However, arterial cannulation in small\nanimals like mice, involves intricate, time-consuming, and terminal procedures,\nprecluding longitudinal studies. This work proposes a non-invasive, fully\nconvolutional deep learning-based approach (FC-DLIF) to predict input functions\ndirectly from PET imaging, potentially eliminating the need for blood sampling\nin dynamic small-animal PET. The proposed FC-DLIF model includes a spatial\nfeature extractor acting on the volumetric time frames of the PET sequence,\nextracting spatial features. These are subsequently further processed in a\ntemporal feature extractor that predicts the arterial input function. The\nproposed approach is trained and evaluated using images and arterial blood\ncurves from [$^{18}$F]FDG data using cross validation. Further, the model\napplicability is evaluated on imaging data and arterial blood curves collected\nusing two additional radiotracers ([$^{18}$F]FDOPA, and [$^{68}$Ga]PSMA). The\nmodel was further evaluated on data truncated and shifted in time, to simulate\nshorter, and shifted, PET scans. The proposed FC-DLIF model reliably predicts\nthe arterial input function with respect to mean squared error and correlation.\nFurthermore, the FC-DLIF model is able to predict the arterial input function\neven from truncated and shifted samples. The model fails to predict the AIF\nfrom samples collected using different radiotracers, as these are not\nrepresented in the training data. Our deep learning-based input function offers\na non-invasive and reliable alternative to arterial blood sampling, proving\nrobust and flexible to temporal shifts and different scan durations."}
