{"id": "2511.02263", "pdf": "https://arxiv.org/pdf/2511.02263", "abs": "https://arxiv.org/abs/2511.02263", "authors": ["Jaeyeon Lee", "Hyun-Hwan Jeong", "Zhandong Liu"], "title": "LA-MARRVEL: A Knowledge-Grounded and Language-Aware LLM Reranker for AI-MARRVEL in Rare Disease Diagnosis", "categories": ["q-bio.GN", "cs.AI"], "comment": null, "summary": "Diagnosing rare diseases often requires connecting variant-bearing genes to\nevidence that is written as unstructured clinical prose, which the current\nestablished pipelines still leave for clinicians to reconcile manually. To this\nend, we introduce LA-MARRVEL, a knowledge-grounded and language-aware reranking\nlayer that operates on top of AI-MARRVEL: it supplies expert-engineered\ncontext, queries a large language model multiple times, and aggregates the\nresulting partial rankings with a ranked voting method to produce a stable,\nexplainable gene ranking. Evaluated on three real-world cohorts (BG, DDD, UDN),\nLA-MARRVEL consistently improves Recall@K over AI-MARRVEL and established\nphenotype-driven tools such as Exomiser and LIRICAL, with especially large\ngains on cases where the first-stage ranker placed the causal gene lower. Each\nranked gene is accompanied by LLM-generated reasoning that integrates\nphenotypic, inheritance, and variant-level evidence, thereby making the output\nmore interpretable and facilitating clinical review."}
{"id": "2511.02332", "pdf": "https://arxiv.org/pdf/2511.02332", "abs": "https://arxiv.org/abs/2511.02332", "authors": ["Hongyang Jiang", "Yuezhu Wang", "Ke Feng", "Chaoyi Yin", "Yi Chang", "Huiyan Sun"], "title": "Biological Regulatory Network Inference through Circular Causal Structure Learning", "categories": ["q-bio.MN", "cs.AI"], "comment": null, "summary": "Biological networks are pivotal in deciphering the complexity and\nfunctionality of biological systems. Causal inference, which focuses on\ndetermining the directionality and strength of interactions between variables\nrather than merely relying on correlations, is considered a logical approach\nfor inferring biological networks. Existing methods for causal structure\ninference typically assume that causal relationships between variables can be\nrepresented by directed acyclic graphs (DAGs). However, this assumption is at\nodds with the reality of widespread feedback loops in biological systems,\nmaking these methods unsuitable for direct use in biological network inference.\nIn this study, we propose a new framework named SCALD (Structural CAusal model\nfor Loop Diagram), which employs a nonlinear structure equation model and a\nstable feedback loop conditional constraint through continuous optimization to\ninfer causal regulatory relationships under feedback loops. We observe that\nSCALD outperforms state-of-the-art methods in inferring both transcriptional\nregulatory networks and signaling transduction networks. SCALD has\nirreplaceable advantages in identifying feedback regulation. Through\ntranscription factor (TF) perturbation data analysis, we further validate the\naccuracy and sensitivity of SCALD. Additionally, SCALD facilitates the\ndiscovery of previously unknown regulatory relationships, which we have\nsubsequently confirmed through ChIP-seq data analysis. Furthermore, by\nutilizing SCALD, we infer the key driver genes that facilitate the\ntransformation from colon inflammation to cancer by examining the dynamic\nchanges within regulatory networks during the process."}
{"id": "2511.01953", "pdf": "https://arxiv.org/pdf/2511.01953", "abs": "https://arxiv.org/abs/2511.01953", "authors": ["Takaaki Tachibana", "Toru Nagasaka", "Yukari Adachi", "Hiroki Kagiyama", "Ryota Ito", "Mitsugu Fujita", "Kimihiro Yamashita", "Yoshihiro Kakeji"], "title": "Reliability Assessment Framework Based on Feature Separability for Pathological Cell Image Classification under Prior Bias", "categories": ["q-bio.QM", "eess.IV"], "comment": null, "summary": "\\textbf{Background and objective:} Prior probability shift between training\nand deployment datasets challenges deep learning--based medical image\nclassification. Standard correction methods reweight posterior probabilities to\nadjust prior bias, yet their benefit is inconsistent. We developed a\nreliability framework identifying when prior correction helps or harms\nperformance in pathological cell image analysis. \\textbf{Methods:} We analyzed\n303 colorectal cancer specimens with CD103/CD8 immunostaining, yielding\n185{,}432 annotated cell images across 16 cell types. ResNet models were\ntrained under varying bias ratios (1.1--20$\\times$). Feature separability was\nquantified using cosine similarity--based likelihood quality scores, reflecting\nintra- versus inter-class distinctions in learned feature spaces. Multiple\nlinear regression, ANOVA, and generalized additive models (GAMs) evaluated\nassociations among feature separability, prior bias, sample adequacy, and F1\nperformance. \\textbf{Results:} Feature separability dominated performance\n($\\beta = 1.650$, $p < 0.001$), showing 412-fold stronger impact than prior\nbias ($\\beta = 0.004$, $p = 0.018$). GAM analysis showed strong predictive\npower ($R^2 = 0.876$) with mostly linear trends. A quality threshold of 0.294\neffectively identified cases requiring correction (AUC = 0.610). Cell types\nscoring $>0.5$ were robust without correction, whereas those $<0.3$\nconsistently required adjustment. \\textbf{Conclusion:} Feature extraction\nquality, not bias magnitude, governs correction benefit. The proposed framework\nprovides quantitative guidance for selective correction, enabling efficient\ndeployment and reliable diagnostic AI."}
{"id": "2511.02418", "pdf": "https://arxiv.org/pdf/2511.02418", "abs": "https://arxiv.org/abs/2511.02418", "authors": ["Xiaoyu Zhang", "Zhou Fang"], "title": "Biomolecular LQR under Partial Observation", "categories": ["q-bio.MN", "math.OC"], "comment": null, "summary": "This paper introduces a biomolecular Linear Quadratic Regulator (LQR) to\ninvestigate the design principles of gene regulatory networks. We show that for\nfundamental gene regulation network, the bio-controller derived from LQR theory\nprecisely recapitulate natural network motifs, such as auto-regulation and\nincoherent feedforward loops. This emulation arises from a fundamental\nprinciple: the LQR cost function mathematically encodes environmental survival\ndemands, which subsequently drives the selection of both network topology and\nbiochemical parameters. Our work thus establishes a theoretical basis for\ninterpreting biological circuit design, directly linking evolutionary pressures\nto observable regulatory structures."}
{"id": "2511.02735", "pdf": "https://arxiv.org/pdf/2511.02735", "abs": "https://arxiv.org/abs/2511.02735", "authors": ["Eva Guttmann-Flury", "Jian Zhao", "Mohamad Sawan"], "title": "Spatial Insight: How Data-Driven Regions of Interest Selection Enhances Single-Trial P300 Classification in EEG-Based BCIs", "categories": ["q-bio.QM"], "comment": null, "summary": "EEG-based Brain-Computer Interfaces (BCIs) frequently face spatial\nspecificity limitations in detecting single-trial P300 potentials, a\nneurophysiological hallmark leveraged for both BCI control and\nneurodegenerative disease diagnostics. We present a novel framework combining\neLORETA source localization with cross-subject functional connectivity to\nidentify stable regions of interest (ROIs) across sessions. Analyzing\n62-channel EEG data from 31 subjects (63 sessions, 2,520 trials), we\ndemonstrate that phase-lagged connectivity metrics can reliably isolate\ntask-relevant hubs in deeper cortical-subcortical structures like the insula\nand parietal regions - critical for Alzheimer's disease biomarkers. By\nintegrating spatially stable ROIs with dynamic temporal agreement, our hybrid\nclassification systematically outperforms whole-brain approaches in different\nfrequency bands (up to 5.4% depending on the connectivity method and the\nspectral range) while maintaining millisecond-level temporal precision.\n  To the best of our knowledge, this is the first study to establish\ncross-subject ROI consensus through source-space connectivity, bypassing scalp\nEEG's depth constraints to probe Alzheimer's-relevant networks. The framework's\nrobustness to noise and compatibility with portable systems offer significant\npotential for global deployment in early neurodegenerative disease detection.\nFuture integration of individualized anatomical data or adaptive parameter\noptimization could refine this tool for clinical deployment, enhancing the\ncurrent max accuracy of 81.57% in the 1-15 Hz range."}
{"id": "2511.02038", "pdf": "https://arxiv.org/pdf/2511.02038", "abs": "https://arxiv.org/abs/2511.02038", "authors": ["Elham Gholamzadeh", "Kajal Singla", "Nico Scherf"], "title": "Predicting Microbial Interactions Using Graph Neural Networks", "categories": ["cs.LG", "q-bio.QM", "68T05", "I.2.6; I.5.1"], "comment": "9 pages, 3 figures, NeurIPS 2025 Workshop New Perspectives in Graph\n  Machine Learning", "summary": "Predicting interspecies interactions is a key challenge in microbial ecology,\nas these interactions are critical to determining the structure and activity of\nmicrobial communities. In this work, we used data on monoculture growth\ncapabilities, interactions with other species, and phylogeny to predict a\nnegative or positive effect of interactions. More precisely, we used one of the\nlargest available pairwise interaction datasets to train our models, comprising\nover 7,500 interactions be- tween 20 species from two taxonomic groups\nco-cultured under 40 distinct carbon conditions, with a primary focus on the\nwork of Nestor et al.[28 ]. In this work, we propose Graph Neural Networks\n(GNNs) as a powerful classifier to predict the direction of the effect. We\nconstruct edge-graphs of pairwise microbial interactions in order to leverage\nshared information across individual co-culture experiments, and use GNNs to\npredict modes of interaction. Our model can not only predict binary\ninteractions (positive/negative) but also classify more complex interaction\ntypes such as mutualism, competition, and parasitism. Our initial results were\nencouraging, achieving an F1-score of 80.44%. This significantly outperforms\ncomparable methods in the literature, including conventional Extreme Gradient\nBoosting (XGBoost) models, which reported an F1-score of 72.76%."}
