{"id": "2508.17345", "pdf": "https://arxiv.org/pdf/2508.17345", "abs": "https://arxiv.org/abs/2508.17345", "authors": ["Yuxuan Song", "Zhe Zhang", "Yu Pei", "Jingjing Gong", "Qiying Yu", "Zheng Zhang", "Mingxuan Wang", "Hao Zhou", "Jingjing Liu", "Wei-Ying Ma"], "title": "ShortListing Model: A Streamlined SimplexDiffusion for Discrete Variable Generation", "categories": ["cs.LG", "q-bio.GN"], "comment": null, "summary": "Generative modeling of discrete variables is challenging yet crucial for\napplications in natural language processing and biological sequence design. We\nintroduce the Shortlisting Model (SLM), a novel simplex-based diffusion model\ninspired by progressive candidate pruning. SLM operates on simplex centroids,\nreducing generation complexity and enhancing scalability. Additionally, SLM\nincorporates a flexible implementation of classifier-free guidance, enhancing\nunconditional generation performance. Extensive experiments on DNA promoter and\nenhancer design, protein design, character-level and large-vocabulary language\nmodeling demonstrate the competitive performance and strong potential of SLM.\nOur code can be found at https://github.com/GenSI-THUAIR/SLM"}
{"id": "2508.16740", "pdf": "https://arxiv.org/pdf/2508.16740", "abs": "https://arxiv.org/abs/2508.16740", "authors": ["Robert Amevor", "Emmanuel Kubuafor", "Dennis Baidoo", "Junaidu Salifu", "Koshali Muthunama Gonnage", "Onyedikachi Joshua Okeke"], "title": "Integrative Prognostic Modeling of Breast Cancer Survival with Gene Expression and Clinical Data", "categories": ["q-bio.QM"], "comment": "14 pages, 8 figures", "summary": "Background: Accurate survival prediction in breast cancer is essential for\npatient stratification and personalized therapy. Integrating gene expression\ndata with clinical factors may enhance prognostic performance and support\nprecision medicine. Objective: To develop an integrative survival prediction\nmodel combining clinical variables and gene expression signatures, and to\nassess their contributions using penalized Cox regression and machine learning.\nMethods: We analyzed 1,867 patients from the METABRIC cohort with clinical\nannotations and microarray-based gene expression profiles. The top 5,000 most\nvariable genes were retained. Elastic Net-penalized Cox regression identified\n75 predictors (70 genes and 5 clinical variables: tumor size, stage, surgery\ntype, age at diagnosis, and Nottingham Prognostic Index). Model performance was\nevaluated with Harrell's concordance index (C-index) and 36-month\ntime-dependent AUC. Random Survival Forests (RSF) trained on the top 20 genes\nassessed nonlinear effects and validated variable importance. PCA and heatmaps\nvisualized gene expression patterns across risk groups. Results: The\nintegrative Cox model achieved a C-index of 0.922 and a 36-month AUC of 0.94,\noutperforming clinical-only models (C=0.64). RSF confirmed the prognostic value\nof top genes (e.g., OR2T27, TBATA, LINC01165, SLC10A4), yielding a 36-month AUC\nof 0.88. Conclusions: Combining gene expression signatures with clinical\nvariables substantially improves survival prediction in breast cancer and\nprovides a framework for individualized prognostic assessment and clinical\ndecision-making."}
{"id": "2508.17010", "pdf": "https://arxiv.org/pdf/2508.17010", "abs": "https://arxiv.org/abs/2508.17010", "authors": ["Yue Hu", "Zanxia Cao", "Yingchao Liu"], "title": "Lie-RMSD: A Gradient-Based Framework for Protein Structural Alignment using Lie Algebra", "categories": ["q-bio.QM", "92C40"], "comment": "7 pages, 1 figure, 1 table", "summary": "The comparison of protein structures is a fundamental task in computational\nbiology, crucial for understanding protein function, evolution, and for drug\ndesign. While analytical methods like the Kabsch algorithm provide an exact,\nclosed-form solution for minimizing the Root Mean Square Deviation (RMSD)\nbetween two sets of corresponding atoms, their application is limited to this\nspecific metric. The rise of deep learning and automatic differentiation\nframeworks offers a new, more flexible paradigm for such optimization problems.\nWe present Lie-RMSD, a novel, fully differentiable framework for protein\nstructural alignment. Our method represents the rigid-body transformation\n(rotation and translation) as a 6-dimensional vector in the Lie algebra se(3)\nof the special Euclidean group SE(3). This representation allows the RMSD to be\nformulated as a loss function that can be directly minimized by modern\ngradient-based optimizers. We benchmarked our framework by aligning two\nallosteric conformations of Adenylate Kinase (PDB IDs: 4AKE and 1AKE). We\ndemonstrate that a suite of standard optimizers (SGD, Adam, AdamW, and Sophia)\ncan robustly converge to the global minimum, achieving precision effectively\nidentical to the analytical Kabsch algorithm. This work validates the accuracy\nof the Lie algebra-based gradient descent approach and establishes a robust\nfoundation for its extension to more sophisticated and biologically relevant\nscoring functions where no analytical solutions exist."}
{"id": "2508.17389", "pdf": "https://arxiv.org/pdf/2508.17389", "abs": "https://arxiv.org/abs/2508.17389", "authors": ["Bokai Zhao", "Weiyang Shi", "Hanqing Chao", "Zijiang Yang", "Yiyang Zhang", "Ming Song", "Tianzi Jiang"], "title": "Neural Proteomics Fields for Super-resolved Spatial Proteomics Prediction", "categories": ["q-bio.QM", "cs.AI", "cs.CV"], "comment": "MICCAI 2025", "summary": "Spatial proteomics maps protein distributions in tissues, providing\ntransformative insights for life sciences. However, current sequencing-based\ntechnologies suffer from low spatial resolution, and substantial inter-tissue\nvariability in protein expression further compromises the performance of\nexisting molecular data prediction methods. In this work, we introduce the\nnovel task of spatial super-resolution for sequencing-based spatial proteomics\n(seq-SP) and, to the best of our knowledge, propose the first deep learning\nmodel for this task--Neural Proteomics Fields (NPF). NPF formulates seq-SP as a\nprotein reconstruction problem in continuous space by training a dedicated\nnetwork for each tissue. The model comprises a Spatial Modeling Module, which\nlearns tissue-specific protein spatial distributions, and a Morphology Modeling\nModule, which extracts tissue-specific morphological features. Furthermore, to\nfacilitate rigorous evaluation, we establish an open-source benchmark dataset,\nPseudo-Visium SP, for this task. Experimental results demonstrate that NPF\nachieves state-of-the-art performance with fewer learnable parameters,\nunderscoring its potential for advancing spatial proteomics research. Our code\nand dataset are publicly available at https://github.com/Bokai-Zhao/NPF."}
{"id": "2508.18058", "pdf": "https://arxiv.org/pdf/2508.18058", "abs": "https://arxiv.org/abs/2508.18058", "authors": ["Muheng Shang", "Jin Zhang", "Junwei Han", "Lei Du"], "title": "Comprehensively stratifying MCIs into distinct risk subtypes based on brain imaging genetics fusion learning", "categories": ["q-bio.QM"], "comment": null, "summary": "Mild cognitive impairment (MCI) is the prodromal stage of Alzheimer's disease\n(AD) and thus enrolling MCI subjects to undergo clinical trials is worthwhile.\nHowever, MCI groups usually show significant diversity and heterogeneity in the\npathology and symptom, which pose great challenge to accurately select\nappropriate subjects. This study aimed to stratify MCI subjects into distinct\nsubgroups with substantial difference in the risk of transitioning to AD by\nfusing multimodal brain imaging genetic data. The integrated imaging genetics\nmethod comprised three modules, i.e., the whole-genome-oriented risk genetic\ninformation extraction module (RGE), the genetic-to-brain mapping module\n(RG2PG), and the genetic-guided pseudo-brain fusion module (CMPF). We used data\nfrom AD Neuroimaging Initiative (ADNI) and identified two MCI subtypes, called\nlow-risk MCI (lsMCI) and high-risk MCI (hsMCI). We also validated that the two\nsubgroups showed distinct patterns of in terms of multiple biomarkers including\ngenetics, demographics, fluid biomarkers, brain imaging features, clinical\nsymptoms and cognitive functioning at baseline, as well as their longitudinal\ndevelopmental trajectories. Furthermore, we also identified potential\nbiomarkers that may implicate the risk of MCIs, providing critical insights for\npatient stratification at early stage."}
{"id": "2508.16650", "pdf": "https://arxiv.org/pdf/2508.16650", "abs": "https://arxiv.org/abs/2508.16650", "authors": ["James K Ruffle", "Samia Mohinta", "Guilherme Pombo", "Asthik Biswas", "Alan Campbell", "Indran Davagnanam", "David Doig", "Ahmed Hamman", "Harpreet Hyare", "Farrah Jabeen", "Emma Lim", "Dermot Mallon", "Stephanie Owen", "Sophie Wilkinson", "Sebastian Brandner", "Parashkev Nachev"], "title": "Predicting brain tumour enhancement from non-contrast MR imaging with artificial intelligence", "categories": ["eess.IV", "cs.CV", "q-bio.QM"], "comment": "38 pages", "summary": "Brain tumour imaging assessment typically requires both pre- and\npost-contrast MRI, but gadolinium administration is not always desirable, such\nas in frequent follow-up, renal impairment, allergy, or paediatric patients. We\naimed to develop and validate a deep learning model capable of predicting brain\ntumour contrast enhancement from non-contrast MRI sequences alone. We assembled\n11089 brain MRI studies from 10 international datasets spanning adult and\npaediatric populations with various neuro-oncological states, including glioma,\nmeningioma, metastases, and post-resection appearances. Deep learning models\n(nnU-Net, SegResNet, SwinUNETR) were trained to predict and segment enhancing\ntumour using only non-contrast T1-, T2-, and T2/FLAIR-weighted images.\nPerformance was evaluated on 1109 held-out test patients using patient-level\ndetection metrics and voxel-level segmentation accuracy. Model predictions were\ncompared against 11 expert radiologists who each reviewed 100 randomly selected\npatients. The best-performing nnU-Net achieved 83% balanced accuracy, 91.5%\nsensitivity, and 74.4% specificity in detecting enhancing tumour. Enhancement\nvolume predictions strongly correlated with ground truth (R2 0.859). The model\noutperformed expert radiologists, who achieved 69.8% accuracy, 75.9%\nsensitivity, and 64.7% specificity. 76.8% of test patients had Dice over 0.3\n(acceptable detection), 67.5% had Dice over 0.5 (good detection), and 50.2% had\nDice over 0.7 (excellent detection). Deep learning can identify\ncontrast-enhancing brain tumours from non-contrast MRI with clinically relevant\nperformance. These models show promise as screening tools and may reduce\ngadolinium dependence in neuro-oncology imaging. Future work should evaluate\nclinical utility alongside radiology experts."}
{"id": "2508.16803", "pdf": "https://arxiv.org/pdf/2508.16803", "abs": "https://arxiv.org/abs/2508.16803", "authors": ["Yu Wang", "Xiao Chen", "Hubert Schwarz", "Véronique Chotteau", "Elling W. Jacobsen"], "title": "A predictive modular approach to constraint satisfaction under uncertainty - with application to glycosylation in continuous monoclonal antibody biosimilar production", "categories": ["eess.SY", "cs.SY", "math.OC", "q-bio.QM"], "comment": null, "summary": "The paper proposes a modular-based approach to constraint handling in process\noptimization and control. This is partly motivated by the recent interest in\nlearning-based methods, e.g., within bioproduction, for which constraint\nhandling under uncertainty is a challenge. The proposed constraint handler,\ncalled predictive filter, is combined with an adaptive constraint margin and a\nconstraint violation cost monitor to minimize the cost of violating soft\nconstraints due to model uncertainty and disturbances. The module can be\ncombined with any controller and is based on minimally modifying the controller\noutput, in a least squares sense, such that constraints are satisfied within\nthe considered horizon. The proposed method is computationally efficient and\nsuitable for real-time applications. The effectiveness of the method is\nillustrated through a realistic simulation case study of glycosylation\nconstraint satisfaction in continuous monoclonal antibody biosimilar production\nusing Chinese hamster ovary cells, for which the metabolic network model\nconsists of 23 extracellular metabolites and 126 reactions."}
{"id": "2508.16934", "pdf": "https://arxiv.org/pdf/2508.16934", "abs": "https://arxiv.org/abs/2508.16934", "authors": ["Tim Mach", "Daniel Rueckert", "Alex Berger", "Laurin Lux", "Ivan Ezhov"], "title": "Addressing Annotation Scarcity in Hyperspectral Brain Image Segmentation with Unsupervised Domain Adaptation", "categories": ["cs.CV", "q-bio.QM"], "comment": null, "summary": "This work presents a novel deep learning framework for segmenting cerebral\nvasculature in hyperspectral brain images. We address the critical challenge of\nsevere label scarcity, which impedes conventional supervised training. Our\napproach utilizes a novel unsupervised domain adaptation methodology, using a\nsmall, expert-annotated ground truth alongside unlabeled data. Quantitative and\nqualitative evaluations confirm that our method significantly outperforms\nexisting state-of-the-art approaches, demonstrating the efficacy of domain\nadaptation for label-scarce biomedical imaging tasks."}
{"id": "2508.17555", "pdf": "https://arxiv.org/pdf/2508.17555", "abs": "https://arxiv.org/abs/2508.17555", "authors": ["Kairi Furui", "Masahito Ohue"], "title": "Boltzina: Efficient and Accurate Virtual Screening via Docking-Guided Binding Prediction with Boltz-2", "categories": ["q-bio.BM", "cs.CE", "cs.LG", "q-bio.QM"], "comment": null, "summary": "In structure-based drug discovery, virtual screening using conventional\nmolecular docking methods can be performed rapidly but suffers from limitations\nin prediction accuracy. Recently, Boltz-2 was proposed, achieving extremely\nhigh accuracy in binding affinity prediction, but requiring approximately 20\nseconds per compound per GPU, making it difficult to apply to large-scale\nscreening of hundreds of thousands to millions of compounds. This study\nproposes Boltzina, a novel framework that leverages Boltz-2's high accuracy\nwhile significantly improving computational efficiency. Boltzina achieves both\naccuracy and speed by omitting the rate-limiting structure prediction from\nBoltz-2's architecture and directly predicting affinity from AutoDock Vina\ndocking poses. We evaluate on eight assays from the MF-PCBA dataset and show\nthat while Boltzina performs below Boltz-2, it provides significantly higher\nscreening performance compared to AutoDock Vina and GNINA. Additionally,\nBoltzina achieved up to 11.8$\\times$ faster through reduced recycling\niterations and batch processing. Furthermore, we investigated multi-pose\nselection strategies and two-stage screening combining Boltzina and Boltz-2,\npresenting optimization methods for accuracy and efficiency according to\napplication requirements. This study represents the first attempt to apply\nBoltz-2's high-accuracy predictions to practical-scale screening, offering a\npipeline that combines both accuracy and efficiency in computational biology.\nThe Boltzina is available on github; https://github.com/ohuelab/boltzina."}
{"id": "2508.17699", "pdf": "https://arxiv.org/pdf/2508.17699", "abs": "https://arxiv.org/abs/2508.17699", "authors": ["Z. Rafati", "M. Hoseyni", "J. Khoramdel", "A. Nikoofard"], "title": "Benchmarking Class Activation Map Methods for Explainable Brain Hemorrhage Classification on Hemorica Dataset", "categories": ["cs.CV", "q-bio.QM"], "comment": null, "summary": "Explainable Artificial Intelligence (XAI) has become an essential component\nof medical imaging research, aiming to increase transparency and clinical trust\nin deep learning models. This study investigates brain hemorrhage diagnosis\nwith a focus on explainability through Class Activation Mapping (CAM)\ntechniques. A pipeline was developed to extract pixellevel segmentation and\ndetection annotations from classification models using nine state-of-the-art\nCAM algorithms, applied across multiple network stages, and quantitatively\nevaluated on the Hemorica dataset, which uniquely provides both slice-level\nlabels and high-quality segmentation masks. Metrics including Dice, IoU, and\npixel-wise overlap were employed to benchmark CAM variants. Results show that\nthe strongest localization performance occurred at stage 5 of EfficientNetV2S,\nwith HiResCAM yielding the highest bounding-box alignment and AblationCAM\nachieving the best pixel-level Dice (0.57) and IoU (0.40), representing strong\naccuracy given that models were trained solely for classification without\nsegmentation supervision. To the best of current knowledge, this is among the f\nirst works to quantitatively compare CAM methods for brain hemorrhage\ndetection, establishing a reproducible benchmark and underscoring the potential\nof XAI-driven pipelines for clinically meaningful AI-assisted diagnosis."}
{"id": "2508.18066", "pdf": "https://arxiv.org/pdf/2508.18066", "abs": "https://arxiv.org/abs/2508.18066", "authors": ["Alberto Silvio Chiappa", "Boshi An", "Merkourios Simos", "Chengkun Li", "Alexander Mathis"], "title": "Arnold: a generalist muscle transformer policy", "categories": ["cs.RO", "cs.AI", "cs.LG", "q-bio.QM"], "comment": "A.S.C. and B.A. contributed equally. Code is available at\n  https://github.com/amathislab/arnold-the-generalist", "summary": "Controlling high-dimensional and nonlinear musculoskeletal models of the\nhuman body is a foundational scientific challenge. Recent machine learning\nbreakthroughs have heralded policies that master individual skills like\nreaching, object manipulation and locomotion in musculoskeletal systems with\nmany degrees of freedom. However, these agents are merely \"specialists\",\nachieving high performance for a single skill. In this work, we develop Arnold,\na generalist policy that masters multiple tasks and embodiments. Arnold\ncombines behavior cloning and fine-tuning with PPO to achieve expert or\nsuper-expert performance in 14 challenging control tasks from dexterous object\nmanipulation to locomotion. A key innovation is Arnold's sensorimotor\nvocabulary, a compositional representation of the semantics of heterogeneous\nsensory modalities, objectives, and actuators. Arnold leverages this vocabulary\nvia a transformer architecture to deal with the variable observation and action\nspaces of each task. This framework supports efficient multi-task,\nmulti-embodiment learning and facilitates rapid adaptation to novel tasks.\nFinally, we analyze Arnold to provide insights into biological motor control,\ncorroborating recent findings on the limited transferability of muscle\nsynergies across tasks."}
