{"id": "2509.09740", "pdf": "https://arxiv.org/pdf/2509.09740", "abs": "https://arxiv.org/abs/2509.09740", "authors": ["Ying Yuan", "Xing-Yue Monica Ge", "Aaron Archer Waterman", "Tommaso Biancalani", "David Richmond", "Yogesh Pandit", "Avtar Singh", "Russell Littman", "Jin Liu", "Jan-Christian Huetter", "Vladimir Ermakov"], "title": "HypoGeneAgent: A Hypothesis Language Agent for Gene-Set Cluster Resolution Selection Using Perturb-seq Datasets", "categories": ["q-bio.QM", "cs.AI", "cs.CL", "cs.LG"], "comment": null, "summary": "Large-scale single-cell and Perturb-seq investigations routinely involve\nclustering cells and subsequently annotating each cluster with Gene-Ontology\n(GO) terms to elucidate the underlying biological programs. However, both\nstages, resolution selection and functional annotation, are inherently\nsubjective, relying on heuristics and expert curation. We present\nHYPOGENEAGENT, a large language model (LLM)-driven framework, transforming\ncluster annotation into a quantitatively optimizable task. Initially, an LLM\nfunctioning as a gene-set analyst analyzes the content of each gene program or\nperturbation module and generates a ranked list of GO-based hypotheses,\naccompanied by calibrated confidence scores. Subsequently, we embed every\npredicted description with a sentence-embedding model, compute pair-wise cosine\nsimilarities, and let the agent referee panel score (i) the internal\nconsistency of the predictions, high average similarity within the same\ncluster, termed intra-cluster agreement (ii) their external distinctiveness,\nlow similarity between clusters, termed inter-cluster separation. These two\nquantities are combined to produce an agent-derived resolution score, which is\nmaximized when clusters exhibit simultaneous coherence and mutual exclusivity.\nWhen applied to a public K562 CRISPRi Perturb-seq dataset as a preliminary\ntest, our Resolution Score selects clustering granularities that exhibit\nalignment with known pathway compared to classical metrics such silhouette\nscore, modularity score for gene functional enrichment summary. These findings\nestablish LLM agents as objective adjudicators of cluster resolution and\nfunctional annotation, thereby paving the way for fully automated,\ncontext-aware interpretation pipelines in single-cell multi-omics studies."}
{"id": "2509.09738", "pdf": "https://arxiv.org/pdf/2509.09738", "abs": "https://arxiv.org/abs/2509.09738", "authors": ["Umut Eser", "Yael Gozin", "L. Jay Stallons", "Ari Caroline", "Martin Preusse", "Brandon Rice", "Scott Wright", "Andrew Robertson"], "title": "Human-AI Collaboration Increases Efficiency in Regulatory Writing", "categories": ["cs.AI", "q-bio.QM", "I.2.7"], "comment": null, "summary": "Background: Investigational New Drug (IND) application preparation is\ntime-intensive and expertise-dependent, slowing early clinical development.\nObjective: To evaluate whether a large language model (LLM) platform (AutoIND)\ncan reduce first-draft composition time while maintaining document quality in\nregulatory submissions. Methods: Drafting times for IND nonclinical written\nsummaries (eCTD modules 2.6.2, 2.6.4, 2.6.6) generated by AutoIND were directly\nrecorded. For comparison, manual drafting times for IND summaries previously\ncleared by the U.S. FDA were estimated from the experience of regulatory\nwriters ($\\geq$6 years) and used as industry-standard benchmarks. Quality was\nassessed by a blinded regulatory writing assessor using seven pre-specified\ncategories: correctness, completeness, conciseness, consistency, clarity,\nredundancy, and emphasis. Each sub-criterion was scored 0-3 and normalized to a\npercentage. A critical regulatory error was defined as any misrepresentation or\nomission likely to alter regulatory interpretation (e.g., incorrect NOAEL,\nomission of mandatory GLP dose-formulation analysis). Results: AutoIND reduced\ninitial drafting time by $\\sim$97% (from $\\sim$100 h to 3.7 h for 18,870\npages/61 reports in IND-1; and to 2.6 h for 11,425 pages/58 reports in IND-2).\nQuality scores were 69.6\\% and 77.9\\% for IND-1 and IND-2. No critical\nregulatory errors were detected, but deficiencies in emphasis, conciseness, and\nclarity were noted. Conclusions: AutoIND can dramatically accelerate IND\ndrafting, but expert regulatory writers remain essential to mature outputs to\nsubmission-ready quality. Systematic deficiencies identified provide a roadmap\nfor targeted model improvements."}
