{"id": "2509.14287", "pdf": "https://arxiv.org/pdf/2509.14287", "abs": "https://arxiv.org/abs/2509.14287", "authors": ["Elham Sadeghi", "Xianqi Deng", "I-Hsin Lin", "Stacy M. Copp", "Petko Bogdanov"], "title": "Property-Isometric Variational Autoencoders for Sequence Modeling and Design", "categories": ["q-bio.QM", "cs.AI", "cs.LG"], "comment": "20 pages, 6 figures, preprint", "summary": "Biological sequence design (DNA, RNA, or peptides) with desired functional\nproperties has applications in discovering novel nanomaterials, biosensors,\nantimicrobial drugs, and beyond. One common challenge is the ability to\noptimize complex high-dimensional properties such as target emission spectra of\nDNA-mediated fluorescent nanoparticles, photo and chemical stability, and\nantimicrobial activity of peptides across target microbes. Existing models rely\non simple binary labels (e.g., binding/non-binding) rather than\nhigh-dimensional complex properties. To address this gap, we propose a\ngeometry-preserving variational autoencoder framework, called PrIVAE, which\nlearns latent sequence embeddings that respect the geometry of their property\nspace. Specifically, we model the property space as a high-dimensional manifold\nthat can be locally approximated by a nearest neighbor graph, given an\nappropriately defined distance measure. We employ the property graph to guide\nthe sequence latent representations using (1) graph neural network encoder\nlayers and (2) an isometric regularizer. PrIVAE learns a property-organized\nlatent space that enables rational design of new sequences with desired\nproperties by employing the trained decoder. We evaluate the utility of our\nframework for two generative tasks: (1) design of DNA sequences that template\nfluorescent metal nanoclusters and (2) design of antimicrobial peptides. The\ntrained models retain high reconstruction accuracy while organizing the latent\nspace according to properties. Beyond in silico experiments, we also employ\nsampled sequences for wet lab design of DNA nanoclusters, resulting in up to\n16.1-fold enrichment of rare-property nanoclusters compared to their abundance\nin training data, demonstrating the practical utility of our framework."}
{"id": "2509.14862", "pdf": "https://arxiv.org/pdf/2509.14862", "abs": "https://arxiv.org/abs/2509.14862", "authors": ["Maïri Souza Oliveira", "Clémentine Préau", "Samuel Alleaume", "Maxime Lenormand", "Sandra Luque"], "title": "Modelling species distributions using remote sensing predictors: Comparing Dynamic Habitat Index and LULC", "categories": ["q-bio.QM", "q-bio.PE"], "comment": "27 pages, 7 figures + Appendix", "summary": "This study compares the predictive capacity of the Dynamic Habitat Index\n(DHI) - a remote sensing (RS)-based measure of habitat productivity and\nvariability - against traditional land-use/land-cover (LULC) metrics in species\ndistribution modelling (SDM) applications. RS and LULC-based SDMs were built\nusing distribution data for eleven bird, amphibian, and mammal species in\n\\^Ile-de-France. Predictor variables were derived from Sentinel-2 RS data and\nLULC classifications, with the latter incorporating Euclidean distance to\nhabitat types. Ensemble SDMs were built using nine algorithms and evaluated\nwith the Continuous Boyce Index (CBI) and a calibrated AUC. Habitat suitability\nscores and their binary transformations were assessed using niche overlap\nindices (Schoener, Warren, and Spearman rank correlation coefficient). Both RS\nand LULC approaches exhibited similar predictive accuracy overall. After\nbinarisation however, the resulting niche maps diverged significantly. While\nLULC-based models exhibited spatial constraints (habitat suitability decreased\nas distance from recorded occurrences increased), RS-based models, which used\ncontinuous data, were not affected by geographic bias or distance effects.\nThese results underscore the need to account for spatial biases in LULC-based\nSDMs. The DHI may offer a more spatially neutral alternative, making it a\npromising predictor for modelling species niches at regional scales."}
