{"id": "2512.22415", "pdf": "https://arxiv.org/pdf/2512.22415", "abs": "https://arxiv.org/abs/2512.22415", "authors": ["Eugenio Simao"], "title": "Hierarchical Preemption: A Novel Information-Theoretic Control Mechanism in Lambda Phage Decision-Making", "categories": ["q-bio.MN"], "comment": "6 pages, 2 figures. Related to arXiv:2512.17106", "summary": "Biological systems organize into hierarchies to manage complexity, yet the mechanisms governing hierarchical control remain incompletely understood. Using information theory and the Lambda phage lysis-lysogeny decision as a model system, we discover that hierarchical control operates through hierarchical preemption - higher layers collapse decision space rather than blocking lower-layer signals. Through mutual information (MI) analysis of 200 stochastic simulations, we demonstrate that the UV damage sensor (RecA) achieves 2.01x information advantage over environmental signals by preempting bistable outcomes into monostable attractors (98% lysogenic or 85% lytic). Conditional MI analysis reveals that the integrator signal (CII) carries lower information when RecA is absent (saturated, 0.06 bits) than when RecA is active (subsaturated, 0.38 bits). This saturation effect demonstrates that signals orchestrate compartment behaviors by removing decision space - achieving 85-98% outcome certainty while preserving 2-15% escape routes. These findings establish a quantitative framework for hierarchical information processing in cellular decision-making."}
{"id": "2512.22225", "pdf": "https://arxiv.org/pdf/2512.22225", "abs": "https://arxiv.org/abs/2512.22225", "authors": ["Xinyang Sun", "Nipon Sarmah", "Miao Guo"], "title": "Literature Mining System for Nutraceutical Biosynthesis: From AI Framework to Biological Insight", "categories": ["q-bio.QM", "cs.AI"], "comment": null, "summary": "The extraction of structured knowledge from scientific literature remains a major bottleneck in nutraceutical research, particularly when identifying microbial strains involved in compound biosynthesis. This study presents a domain-adapted system powered by large language models (LLMs) and guided by advanced prompt engineering techniques to automate the identification of nutraceutical-producing microbes from unstructured scientific text. By leveraging few-shot prompting and tailored query designs, the system demonstrates robust performance across multiple configurations, with DeepSeekV3 outperforming LLaMA2 in accuracy, especially when domain-specific strain information is included. A structured and validated dataset comprising 35 nutraceutical-strain associations was generated, spanning amino acids, fibers, phytochemicals, and vitamins. The results reveal significant microbial diversity across monoculture and co-culture systems, with dominant contributions from Corynebacterium glutamicum, Escherichia coli, and Bacillus subtilis, alongside emerging synthetic consortia. This AI-driven framework not only enhances the scalability and interpretability of literature mining but also provides actionable insights for microbial strain selection, synthetic biology design, and precision fermentation strategies in the production of high-value nutraceuticals."}
{"id": "2512.23531", "pdf": "https://arxiv.org/pdf/2512.23531", "abs": "https://arxiv.org/abs/2512.23531", "authors": ["Marianne Bauer", "William Bialek"], "title": "Ambiguous signals and efficient codes", "categories": ["physics.bio-ph", "q-bio.MN"], "comment": null, "summary": "In many biological networks the responses of individual elements are ambiguous. We consider a scenario in which many sensors respond to a shared signal, each with limited information capacity, and ask that the outputs together convey as much information as possible about an underlying relevant variable. In a low noise limit where we can make analytic progress, we show that individually ambiguous responses optimize overall information transmission."}
{"id": "2512.22257", "pdf": "https://arxiv.org/pdf/2512.22257", "abs": "https://arxiv.org/abs/2512.22257", "authors": ["Dingyi Rong", "Zijian Chen", "Qi Jia", "Kaiwei Zhang", "Haotian Lu", "Guangtao Zhai", "Ning Liu"], "title": "LiveProteinBench: A Contamination-Free Benchmark for Assessing Models' Specialized Capabilities in Protein Science", "categories": ["q-bio.QM"], "comment": null, "summary": "In contrast to their remarkable performance on general knowledge QA, the true abilities of Large Language Models (LLMs) in tasks demanding deep, specialized reasoning, such as in protein biology, have yet to be thoroughly investigated. Current benchmarks suffer from critical deficiencies, such as data contamination due to outdated test sets, insufficient focus on essential protein-specific tasks, and a neglect of multimodal assessments. To resolve these issues, we introduce LiveProteinBench, a contamination-free, multimodal benchmark of 12 tasks for evaluating LLM performance on protein property and function prediction. Its central innovation lies in a test set composed exclusively of proteins validated after the start of 2025, guaranteeing that the data is novel to all tested models. We benchmarked a suite of prominent general-purpose LLMs and specialized biological LLMs using both unimodal and multimodal input schemes. Our results show that: 1) General-purpose proprietary large models demonstrate superior zero-shot performance when encountering new protein data, outperforming their open-source and domain-specific counterparts by over 20\\% accuracy. 2) The effective use of multi-view structural information remains a significant challenge, as the inclusion of structural images often fails to provide a consistent benefit and can even degrade performance. This highlights the limitations of current models in effectively fusing information across different modalities. 3) Models' performance scales more directly with the computational cost during inference than with its parameter count, underscoring the critical role of Chain-of-Thought reasoning capabilities for protein-specific tasks. LiveProteinBench delineates the current performance frontiers for LLMs in bioinformatics and presents new challenges for the development of future multimodal foundation models for biology"}
{"id": "2512.22262", "pdf": "https://arxiv.org/pdf/2512.22262", "abs": "https://arxiv.org/abs/2512.22262", "authors": ["Piotr Keller", "Mark Eastwood", "Zedong Hu", "Aimée Selten", "Ruqayya Awan", "Gertjan Rasschaert", "Sara Verbandt", "Vlad Popovici", "Hubert Piessevaux", "Hayley T Morris", "Petros Tsantoulis", "Thomas Alexander McKee", "André D'Hoore", "Cédric Schraepen", "Xavier Sagaert", "Gert De Hertogh", "Sabine Tejpar", "Fayyaz Minhas"], "title": "INSIGHT: Spatially resolved survival modelling from routine histology crosslinked with molecular profiling reveals prognostic epithelial-immune axes in stage II/III colorectal cancer", "categories": ["q-bio.QM", "cs.LG"], "comment": null, "summary": "Routine histology contains rich prognostic information in stage II/III colorectal cancer, much of which is embedded in complex spatial tissue organisation. We present INSIGHT, a graph neural network that predicts survival directly from routine histology images. Trained and cross-validated on TCGA (n=342) and SURGEN (n=336), INSIGHT produces patient-level spatially resolved risk scores. Large independent validation showed superior prognostic performance compared with pTNM staging (C-index 0.68-0.69 vs 0.44-0.58). INSIGHT spatial risk maps recapitulated canonical prognostic histopathology and identified nuclear solidity and circularity as quantitative risk correlates. Integrating spatial risk with data-driven spatial transcriptomic signatures, spatial proteomics, bulk RNA-seq, and single-cell references revealed an epithelium-immune risk manifold capturing epithelial dedifferentiation and fetal programs, myeloid-driven stromal states including $\\mathrm{SPP1}^{+}$ macrophages and $\\mathrm{LAMP3}^{+}$ dendritic cells, and adaptive immune dysfunction. This analysis exposed patient-specific epithelial heterogeneity, stratification within MSI-High tumours, and high-risk routes of CDX2/HNF4A loss and CEACAM5/6-associated proliferative programs, highlighting coordinated therapeutic vulnerabilities."}
{"id": "2512.22270", "pdf": "https://arxiv.org/pdf/2512.22270", "abs": "https://arxiv.org/abs/2512.22270", "authors": ["Nicolas B. Garnier", "Maria S. Molinet", "Marta C. Antonelli", "Silvia M. Lobmaier", "Martin G. Frasch"], "title": "Measuring the time-scale-dependent information flow between maternal and fetal heartbeats during the third trimester", "categories": ["q-bio.QM", "physics.med-ph"], "comment": "40 pages, 13 tables, 11 figures. GitHub repo coming shortly", "summary": "Prenatal maternal stress alters maternal-fetal heart rate coupling, as demonstrated by the Fetal Stress Index derived from bivariate phase-rectified signal averaging. Here, we extend this framework using information-theoretical measures to elucidate underlying mechanisms. In 120 third-trimester pregnancies (58 stressed, 62 control), we computed transfer entropy (TE), entropy rate (ER), and sample entropy (SE) under multiple conditioning paradigms, employing mixed linear models for repeated measures. We identify dual coupling mechanisms at the short-term (0.5 - 2.5 s), but not long-term (2.5 - 5 s) time scales: (1) stress-invariant state-dependent synchronization, with maternal decelerations exerting approximately 60% coupling strength on fetal heart rate complexity - a fundamental coordination conserved across demographics; and (2) stress-sensitive temporal information transfer (TE), showing exploratory associations with maternal cortisol that require replication. A robust sex-by-stress interaction emerged in TE from mixed models, with exploratory female-specific coupling patterns absent in males. Universal acceleration predominance was observed in both maternal and fetal heart rates, stronger in fetuses and independent of sex or stress. We provide insight into the dependence of these findings on the sampling rate of the underlying data, identifying 4 Hz, commonly used for ultrasound-derived fetal heart rate recordings, as the necessary and sufficient sampling rate regime to capture the information flow. Information-theoretical analysis reveals that maternal-fetal coupling operates through complementary pathways with differential stress sensitivity, extending the Fetal Stress Index by elucidating causal foundations. Future studies should explore additional information-theoretical conditional approaches to resolve stress-specific and time-scale-specific differences in information flow."}
{"id": "2512.23554", "pdf": "https://arxiv.org/pdf/2512.23554", "abs": "https://arxiv.org/abs/2512.23554", "authors": ["Armin Shoushtarizadeh", "Michele Cerminara", "Corinne Chureau", "Leah Friedman", "Deepthi Kailash", "Thomas Gregor"], "title": "An integrated quantitative single-objective light-sheet microscope for subcellular dynamics in embryos and cultured multicellular systems", "categories": ["q-bio.QM", "physics.bio-ph", "physics.ins-det", "physics.optics"], "comment": null, "summary": "Quantitative imaging of subcellular processes in living embryos, stem-cell systems, and organoid models requires microscopy platforms that combine high spatial resolution, fast volumetric acquisition, long-term stability, and minimal phototoxicity. Single-objective light-sheet approaches based on oblique plane microscopy (OPM) are well suited for live imaging in standard sample geometries, but most existing implementations lack the optical calibration, timing precision, and end-to-end integration required for reproducible quantitative measurements. Here we present a fully integrated and quantitatively characterized OPM platform engineered for dynamic studies of transcription and nuclear organization in embryos, embryonic stem cells, and three-dimensional culture systems. The system combines high numerical aperture remote refocusing with tilt-invariant light-sheet scanning and hardware-timed synchronization of laser excitation, galvo scanning, and camera readout. We provide a comprehensive characterization of the optical performance, including point spread function, sampling geometry, usable field of view, and system stability, establishing a well-defined framework for quantitative volumetric imaging. To support high-throughput operation, we developed a unified acquisition and reconstruction pipeline that enables real time volumetric imaging at hardware-limited rates while preserving deterministic timing and reproducible geometry. Using this platform, we demonstrate quantitative three-dimensional imaging of MS2-labeled transcription sites in living Drosophila embryos, cultured mouse embryonic stem cells, and mESC-derived gastruloids, enabling extraction of transcriptional intensity traces across diverse biological contexts. This work establishes OPM as a robust and quantitatively calibrated single-objective light-sheet platform for transcription imaging in complex living systems."}
{"id": "2512.22651", "pdf": "https://arxiv.org/pdf/2512.22651", "abs": "https://arxiv.org/abs/2512.22651", "authors": ["Manlio De Domenico"], "title": "Decoding the Architecture of Living Systems", "categories": ["physics.bio-ph", "cond-mat.dis-nn", "physics.app-ph", "q-bio.QM"], "comment": "40 pages, 7 figures, 391 references", "summary": "The possibility that evolutionary forces -- together with a few fundamental factors such as thermodynamic constraints, specific computational features enabling information processing, and ecological processes -- might constrain the logic of living systems is tantalizing. However, it is often overlooked that any practical implementation of such a logic requires complementary circuitry that, in biological systems, happens through complex networks of genetic regulation, metabolic reactions, cellular signalling, communication, social and eusocial non-trivial organization. We review and discuss how circuitries are not merely passive structures, but active agents of change that, by means of hierarchical and modular organization, are able to enhance and catalyze the evolution of evolvability. Using statistical physics to analyze the role of non-trivial topologies in major evolutionary transitions, we show that biological innovations are related to deviation from trivial structures and (thermo)dynamic equilibria.\n  We argue that sparse heterogeneous networks such as hierarchical modular, which are ubiquitously observed in nature, are favored in terms of the trade-off between energetic costs for redundancy, error-correction and maintainance. We identify three main features -- namely, interconnectivity, plasticity and interdependency -- pointing towards a unifying framework for modeling the phenomenology, discussing them in terms of dynamical systems theory, non-equilibrium thermodynamics and evolutionary dynamics. Within this unified picture, we also show that slow evolutionary dynamics is an emergent phenomenon governed by the replicator-mutator equation as the direct consequence of a constrained variational nonequilibrium process. Overall, this work highlights how dynamical systems theory and nonequilibrium thermodynamics provide powerful analytical techniques to study biological complexity."}
{"id": "2512.22868", "pdf": "https://arxiv.org/pdf/2512.22868", "abs": "https://arxiv.org/abs/2512.22868", "authors": ["Matej Hoffmann"], "title": "The body is not there to compute: Comment on \"Informational embodiment: Computational role of information structure in codes and robots\" by Pitti et al", "categories": ["cs.RO", "cs.AI", "q-bio.NC", "q-bio.QM"], "comment": "Comment on Pitti, A., Austin, M., Nakajima, K., & Kuniyoshi, Y. (2025). Informational Embodiment: Computational role of information structure in codes and robots. Physics of Life Reviews 53, 262-276. https://doi.org/10.1016/j.plrev.2025.03.018. Also available as arXiv:2408.12950", "summary": "Applying the lens of computation and information has been instrumental in driving the technological progress of our civilization as well as in empowering our understanding of the world around us. The digital computer was and for many still is the leading metaphor for how our mind operates. Information theory (IT) has also been important in our understanding of how nervous systems encode and process information. The target article deploys information and computation to bodies: to understand why they have evolved in particular ways (animal bodies) and to design optimal bodies (robots). In this commentary, I argue that the main role of bodies is not to compute."}
{"id": "2512.23080", "pdf": "https://arxiv.org/pdf/2512.23080", "abs": "https://arxiv.org/abs/2512.23080", "authors": ["Tim C. Pearce", "Ahmed Ibrahim"], "title": "QSAR-Guided Generative Framework for the Discovery of Synthetically Viable Odorants", "categories": ["physics.chem-ph", "cs.LG", "q-bio.BM", "q-bio.QM"], "comment": null, "summary": "The discovery of novel odorant molecules is key for the fragrance and flavor industries, yet efficiently navigating the vast chemical space to identify structures with desirable olfactory properties remains a significant challenge. Generative artificial intelligence offers a promising approach for \\textit{de novo} molecular design but typically requires large sets of molecules to learn from. To address this problem, we present a framework combining a variational autoencoder (VAE) with a quantitative structure-activity relationship (QSAR) model to generate novel odorants from limited training sets of odor molecules. The self-supervised learning capabilities of the VAE allow it to learn SMILES grammar from ChemBL database, while its training objective is augmented with a loss term derived from an external QSAR model to structure the latent representation according to odor probability. While the VAE demonstrated high internal consistency in learning the QSAR supervision signal, validation against an external, unseen ground truth dataset (Unique Good Scents) confirms the model generates syntactically valid structures (100\\% validity achieved via rejection sampling) and 94.8\\% unique structures. The latent space is effectively structured by odor likelihood, evidenced by a Fréchet ChemNet Distance (FCD) of $\\approx$ 6.96 between generated molecules and known odorants, compared to $\\approx$ 21.6 for the ChemBL baseline. Structural analysis via Bemis-Murcko scaffolds reveals that 74.4\\% of candidates possess novel core frameworks distinct from the training data, indicating the model performs extensive chemical space exploration beyond simple derivatization of known odorants. Generated candidates display physicochemical properties ...."}
