{"id": "2506.10271", "pdf": "https://arxiv.org/pdf/2506.10271", "abs": "https://arxiv.org/abs/2506.10271", "authors": ["Shiyu Jiang", "Xuyin Liu", "Zitong Jerry Wang"], "title": "Predicting function of evolutionarily implausible DNA sequences", "categories": ["q-bio.QM", "cs.LG", "q-bio.GN"], "comment": "13 pages, 6 figures, accepted to ICML 2025 Generative AI and Biology\n  Workshop", "summary": "Genomic language models (gLMs) show potential for generating novel,\nfunctional DNA sequences for synthetic biology, but doing so requires them to\nlearn not just evolutionary plausibility, but also sequence-to-function\nrelationships. We introduce a set of prediction tasks called Nullsettes, which\nassesses a model's ability to predict loss-of-function mutations created by\ntranslocating key control elements in synthetic expression cassettes. Across 12\nstate-of-the-art models, we find that mutation effect prediction performance\nstrongly correlates with the predicted likelihood of the nonmutant.\nFurthermore, the range of likelihood values predictive of strong model\nperformance is highly dependent on sequence length. Our work highlights the\nimportance of considering both sequence likelihood and sequence length when\nusing gLMs for mutation effect prediction."}
{"id": "2506.10886", "pdf": "https://arxiv.org/pdf/2506.10886", "abs": "https://arxiv.org/abs/2506.10886", "authors": ["Steven Vasquez-Grinnell", "Alex Poliakov"], "title": "S3 Mirror: S3Mirror: Making Genomic Data Transfers Fast, Reliable, and Observable with DBOS", "categories": ["cs.DB", "q-bio.GN"], "comment": null, "summary": "To meet the needs of a large pharmaceutical organization, we set out to\ncreate S3Mirror - an application for transferring large genomic sequencing\ndatasets between S3 buckets quickly, reliably, and observably. We used the\nDBOSTransact durable execution framework to achieve these goals and benchmarked\nthe performance and cost of the application. S3Mirror is an open source DBOS\nPython application that can run in a variety of environments, including DBOS\nCloud Pro where it runs as much as 40x faster than AWS DataSync at a fraction\nof the cost. Moreover, S3Mirror is resilient to failures and allows for\nreal-time filewise observability of ongoing and past transfers."}
{"id": "2506.10931", "pdf": "https://arxiv.org/pdf/2506.10931", "abs": "https://arxiv.org/abs/2506.10931", "authors": ["Melina Soysal", "Konstantina Koliogeorgi", "Can Firtina", "Nika Mansouri Ghiasi", "Rakesh Nadig", "Haiyu Mayo", "Geraldo F. Oliveira", "Yu Liang", "Klea Zambaku", "Mohammad Sadrosadati", "Onur Mutlu"], "title": "MARS: Processing-In-Memory Acceleration of Raw Signal Genome Analysis Inside the Storage Subsystem", "categories": ["cs.AR", "q-bio.GN"], "comment": null, "summary": "Raw signal genome analysis (RSGA) has emerged as a promising approach to\nenable real-time genome analysis by directly analyzing raw electrical signals.\nHowever, rapid advancements in sequencing technologies make it increasingly\ndifficult for software-based RSGA to match the throughput of raw signal\ngeneration. This paper demonstrates that while hardware acceleration techniques\ncan significantly accelerate RSGA, the high volume of genomic data shifts the\nperformance and energy bottleneck from computation to I/O data movement. As\nsequencing throughput increases, I/O overhead becomes the main contributor to\nboth runtime and energy consumption. Therefore, there is a need to design a\nhigh-performance, energy-efficient system for RSGA that can both alleviate the\ndata movement bottleneck and provide large acceleration capabilities. We\npropose MARS, a storage-centric system that leverages the heterogeneous\nresources within modern storage systems (e.g., storage-internal DRAM, storage\ncontroller, flash chips) alongside their large storage capacity to tackle both\ndata movement and computational overheads of RSGA in an area-efficient and\nlow-cost manner. MARS accelerates RSGA through a novel hardware/software\nco-design approach. First, MARS modifies the RSGA pipeline via two filtering\nmechanisms and a quantization scheme, reducing hardware demands and optimizing\nfor in-storage execution. Second, MARS accelerates the RSGA steps directly\nwithin the storage by leveraging both Processing-Near-Memory and\nProcessing-Using-Memory paradigms. Third, MARS orchestrates the execution of\nall steps to fully exploit in-storage parallelism and minimize data movement.\nOur evaluation shows that MARS outperforms basecalling-based software and\nhardware-accelerated state-of-the-art read mapping pipelines by 93x and 40x, on\naverage across different datasets, while reducing their energy consumption by\n427x and 72x."}
{"id": "2506.10031", "pdf": "https://arxiv.org/pdf/2506.10031", "abs": "https://arxiv.org/abs/2506.10031", "authors": ["Olga Ovcharenko", "Florian Barkmann", "Philip Toma", "Imant Daunhawer", "Julia Vogt", "Sebastian Schelter", "Valentina Boeva"], "title": "scSSL-Bench: Benchmarking Self-Supervised Learning for Single-Cell Data", "categories": ["q-bio.QM", "cs.LG"], "comment": "Accepted at ICML 2025 (Spotlight)", "summary": "Self-supervised learning (SSL) has proven to be a powerful approach for\nextracting biologically meaningful representations from single-cell data. To\nadvance our understanding of SSL methods applied to single-cell data, we\npresent scSSL-Bench, a comprehensive benchmark that evaluates nineteen SSL\nmethods. Our evaluation spans nine datasets and focuses on three common\ndownstream tasks: batch correction, cell type annotation, and missing modality\nprediction. Furthermore, we systematically assess various data augmentation\nstrategies. Our analysis reveals task-specific trade-offs: the specialized\nsingle-cell frameworks, scVI, CLAIRE, and the finetuned scGPT excel at\nuni-modal batch correction, while generic SSL methods, such as VICReg and\nSimCLR, demonstrate superior performance in cell typing and multi-modal data\nintegration. Random masking emerges as the most effective augmentation\ntechnique across all tasks, surpassing domain-specific augmentations. Notably,\nour results indicate the need for a specialized single-cell multi-modal data\nintegration framework. scSSL-Bench provides a standardized evaluation platform\nand concrete recommendations for applying SSL to single-cell analysis,\nadvancing the convergence of deep learning and single-cell genomics."}
{"id": "2506.10040", "pdf": "https://arxiv.org/pdf/2506.10040", "abs": "https://arxiv.org/abs/2506.10040", "authors": ["Shoshana Elgart", "Mark B. Flegg", "Jennifer A. Flegg"], "title": "Evaluating interventions for Plasmodium vivax forest malaria using a three-scale mathematical model", "categories": ["q-bio.QM", "math.DS", "q-bio.PE"], "comment": "40 pages, 8 figures", "summary": "The rising proportion of Plasmodium vivax cases concentrated in forest-fringe\nareas across the Greater Mekong Subregion highlights the importance of\npharmaceutical and mosquito control techniques specifically targeted towards\nforest-going populations. To mathematically assess best-possible antimalarial\ninterventions in the context of hypnozoite reactivation and seasonal forest\nmigration, we extend a previously developed three-scale integro-differential\nequations model of P. vivax transmission. In particular, we fit the model to\ndata gathered over a four-year period in Vietnam to gain insight into local P.\nvivax dynamics and validate the model's ability to capture epidemiological\ntrends. The calibrated model is then used to generate optimal schedules for\nmass-drug administration (MDA) in forest-goers and gauge the efficacy of vector\ncontrol techniques (such as long-lasting insecticide nets and indoor residual\nspraying) in forest-adjacent areas. Our results highlight the dependence of\noptimal MDA timing on the demographics of the human population, the importance\nof interventions targeting the mosquito bite rate, and the need for efficacy in\nhypnozoite-targeting antimalarial drugs."}
{"id": "2506.10134", "pdf": "https://arxiv.org/pdf/2506.10134", "abs": "https://arxiv.org/abs/2506.10134", "authors": ["Lucas Wilken", "Nihjum Paul", "Troy Timmerman", "Sara A. Tolba", "Amara Arshad", "Di Wu", "Wenjie Xia", "Bakhtiyor Rasulev", "Rick Jansen", "Dali Sun"], "title": "FAPS: A Fast Platform for Protein Structureomics Analysis", "categories": ["q-bio.QM"], "comment": "16 Pages, 5 figures", "summary": "Protein quantification and analysis are well-accepted approaches for\nbiomarker discovery but are limited to identification without structural\ninformation. High-throughput omics data (i.e., genomics, transcriptomics, and\nproteomics) have become pervasive in cancer biology studies and reach well\nbeyond more specialized areas such as metabolomics, epigenomics,\npharmacogenomics, and interact-omics. However, large-scale analysis based on\nthe structure of the biomolecules, namely structure-omics, is still\nunderexplored due to a lack of handy tools. In response, we developed the Fast\nAnalysis of Protein Structure (FAPS) database, a platform designed to advance\nquantitative proteomics to structure-omics analysis, which significantly\nshortens large-scale structure-omics from weeks to seconds. FAPS can serve as a\nnew protein secondary structure database, providing a centralized and\nfunctional database for both simulated and experimentally determined\nbioinformatics statistics relating to secondary structure. Stored data is\ngenerated both through the structure simulation, currently SWISS-MODEL and\nAlphaFold, performed by high-performance computers, and the pre-existing\nUniProt database. FAPS provides user-friendly features that create a\nstraightforward and effective way of accessing accurate data on the proportion\nof secondary structure in different protein chains, providing a fast numerical\nand visual reference for protein structure calculations and analysis. FAPS is\naccessible through http://fapsdb.org."}
{"id": "2506.10271", "pdf": "https://arxiv.org/pdf/2506.10271", "abs": "https://arxiv.org/abs/2506.10271", "authors": ["Shiyu Jiang", "Xuyin Liu", "Zitong Jerry Wang"], "title": "Predicting function of evolutionarily implausible DNA sequences", "categories": ["q-bio.QM", "cs.LG", "q-bio.GN"], "comment": "13 pages, 6 figures, accepted to ICML 2025 Generative AI and Biology\n  Workshop", "summary": "Genomic language models (gLMs) show potential for generating novel,\nfunctional DNA sequences for synthetic biology, but doing so requires them to\nlearn not just evolutionary plausibility, but also sequence-to-function\nrelationships. We introduce a set of prediction tasks called Nullsettes, which\nassesses a model's ability to predict loss-of-function mutations created by\ntranslocating key control elements in synthetic expression cassettes. Across 12\nstate-of-the-art models, we find that mutation effect prediction performance\nstrongly correlates with the predicted likelihood of the nonmutant.\nFurthermore, the range of likelihood values predictive of strong model\nperformance is highly dependent on sequence length. Our work highlights the\nimportance of considering both sequence likelihood and sequence length when\nusing gLMs for mutation effect prediction."}
{"id": "2506.10879", "pdf": "https://arxiv.org/pdf/2506.10879", "abs": "https://arxiv.org/abs/2506.10879", "authors": ["Pratik Worah"], "title": "A Goemans-Williamson type algorithm for identifying subcohorts in clinical trials", "categories": ["q-bio.QM", "cs.LG"], "comment": null, "summary": "We design an efficient algorithm that outputs a linear classifier for\nidentifying homogeneous subsets (equivalently subcohorts) from large\ninhomogeneous datasets. Our theoretical contribution is a rounding technique,\nsimilar to that of Goemans and Williamson (1994), that approximates the optimal\nsolution of the underlying optimization problem within a factor of $0.82$. As\nan application, we use our algorithm to design a simple test that can identify\nhomogeneous subcohorts of patients, that are mainly comprised of metastatic\ncases, from the RNA microarray dataset for breast cancer by Curtis et al.\n(2012). Furthermore, we also use the test output by the algorithm to\nsystematically identify subcohorts of patients in which statistically\nsignificant changes in methylation levels of tumor suppressor genes co-occur\nwith statistically significant changes in nuclear receptor expression.\nIdentifying such homogeneous subcohorts of patients can be useful for the\ndiscovery of disease pathways and therapeutics, specific to the subcohort."}
{"id": "2506.10179", "pdf": "https://arxiv.org/pdf/2506.10179", "abs": "https://arxiv.org/abs/2506.10179", "authors": ["Hamzah Dabool", "Raghad Mustafa"], "title": "Correlation vs causation in Alzheimer's disease: an interpretability-driven study", "categories": ["cs.AI", "q-bio.QM", "stat.AP"], "comment": null, "summary": "Understanding the distinction between causation and correlation is critical\nin Alzheimer's disease (AD) research, as it impacts diagnosis, treatment, and\nthe identification of true disease drivers. This experiment investigates the\nrelationships among clinical, cognitive, genetic, and biomarker features using\na combination of correlation analysis, machine learning classification, and\nmodel interpretability techniques. Employing the XGBoost algorithm, we\nidentified key features influencing AD classification, including cognitive\nscores and genetic risk factors. Correlation matrices revealed clusters of\ninterrelated variables, while SHAP (SHapley Additive exPlanations) values\nprovided detailed insights into feature contributions across disease stages.\nOur results highlight that strong correlations do not necessarily imply\ncausation, emphasizing the need for careful interpretation of associative data.\nBy integrating feature importance and interpretability with classical\nstatistical analysis, this work lays groundwork for future causal inference\nstudies aimed at uncovering true pathological mechanisms. Ultimately,\ndistinguishing causal factors from correlated markers can lead to improved\nearly diagnosis and targeted interventions for Alzheimer's disease."}
