{"id": "2507.18832", "pdf": "https://arxiv.org/pdf/2507.18832", "abs": "https://arxiv.org/abs/2507.18832", "authors": ["Oluwafemi Ogundare"], "title": "An Immune Infiltration-Based Risk Scoring System for Prognostic Stratification in Colorectal Adenocarcinoma", "categories": ["q-bio.QM"], "comment": "12 pages, 7 figures", "summary": "Background: Colorectal adenocarcinoma (CRC) remains a leading cause of\ncancer-related mortality worldwide, with variable patient outcomes despite\ntreatment advances. Traditional prognostic methods based on clinicopathological\nvariables alone do not fully capture the biological complexity of the disease.\nThis study aims to develop a risk scoring system based on genes associated with\ntumor-infiltrating immune cells (TIIC-associated genes) to improve prognostic\nassessment in CRC.\n  Methods: RNA-seq gene expression and clinicopathological data from TCGA-CRC\n(647 tumor samples, 51 normal tissues) were analyzed to identify differentially\nexpressed TIIC-associated genes through comparison with the CIBERSORTx\ndatabase. Univariate and multivariate Cox analyses were performed to screen for\nprognostic markers. A Gaussian mixture model was applied to cluster prognostic\nmodels and select the model with the most robust gene combination. The\nresulting risk scoring system was validated in an external cohort (GSE39582)\nand integrated with clinicopathological variables to develop a prognostic\nnomogram.\n  Results: From 128 TIIC-associated genes, an optimal prognostic model\ncomprising CCL8 and TYR was identified. The risk score was calculated as\n0.152*Exp(CCL8) - 0.516*Exp(TYR). Kaplan-Meier analysis confirmed significant\nsurvival differences between high-risk and low-risk groups in both TCGA-CRC (p\n< 0.05) and GSE39582 (p < 0.05). Time-dependent ROC analysis showed AUC values\nranging from 0.605 to 0.696 for 1-year, 3-year, and 5-year survival in TCGA-CRC\nand GSE39582. Multivariate Cox analysis identified TNM_T, TNM_N, and risk score\nas independent prognostic factors.\n  Conclusion: Our risk scoring system based on CCL8 and TYR effectively\nstratifies CRC patients into distinct prognostic groups and could guide\ntreatment decisions, particularly when integrated with TNM staging in a\nnomogram."}
{"id": "2507.19314", "pdf": "https://arxiv.org/pdf/2507.19314", "abs": "https://arxiv.org/abs/2507.19314", "authors": ["Seol Ah Park", "Giulia Lupi", "Resul Ozbilgic", "Michal Kollar", "Aneta A. Ozvat", "Mai Nguyen-Chi", "Karol Mikula"], "title": "The Morpho-Kinetic Landscape of Macrophage Modes During Wound Healing in Zebrafish", "categories": ["q-bio.QM"], "comment": null, "summary": "Macrophages play an essential role in wound healing due to their dynamic\nnature and functional plasticity, exhibiting highly heterogeneous\nmorpho-kinetic behaviors depending on their activation states. However,\nquantitative analysis of macrophage behavior in in vivo settings remains\nlimited, largely due to the complexity of their diverse morphologies and\nmotility patterns over time. In this study, we present an analytic workflow to\ninvestigate macrophage dynamics in zebrafish. By computing a comprehensive set\nof morpho-kinetic features, we observe that M1 (pro-inflammatory) and M2\n(anti-inflammatory) macrophages exhibit distinct behaviors, such as reduced\nshape elongation, more directed movement, and less random-like motion in M1\ncompared to M2 macrophages. Based on these features, we classify macrophages in\nthe transition period into M1-like and M2-like groups. We compare and analyze\ntheir behaviors, which allows us to estimate the timing of the phenotypic\nswitch. In addition, macrophages not expressing Tumor Necrosis Factor (TNF) are\nlocated significantly farther from the wound compared to M1 macrophages. While\nmacrophages unstimulated by wound signaling exhibit some M2-like features, they\ndiffer notably in shape elongation and migration speed. In summary, this study\nprovides a quantitative analysis of macrophage behavior during wound healing\nand suggests distinct behavioral landscapes across different macrophage\nactivation states."}
{"id": "2507.19331", "pdf": "https://arxiv.org/pdf/2507.19331", "abs": "https://arxiv.org/abs/2507.19331", "authors": ["Laila Kazimierski", "Guillermo Abramson", "Nicolás Catalano"], "title": "Design of radiotelemetry systems for animal tracking", "categories": ["q-bio.QM"], "comment": "16 pages", "summary": "We describe the design and implementation of two low-cost, low-weight,\nradiotelemetry systems to measure the movement of small animals in a dense\nforest, where satellite positioning systems are unreliable and the attenuation\nof the vegetation poses several challenges. Both methods use stationary\nreceiving stations that record the signal emitted by a portable transmitter\ncarried by the animal. One of the methods measures the received power, while\nthe other one registers the phase difference received by two-antennas stations.\nThe later overcomes several difficulties that exist in the determination of the\ndistance by the power method. We used our system to record the movement of\nDromiciops gliroides, a vulnerable South American marsupial native of the\nPatagonian Andes, where it plays an important role in the ecosystem."}
{"id": "2507.18850", "pdf": "https://arxiv.org/pdf/2507.18850", "abs": "https://arxiv.org/abs/2507.18850", "authors": ["Nicholas Dwork", "Jeremy W. Gordon", "Shuyu Tang", "Peder E. Z. Larson"], "title": "Estimating Sensitivity Maps for X-Nuclei Magnetic Resonance Spectroscopic Imaging", "categories": ["eess.IV", "physics.med-ph", "q-bio.QM"], "comment": null, "summary": "The purpose of this research is to estimate sensitivity maps when imaging\nX-nuclei that may not have a significant presence throughout the field of view.\nWe propose to estimate the coil's sensitivities by solving a least-squares\nproblem where each row corresponds to an individual estimate of the sensitivity\nfor a given voxel. Multiple estimates come from the multiple bins of the\nspectrum with spectroscopy, multiple times with dynamic imaging, or multiple\nfrequencies when utilizing spectral excitation. The method presented in this\nmanuscript, called the L2 optimal method, is compared to the commonly used\nRefPeak method which uses the spectral bin with the highest energy to estimate\nthe sensitivity maps. The L2 optimal method yields more accurate sensitivity\nmaps when imaging a numerical phantom and is shown to yield a higher\nsignal-to-noise ratio when imaging the brain, pancreas, and heart with\nhyperpolarized pyruvate as the contrast agent with hyperpolarized MRI. The L2\noptimal method is able to better estimate the sensitivity by extracting more\ninformation from the measurements."}
