{"id": "2510.16013", "pdf": "https://arxiv.org/pdf/2510.16013", "abs": "https://arxiv.org/abs/2510.16013", "authors": ["Jahidul Arafat", "Sanjaya Poudel", "Fariha Tasmin", "Md Kaosar Uddin", "Eftakhar Ahmed Arnob"], "title": "AGNES: Adaptive Graph Neural Network and Dynamic Programming Hybrid Framework for Real-Time Nanopore Seed Chaining", "categories": ["q-bio.GN", "cs.LG", "92D20, 68T05, 62P10", "I.2.6; J.3; H.2.8; I.5"], "comment": "31 pages, 12 figures, 6 tables. Submitted to ACM Conference on\n  Bioinformatics, Computational Biology, and Health Informatics (ACM-BCB).\n  Includes comprehensive evaluation with statistical validation, ablation\n  studies, and open-source implementation", "summary": "Nanopore sequencing enables real-time long-read DNA sequencing with reads\nexceeding 10 kilobases, but inherent error rates of 12-15 percent present\nsignificant computational challenges for read alignment. The critical seed\nchaining step must connect exact k-mer matches between reads and reference\ngenomes while filtering spurious matches, yet state-of-the-art methods rely on\nfixed gap penalty functions unable to adapt to varying genomic contexts\nincluding tandem repeats and structural variants. This paper presents RawHash3,\na hybrid framework combining graph neural networks with classical dynamic\nprogramming for adaptive seed chaining that maintains real-time performance\nwhile providing statistical guarantees. We formalize seed chaining as graph\nlearning where seeds constitute nodes with 12-dimensional feature vectors and\nedges encode 8-dimensional spatial relationships including gap consistency. Our\narchitecture employs three-layer EdgeConv GNN with confidence-based method\nselection that dynamically switches between learned guidance and algorithmic\nfallback. Comprehensive evaluation on 1,000 synthetic nanopore reads with 5,200\ntest seeds demonstrates RawHash3 achieves 99.94 percent precision and 40.07\npercent recall, representing statistically significant 25.0 percent relative\nimprovement over baseline with p less than 0.001. The system maintains median\ninference latency of 1.59ms meeting real-time constraints, while demonstrating\nsuperior robustness with 100 percent success rate under 20 percent label\ncorruption versus baseline degradation to 30.3 percent. Cross-validation\nconfirms stability establishing graph neural networks as viable approach for\nproduction genomics pipelines."}
{"id": "2510.16093", "pdf": "https://arxiv.org/pdf/2510.16093", "abs": "https://arxiv.org/abs/2510.16093", "authors": ["Md. Imtyaz Ahmed", "Md. Delwar Hossain", "Md Mostafizer Rahman", "Md. Ahsan Habib", "Md. Mamunur Rashid", "Md. Selim Reza", "Md Ashad Alam"], "title": "Identifying multi-omics interactions for lung cancer drug targets discovery using Kernel Machine Regression", "categories": ["q-bio.GN", "cs.LG"], "comment": null, "summary": "Cancer exhibits diverse and complex phenotypes driven by multifaceted\nmolecular interactions. Recent biomedical research has emphasized the\ncomprehensive study of such diseases by integrating multi-omics datasets\n(genome, proteome, transcriptome, epigenome). This approach provides an\nefficient method for identifying genetic variants associated with cancer and\noffers a deeper understanding of how the disease develops and spreads. However,\nit is challenging to comprehend complex interactions among the features of\nmulti-omics datasets compared to single omics. In this paper, we analyze lung\ncancer multi-omics datasets from The Cancer Genome Atlas (TCGA). Using four\nstatistical methods, LIMMA, the T test, Canonical Correlation Analysis (CCA),\nand the Wilcoxon test, we identified differentially expressed genes across gene\nexpression, DNA methylation, and miRNA expression data. We then integrated\nthese multi-omics data using the Kernel Machine Regression (KMR) approach. Our\nfindings reveal significant interactions among the three omics: gene\nexpression, miRNA expression, and DNA methylation in lung cancer. From our data\nanalysis, we identified 38 genes significantly associated with lung cancer.\nFrom our data analysis, we identified 38 genes significantly associated with\nlung cancer. Among these, eight genes of highest ranking (PDGFRB, PDGFRA,\nSNAI1, ID1, FGF11, TNXB, ITGB1, ZIC1) were highlighted by rigorous statistical\nanalysis. Furthermore, in silico studies identified three top-ranked potential\ncandidate drugs (Selinexor, Orapred, and Capmatinib) that could play a crucial\nrole in the treatment of lung cancer. These proposed drugs are also supported\nby the findings of other independent studies, which underscore their potential\nefficacy in the fight against lung cancer."}
{"id": "2510.16824", "pdf": "https://arxiv.org/pdf/2510.16824", "abs": "https://arxiv.org/abs/2510.16824", "authors": ["Yingxu Wang", "Kunyu Zhang", "Jiaxin Huang", "Nan Yin", "Siwei Liu", "Eran Segal"], "title": "ProtoMol: Enhancing Molecular Property Prediction via Prototype-Guided Multimodal Learning", "categories": ["cs.LG", "q-bio.MN"], "comment": null, "summary": "Multimodal molecular representation learning, which jointly models molecular\ngraphs and their textual descriptions, enhances predictive accuracy and\ninterpretability by enabling more robust and reliable predictions of drug\ntoxicity, bioactivity, and physicochemical properties through the integration\nof structural and semantic information. However, existing multimodal methods\nsuffer from two key limitations: (1) they typically perform cross-modal\ninteraction only at the final encoder layer, thus overlooking hierarchical\nsemantic dependencies; (2) they lack a unified prototype space for robust\nalignment between modalities. To address these limitations, we propose\nProtoMol, a prototype-guided multimodal framework that enables fine-grained\nintegration and consistent semantic alignment between molecular graphs and\ntextual descriptions. ProtoMol incorporates dual-branch hierarchical encoders,\nutilizing Graph Neural Networks to process structured molecular graphs and\nTransformers to encode unstructured texts, resulting in comprehensive\nlayer-wise representations. Then, ProtoMol introduces a layer-wise\nbidirectional cross-modal attention mechanism that progressively aligns\nsemantic features across layers. Furthermore, a shared prototype space with\nlearnable, class-specific anchors is constructed to guide both modalities\ntoward coherent and discriminative representations. Extensive experiments on\nmultiple benchmark datasets demonstrate that ProtoMol consistently outperforms\nstate-of-the-art baselines across a variety of molecular property prediction\ntasks."}
{"id": "2510.15939", "pdf": "https://arxiv.org/pdf/2510.15939", "abs": "https://arxiv.org/abs/2510.15939", "authors": ["Shreya Gopalan", "Sundar Narayanan"], "title": "Hallucinations in AlphaFold3 for Intrinsically Disordered Proteins with disorder in Biological Process Residues", "categories": ["q-bio.QM"], "comment": "10 pages", "summary": "Protein structure prediction has advanced significantly with the introduction\nof AlphaFold3, a diffusion-based model capable of predicting complex\nbiomolecular interactions across proteins, nucleic acids, small molecules, and\nions. While AlphaFold3 demonstrates high accuracy in folded proteins, its\nperformance on intrinsically disordered proteins (IDPs), which comprise 30 to\n40 percent of the human proteome and play critical roles in transcription,\nsignaling, and disease, remains less explored. This study evaluated\nAlphaFold3's predictions of IDPs with a focus on intrinsically disordered\nregions (IDRs) using 72 proteins curated from the DisProt database. Predictions\nwere generated across multiple random seeds and ensemble outputs, and\nresidue-level pLDDT scores were compared with experimental disorder\nannotations. Our analysis reveals that 32 percent of residues are misaligned\nwith DisProt, with percent representing hallucinations where AlphaFold3\nincorrectly predicts order in disordered regions or vice versa. Additionally,\n10 percent of residues exhibited context-driven misalignment, suggesting that\nAlphaFold3 implicitly incorporates stable structural assumptions. Importantly,\n18 percent of residues associated with biological processes showed\nhallucinations, raising concerns about downstream implications in drug\ndiscovery and disease research. These findings highlight the limitations of\nAlphaFold3 in modeling IDRs, the need for refined hallucination metrics beyond\nthe pLDDT, and the importance of integrating experimental disorder data to\nimprove prediction reliability."}
{"id": "2510.16080", "pdf": "https://arxiv.org/pdf/2510.16080", "abs": "https://arxiv.org/abs/2510.16080", "authors": ["Kerem Delikoyun", "Qianyu Chen", "Win Sen Kuan", "John Tshon Yit Soong", "Matthew Edward Cove", "Oliver Hayden"], "title": "TriAgent: Automated Biomarker Discovery with Deep Research Grounding for Triage in Acute Care by LLM-Based Multi-Agent Collaboration", "categories": ["q-bio.QM", "cs.AI"], "comment": null, "summary": "Emergency departments worldwide face rising patient volumes, workforce\nshortages, and variability in triage decisions that threaten the delivery of\ntimely and accurate care. Current triage methods rely primarily on vital signs,\nroutine laboratory values, and clinicians' judgment, which, while effective,\noften miss emerging biological signals that could improve risk prediction for\ninfection typing or antibiotic administration in acute conditions. To address\nthis challenge, we introduce TriAgent, a large language model (LLM)-based\nmulti-agent framework that couples automated biomarker discovery with deep\nresearch for literature-grounded validation and novelty assessment. TriAgent\nemploys a supervisor research agent to generate research topics and delegate\ntargeted queries to specialized sub-agents for evidence retrieval from various\ndata sources. Findings are synthesized to classify biomarkers as either\ngrounded in existing knowledge or flagged as novel candidates, offering\ntransparent justification and highlighting unexplored pathways in acute care\nrisk stratification. Unlike prior frameworks limited to existing routine\nclinical biomarkers, TriAgent aims to deliver an end-to-end framework from data\nanalysis to literature grounding to improve transparency, explainability and\nexpand the frontier of potentially actionable clinical biomarkers. Given a\nuser's clinical query and quantitative triage data, TriAgent achieved a topic\nadherence F1 score of 55.7 +/- 5.0%, surpassing the CoT-ReAct agent by over\n10%, and a faithfulness score of 0.42 +/- 0.39, exceeding all baselines by more\nthan 50%. Across experiments, TriAgent consistently outperformed\nstate-of-the-art LLM-based agentic frameworks in biomarker justification and\nliterature-grounded novelty assessment. We share our repo:\nhttps://github.com/CellFace/TriAgent."}
{"id": "2510.16082", "pdf": "https://arxiv.org/pdf/2510.16082", "abs": "https://arxiv.org/abs/2510.16082", "authors": ["Elias Hossain", "Mehrdad Shoeibi", "Ivan Garibay", "Niloofar Yousefi"], "title": "Interpretable RNA-Seq Clustering with an LLM-Based Agentic Evidence-Grounded Framework", "categories": ["q-bio.QM", "cs.AI", "cs.LG"], "comment": null, "summary": "We propose CITE V.1, an agentic, evidence-grounded framework that leverages\nLarge Language Models (LLMs) to provide transparent and reproducible\ninterpretations of RNA-seq clusters. Unlike existing enrichment-based\napproaches that reduce results to broad statistical associations and LLM-only\nmodels that risk unsupported claims or fabricated citations, CITE V.1\ntransforms cluster interpretation by producing biologically coherent\nexplanations explicitly anchored in the biomedical literature. The framework\norchestrates three specialized agents: a Retriever that gathers domain\nknowledge from PubMed and UniProt, an Interpreter that formulates functional\nhypotheses, and Critics that evaluate claims, enforce evidence grounding, and\nqualify uncertainty through confidence and reliability indicators. Applied to\nSalmonella enterica RNA-seq data, CITE V.1 generated biologically meaningful\ninsights supported by the literature, while an LLM-only Gemini baseline\nfrequently produced speculative results with false citations. By moving RNA-seq\nanalysis from surface-level enrichment to auditable, interpretable, and\nevidence-based hypothesis generation, CITE V.1 advances the transparency and\nreliability of AI in biomedicine."}
{"id": "2510.16130", "pdf": "https://arxiv.org/pdf/2510.16130", "abs": "https://arxiv.org/abs/2510.16130", "authors": ["Jiasen Zhang", "Xi Qiao", "Liangliang Zhang", "Weihong Guo"], "title": "BASIN: Bayesian mAtrix variate normal model with Spatial and sparsIty priors in Non-negative deconvolution", "categories": ["q-bio.QM", "stat.CO"], "comment": "26 pages, 12 figures", "summary": "Spatial transcriptomics allows researchers to visualize and analyze gene\nexpression within the precise location of tissues or cells. It provides\nspatially resolved gene expression data but often lacks cellular resolution,\nnecessitating cell type deconvolution to infer cellular composition at each\nspatial location. In this paper we propose BASIN for cell type deconvolution,\nwhich models deconvolution as a nonnegative matrix factorization (NMF) problem\nincorporating graph Laplacian prior. Rather than find a deterministic optima\nlike other recent methods, we propose a matrix variate Bayesian NMF method with\nnonnegativity and sparsity priors, in which the variables are maintained in\ntheir matrix form to derive a more efficient matrix normal posterior. BASIN\nemploys a Gibbs sampler to approximate the posterior distribution of cell type\nproportions and other parameters, offering a distribution of possible\nsolutions, enhancing robustness and providing inherent uncertainty\nquantification. The performance of BASIN is evaluated on different spatial\ntranscriptomics datasets and outperforms other deconvolution methods in terms\nof accuracy and efficiency. The results also show the effect of the\nincorporated priors and reflect a truncated matrix normal distribution as we\nexpect."}
{"id": "2510.16536", "pdf": "https://arxiv.org/pdf/2510.16536", "abs": "https://arxiv.org/abs/2510.16536", "authors": ["Niranjana Arun Menon", "Yulong Li", "Iqra Farooq", "Sara Ahmed", "Muhammad Awais", "Imran Razzak"], "title": "Few-Label Multimodal Modeling of SNP Variants and ECG Phenotypes Using Large Language Models for Cardiovascular Risk Stratification", "categories": ["q-bio.QM", "cs.AI", "cs.LG"], "comment": null, "summary": "Cardiovascular disease (CVD) risk stratification remains a major challenge\ndue to its multifactorial nature and limited availability of high-quality\nlabeled datasets. While genomic and electrophysiological data such as SNP\nvariants and ECG phenotypes are increasingly accessible, effectively\nintegrating these modalities in low-label settings is non-trivial. This\nchallenge arises from the scarcity of well-annotated multimodal datasets and\nthe high dimensionality of biological signals, which limit the effectiveness of\nconventional supervised models. To address this, we present a few-label\nmultimodal framework that leverages large language models (LLMs) to combine\ngenetic and electrophysiological information for cardiovascular risk\nstratification. Our approach incorporates a pseudo-label refinement strategy to\nadaptively distill high-confidence labels from weakly supervised predictions,\nenabling robust model fine-tuning with only a small set of ground-truth\nannotations. To enhance the interpretability, we frame the task as a Chain of\nThought (CoT) reasoning problem, prompting the model to produce clinically\nrelevant rationales alongside predictions. Experimental results demonstrate\nthat the integration of multimodal inputs, few-label supervision, and CoT\nreasoning improves robustness and generalizability across diverse patient\nprofiles. Experimental results using multimodal SNP variants and ECG-derived\nfeatures demonstrated comparable performance to models trained on the full\ndataset, underscoring the promise of LLM-based few-label multimodal modeling\nfor advancing personalized cardiovascular care."}
{"id": "2510.17273", "pdf": "https://arxiv.org/pdf/2510.17273", "abs": "https://arxiv.org/abs/2510.17273", "authors": ["Akul Sharma", "Anand A. Joshi", "Richard M. Leahy"], "title": "A Tractography Analysis Framework Using Diffusion Maps to Study Thalamic Connectivity in Traumatic Brain Injury", "categories": ["q-bio.QM", "68T07, 62H30 68T07, 62H30 68T07, 62H30", "I.2.10; I.5.4; J.3"], "comment": "Comments: 6 pages, 1 figure. Submitted and Accepted to IEEE\n  Engineering in Medicine and Biology Conference (EMBC) 2025", "summary": "Traumatic brain injury (TBI) disrupts thalamocortical connectivity,\ncontributing to cognitive impairment and post-traumatic epilepsy (PTE). This\nstudy presents a novel tractography-based framework that leverages diffusion\nmaps to capture microstructural and organizational changes in thalamic white\nmatter pathways. By analyzing individual streamline characteristics, we\nidentified significant associations between diffusion map embeddings and\nfunctional outcomes (GOSE scores), highlighting potential biomarkers for injury\nseverity and recovery trajectories. Our findings suggest that fine-grained\ngeometric features of white matter tracts may provide a more sensitive marker\nfor TBI-related alterations."}
{"id": "2510.16253", "pdf": "https://arxiv.org/pdf/2510.16253", "abs": "https://arxiv.org/abs/2510.16253", "authors": ["Arielle Sanford", "Shuo Sun", "Christian B. Mendl"], "title": "Protein Folding with Neural Ordinary Differential Equations", "categories": ["cs.LG", "cs.AI", "q-bio.BM", "q-bio.QM", "stat.ML", "I.2.1; J.3"], "comment": null, "summary": "Recent advances in protein structure prediction, such as AlphaFold, have\ndemonstrated the power of deep neural architectures like the Evoformer for\ncapturing complex spatial and evolutionary constraints on protein conformation.\nHowever, the depth of the Evoformer, comprising 48 stacked blocks, introduces\nhigh computational costs and rigid layerwise discretization. Inspired by Neural\nOrdinary Differential Equations (Neural ODEs), we propose a continuous-depth\nformulation of the Evoformer, replacing its 48 discrete blocks with a Neural\nODE parameterization that preserves its core attention-based operations. This\ncontinuous-time Evoformer achieves constant memory cost (in depth) via the\nadjoint method, while allowing a principled trade-off between runtime and\naccuracy through adaptive ODE solvers. Benchmarking on protein structure\nprediction tasks, we find that the Neural ODE-based Evoformer produces\nstructurally plausible predictions and reliably captures certain secondary\nstructure elements, such as alpha-helices, though it does not fully replicate\nthe accuracy of the original architecture. However, our model achieves this\nperformance using dramatically fewer resources, just 17.5 hours of training on\na single GPU, highlighting the promise of continuous-depth models as a\nlightweight and interpretable alternative for biomolecular modeling. This work\nopens new directions for efficient and adaptive protein structure prediction\nframeworks."}
{"id": "2510.16304", "pdf": "https://arxiv.org/pdf/2510.16304", "abs": "https://arxiv.org/abs/2510.16304", "authors": ["Qinyu Xu"], "title": "Parameter Identifiability of RNA Dynamics in PDE Transport Models of Fluorescence Recovery After Photobleaching", "categories": ["math.AP", "q-bio.QM"], "comment": "21 pages, 16 figures", "summary": "The transport and localization of RNA molecules, crucial for cellular\nfunction and development, involve a combination of diffusion and active\ntransport mechanisms. Here, we are motivated by understanding the dynamics of\nRNA in Xenopus laevis oocytes. Fluorescence Recovery After Photobleaching\n(FRAP) is an experimental technique that is widely used to investigate the\ndynamics of molecular movement within cells by observing the recovery of\nfluorescence intensity in a photobleached region over time. To advance the\nunderstanding of RNA dynamics, we develop a reaction-diffusion-advection\npartial differential equation (PDE) model integrating both transport and\ndiffusion mechanisms. We propose a pipeline for identifiability analysis to\nassess the model's ability to uniquely determine parameter values from observed\nFRAP data. Based on profile likelihood analysis and reparametrization, we\nexamine the relationship between non- identifiable parameters, which improves\nthe robustness of parameter estimation. We find out that the identifiability of\nthe four parameters of interest is not exactly the same in different regions of\nthe cell. Specifically, transport velocity and diffusion coefficient are\nidentifiable in all regions of the cell, while some combinations of binding\nrate and unbinding rate are found to be identifiable near the nucleus."}
{"id": "2510.16347", "pdf": "https://arxiv.org/pdf/2510.16347", "abs": "https://arxiv.org/abs/2510.16347", "authors": ["Songyuan Lu", "Jingwen Hui", "Jake Weeks", "David B. Berry", "Fanny Chapelin", "Frank Talke"], "title": "Computer Navigated Spinal Surgery Using Magnetic Resonance Imaging and Augmented Reality", "categories": ["eess.IV", "q-bio.QM"], "comment": null, "summary": "Current spinal pain management procedures, such as radiofrequency ablation\n(RFA) and epidural steroid injection (ESI), rely on fluoroscopy for needle\nplacement which exposes patients and physicians to ionizing radiation. In this\npaper, we investigate a radiation-free surgical navigation system for spinal\npain management procedures that combines magnetic resonance imaging (MRI) with\nfiducial ArUco marker-based augmented reality (AR). High-resolution MRI scans\nof a lumbar spinal phantom were obtained and assembled as a surface mesh.\nLaplacian smoothing algorithms were then applied to smoothen the surface and\nimprove the model fidelity. A commercially available stereo camera (ZED2) was\nused to track single or dual fiducial ArUco markers on the patient to determine\nthe patient's real-time pose. Custom AR software was applied to overlay the MRI\nimage onto the patient, allowing the physician to see not only the outer\nsurface of the patient but also the complete anatomy of the patient below the\nsurface. Needle-insertion trials on a 3D-printed 3-vertebra phantom showed that\ndual-ArUco marker tracking increased the accuracy of needle insertions and\nreduced the average needle misplacement distance compared to single-ArUco\nmarker procedures. The average needle misplacement is comparable to the average\ndeviation of 2 mm for conventional epidural techniques using fluoroscopy. Our\nradiation-free system demonstrates promise to serve as an alternative to\nfluoroscopy by improving image-guided spinal navigation."}
{"id": "2510.16656", "pdf": "https://arxiv.org/pdf/2510.16656", "abs": "https://arxiv.org/abs/2510.16656", "authors": ["Noah El Rimawi-Fine", "Adam Stecklov", "Lucas Nelson", "Mathieu Blanchette", "Alexander Tong", "Stephen Y. Zhang", "Lazar Atanackovic"], "title": "Simulation-free Structure Learning for Stochastic Dynamics", "categories": ["cs.LG", "q-bio.QM"], "comment": null, "summary": "Modeling dynamical systems and unraveling their underlying causal\nrelationships is central to many domains in the natural sciences. Various\nphysical systems, such as those arising in cell biology, are inherently\nhigh-dimensional and stochastic in nature, and admit only partial, noisy state\nmeasurements. This poses a significant challenge for addressing the problems of\nmodeling the underlying dynamics and inferring the network structure of these\nsystems. Existing methods are typically tailored either for structure learning\nor modeling dynamics at the population level, but are limited in their ability\nto address both problems together. In this work, we address both problems\nsimultaneously: we present StructureFlow, a novel and principled\nsimulation-free approach for jointly learning the structure and stochastic\npopulation dynamics of physical systems. We showcase the utility of\nStructureFlow for the tasks of structure learning from interventions and\ndynamical (trajectory) inference of conditional population dynamics. We\nempirically evaluate our approach on high-dimensional synthetic systems, a set\nof biologically plausible simulated systems, and an experimental single-cell\ndataset. We show that StructureFlow can learn the structure of underlying\nsystems while simultaneously modeling their conditional population dynamics --\na key step toward the mechanistic understanding of systems behavior."}
{"id": "2510.16674", "pdf": "https://arxiv.org/pdf/2510.16674", "abs": "https://arxiv.org/abs/2510.16674", "authors": ["Azam Shirali", "Giri Narasimhan"], "title": "Evaluating protein binding interfaces with PUMBA", "categories": ["cs.LG", "q-bio.QM"], "comment": null, "summary": "Protein-protein docking tools help in studying interactions between proteins,\nand are essential for drug, vaccine, and therapeutic development. However, the\naccuracy of a docking tool depends on a robust scoring function that can\nreliably differentiate between native and non-native complexes. PIsToN is a\nstate-of-the-art deep learning-based scoring function that uses Vision\nTransformers in its architecture. Recently, the Mamba architecture has\ndemonstrated exceptional performance in both natural language processing and\ncomputer vision, often outperforming Transformer-based models in their domains.\nIn this study, we introduce PUMBA (Protein-protein interface evaluation with\nVision Mamba), which improves PIsToN by replacing its Vision Transformer\nbackbone with Vision Mamba. This change allows us to leverage Mamba's efficient\nlong-range sequence modeling for sequences of image patches. As a result, the\nmodel's ability to capture both global and local patterns in protein-protein\ninterface features is significantly improved. Evaluation on several\nwidely-used, large-scale public datasets demonstrates that PUMBA consistently\noutperforms its original Transformer-based predecessor, PIsToN."}
