{"id": "2510.26950", "pdf": "https://arxiv.org/pdf/2510.26950", "abs": "https://arxiv.org/abs/2510.26950", "authors": ["Yuhao Zhang", "Yong Teng", "Kenan Song", "Xianqiao Wang", "Xianyan Chen", "Yuhua Liu", "Yiping Zhao", "He Li", "Leidong Mao", "Yang Liu"], "title": "Ferrohydrodynamic Microfluidics for Bioparticle Separation and Single-Cell Phenotyping: Principles, Applications, and Emerging Directions", "categories": ["eess.SY", "cs.SY", "q-bio.QM"], "comment": null, "summary": "Ferrohydrodynamic microfluidics relies on magnetic field gradients to\nmanipulate diamagnetic particles in ferrofluid-filled microenvironments. It has\nemerged as a promising tool for label-free manipulation of bioparticles,\nincluding their separation and phenotyping. This perspective reviews recent\nprogress in the development and applications of ferrofluid-based microfluidic\nplatforms for multiscale bioparticle separation, ranging from micron-scale\ncells to submicron extracellular vesicles. We highlight the fundamental\nphysical principles for ferrohydrodynamic manipulation, including the dominant\nmagnetic buoyancy force resulting from the interaction of ferrofluids and\nparticles. We then describe how these principles enable high-resolution\nsize-based bioparticle separation, subcellular bioparticle enrichment, and\nphenotypic screening based on physical traits. We also discuss key challenges\nin ferrohydrodynamic microfluidics from the aspects of ferrofluid\nbiocompatibility, system throughput, and nanoparticle depletion. Finally, we\noutline future research directions involving machine learning, 3D printing, and\nmultiplexed detection. These insights chart a path for advancing\nferrofluid-based technologies in precision biomedicine, diagnostics, and\ncellular engineering."}
{"id": "2510.27600", "pdf": "https://arxiv.org/pdf/2510.27600", "abs": "https://arxiv.org/abs/2510.27600", "authors": ["Juan David Marmolejo Lozano", "Nikola Popovic", "Ramon Grima"], "title": "Effects of Model Reduction on Coherence and Information Transfer in Stochastic Biochemical Systems", "categories": ["q-bio.MN"], "comment": "27 pages, 3 figures", "summary": "Simplified stochastic models are widely used in the study of\nfrequency-resolved noise propagation in biochemical reaction networks, a common\nmeasure being the coherence between random fluctuations in molecule number\ntrajectories. Such models have also found widespread application in the\nquantification of how information is transmitted in reaction networks via the\nmutual information (MI) rate. A common assumption is that, under timescale\nseparation, estimates for the coherence and MI rate obtained from simplified\n(reduced) models closely approximate those in the underlying full models. Here,\nwe challenge that assumption by showing that, while reduced models can\nfaithfully reproduce low-order statistics of molecular counts, they frequently\nincur substantial discrepancies in the coherence spectrum, especially at\nintermediate and high frequencies. These errors, in turn, lead to significant\ninaccuracies in the resulting estimates for the MI rates. We show that the\nobserved discrepancies are due to the interplay between the structure of the\nunderlying reaction networks, the specific model reduction method that is\napplied, and the asymptotic limits relating the full and the reduced models. We\nillustrate our results in canonical models of enzyme catalysis and gene\nexpression, highlighting practical implications for quantifying information\nflow in cells."}
