{"id": "2508.11190", "pdf": "https://arxiv.org/pdf/2508.11190", "abs": "https://arxiv.org/abs/2508.11190", "authors": ["Feng-ao Wang", "Shaobo Chen", "Yao Xuan", "Junwei Liu", "Qi Gao", "Hongdong Zhu", "Junjie Hou", "Lixin Yuan", "Jinyu Cheng", "Chenxin Yi", "Hai Wei", "Yin Ma", "Tao Xu", "Kai Wen", "Yixue Li"], "title": "Quantum-Boosted High-Fidelity Deep Learning", "categories": ["cs.LG", "cs.AI", "q-bio.GN"], "comment": null, "summary": "A fundamental limitation of probabilistic deep learning is its predominant\nreliance on Gaussian priors. This simplistic assumption prevents models from\naccurately capturing the complex, non-Gaussian landscapes of natural data,\nparticularly in demanding domains like complex biological data, severely\nhindering the fidelity of the model for scientific discovery. The\nphysically-grounded Boltzmann distribution offers a more expressive\nalternative, but it is computationally intractable on classical computers. To\ndate, quantum approaches have been hampered by the insufficient qubit scale and\noperational stability required for the iterative demands of deep learning.\nHere, we bridge this gap by introducing the Quantum Boltzmann\nMachine-Variational Autoencoder (QBM-VAE), a large-scale and long-time stable\nhybrid quantum-classical architecture. Our framework leverages a quantum\nprocessor for efficient sampling from the Boltzmann distribution, enabling its\nuse as a powerful prior within a deep generative model. Applied to\nmillion-scale single-cell datasets from multiple sources, the QBM-VAE generates\na latent space that better preserves complex biological structures,\nconsistently outperforming conventional Gaussian-based deep learning models\nlike VAE and SCVI in essential tasks such as omics data integration, cell-type\nclassification, and trajectory inference. It also provides a typical example of\nintroducing a physics priori into deep learning to drive the model to acquire\nscientific discovery capabilities that breaks through data limitations. This\nwork provides the demonstration of a practical quantum advantage in deep\nlearning on a large-scale scientific problem and offers a transferable\nblueprint for developing hybrid quantum AI models."}
{"id": "2508.10905", "pdf": "https://arxiv.org/pdf/2508.10905", "abs": "https://arxiv.org/abs/2508.10905", "authors": ["Toufiq Musah", "Chantelle Amoako-Atta", "John Amankwaah Otu", "Lukman E. Ismaila", "Swallah Alhaji Suraka", "Oladimeji Williams", "Isaac Tigbee", "Kato Hussein Wabbi", "Samantha Katsande", "Kanyiri Ahmed Yakubu", "Adedayo Kehinde Lawal", "Anita Nsiah Donkor", "Naeem Mwinlanaah Adamu", "Adebowale Akande", "John Othieno", "Prince Ebenezer Adjei", "Zhang Dong", "Confidence Raymond", "Udunna C. Anazodo", "Abdul Nashirudeen Mumuni", "Adaobi Chiazor Emegoakor", "Chidera Opara", "Maruf Adewole", "Richard Asiamah"], "title": "Brain Tumor Segmentation in Sub-Sahara Africa with Advanced Transformer and ConvNet Methods: Fine-Tuning, Data Mixing and Ensembling", "categories": ["q-bio.QM"], "comment": "12 pages, 1 figure, 3 tables, Accepted at the Medical Image Computing\n  in Resource Constrained Settings (MIRASOL) Workshop", "summary": "Brain tumors are among the deadliest cancers worldwide, with particularly\ndevastating impact in Sub-Saharan Africa (SSA) where limited access to medical\nimaging infrastructure and expertise often delays diagnosis and treatment\nplanning. Accurate brain tumor segmentation is crucial for treatment planning,\nsurgical guidance, and monitoring disease progression, yet manual segmentation\nis time-consuming and subject to inter-observer variability. Recent advances in\ndeep learning, based on Convolutional Neural Networks (CNNs) and Transformers\nhave demonstrated significant potential in automating this critical task. This\nstudy evaluates three state-of-the-art architectures, SwinUNETR-v2, nnUNet, and\nMedNeXt for automated brain tumor segmentation in multi-parametric Magnetic\nResonance Imaging (MRI) scans. We trained our models on the BraTS-Africa 2024\nand BraTS2021 datasets, and performed validation on the BraTS-Africa 2024\nvalidation set. We observed that training on a mixed dataset (BraTS-Africa 2024\nand BraTS2021) did not yield improved performance on the SSA validation set in\nall tumor regions compared to training solely on SSA data with well-validated\nmethods. Ensembling predictions from different models also lead to notable\nperformance increases. Our best-performing model, a finetuned MedNeXt, achieved\nan average lesion-wise Dice score of 0.84, with individual scores of 0.81\n(enhancing tumor), 0.81 (tumor core), and 0.91 (whole tumor). While further\nimprovements are expected with extended training and larger datasets, these\nresults demonstrate the feasibility of deploying deep learning for reliable\ntumor segmentation in resource-limited settings. We further highlight the need\nto improve local data acquisition protocols to support the development of\nclinically relevant, region-specific AI tools."}
{"id": "2508.10970", "pdf": "https://arxiv.org/pdf/2508.10970", "abs": "https://arxiv.org/abs/2508.10970", "authors": ["Adrian Martens", "Mathias Neufang", "Alessandro Butté", "Moritz von Stosch", "Antonio del Rio Chanona", "Laura Marie Helleckes"], "title": "Holistic Bioprocess Development Across Scales Using Multi-Fidelity Batch Bayesian Optimization", "categories": ["q-bio.QM", "stat.ML"], "comment": "25 pages, 12 figures", "summary": "Bioprocesses are central to modern biotechnology, enabling sustainable\nproduction in pharmaceuticals, specialty chemicals, cosmetics, and food.\nHowever, developing high-performing processes is costly and complex, requiring\niterative, multi-scale experimentation from microtiter plates to pilot\nreactors. Conventional Design of Experiments (DoE) approaches often struggle to\naddress process scale-up and the joint optimization of reaction conditions and\nbiocatalyst selection.\n  We propose a multi-fidelity batch Bayesian optimization framework to\naccelerate bioprocess development and reduce experimental costs. The method\nintegrates Gaussian Processes tailored for multi-fidelity modeling and\nmixed-variable optimization, guiding experiment selection across scales and\nbiocatalysts. A custom simulation of a Chinese Hamster Ovary bioprocess,\ncapturing non-linear and coupled scale-up dynamics, is used for benchmarking\nagainst multiple simulated industrial DoE baselines. Multiple case studies show\nhow the proposed workflow can achieve a reduction in experimental costs and\nincreased yield.\n  This work provides a data-efficient strategy for bioprocess optimization and\nhighlights future opportunities in transfer learning and uncertainty-aware\ndesign for sustainable biotechnology."}
{"id": "2508.10541", "pdf": "https://arxiv.org/pdf/2508.10541", "abs": "https://arxiv.org/abs/2508.10541", "authors": ["Brian Shing-Hei Wong", "Joshua Mincheol Kim", "Sin-Hang Fung", "Qing Xiong", "Kelvin Fu-Kiu Ao", "Junkang Wei", "Ran Wang", "Dan Michelle Wang", "Jingying Zhou", "Bo Feng", "Alfred Sze-Lok Cheng", "Kevin Y. Yip", "Stephen Kwok-Wing Tsui", "Qin Cao"], "title": "Driving Accurate Allergen Prediction with Protein Language Models and Generalization-Focused Evaluation", "categories": ["cs.LG", "q-bio.QM"], "comment": "59 pages, 5 main figures, 15 supplementary figures, 2 supplementary\n  tables", "summary": "Allergens, typically proteins capable of triggering adverse immune responses,\nrepresent a significant public health challenge. To accurately identify\nallergen proteins, we introduce Applm (Allergen Prediction with Protein\nLanguage Models), a computational framework that leverages the 100-billion\nparameter xTrimoPGLM protein language model. We show that Applm consistently\noutperforms seven state-of-the-art methods in a diverse set of tasks that\nclosely resemble difficult real-world scenarios. These include identifying\nnovel allergens that lack similar examples in the training set, differentiating\nbetween allergens and non-allergens among homologs with high sequence\nsimilarity, and assessing functional consequences of mutations that create few\nchanges to the protein sequences. Our analysis confirms that xTrimoPGLM,\noriginally trained on one trillion tokens to capture general protein sequence\ncharacteristics, is crucial for Applm's performance by detecting important\ndifferences among protein sequences. In addition to providing Applm as\nopen-source software, we also provide our carefully curated benchmark datasets\nto facilitate future research."}
{"id": "2508.11004", "pdf": "https://arxiv.org/pdf/2508.11004", "abs": "https://arxiv.org/abs/2508.11004", "authors": ["Yassine Sabbar"], "title": "A Review of Modern Stochastic Modeling: SDE/SPDE Numerics, Data-Driven Identification, and Generative Methods with Applications in Biology and Epidemiology", "categories": ["math.DS", "q-bio.QM"], "comment": null, "summary": "This review maps developments in stochastic modeling, highlighting\nnon-standard approaches and their applications to biology and epidemiology. It\nbrings together four strands: (1) core models for systems that evolve with\nrandomness; (2) learning key parts of those models directly from data; (3)\nmethods that can generate realistic synthetic data in continuous time; and (4)\nnumerical techniques that keep simulations stable, accurate, and faithful over\nlong runs. The objective is practical: help researchers quickly see what is\nnew, how the pieces fit together, and where important gaps remain. We summarize\ntools for estimating changing infection or reaction rates under noisy and\nincomplete observations, modeling spatial spread, accounting for sudden jumps\nand heavy tails, and reporting uncertainty in a way that is useful for\ndecisions. We also highlight open problems that deserve near-term attention:\nseparating true dynamics from noise when data are irregular; learning spatial\ndynamics under random influences with guarantees of stability; aligning\ntraining with the numerical method used in applications; preserving positivity\nand conservation in all simulations; reducing cost while controlling error for\nlarge studies; estimating rare but important events; and adopting clear,\ncomparable reporting standards. By organizing the field around these aims, the\nreview offers a concise guide to current methods, their practical use, and the\nmost promising directions for future work in biology and epidemiology.s."}
{"id": "2508.11036", "pdf": "https://arxiv.org/pdf/2508.11036", "abs": "https://arxiv.org/abs/2508.11036", "authors": ["Zhongmao Liu", "Xiaohui Yin", "Yanjiao Zhou", "Gen Li", "Kun Chen"], "title": "Dissecting Microbial Community Structure and Heterogeneity via Multivariate Covariate-Adjusted Clustering", "categories": ["stat.ME", "q-bio.QM", "stat.AP", "62H30 (Primary) 62J12, 62P10 (Secondary)"], "comment": null, "summary": "In microbiome studies, it is often of great interest to identify clusters or\npartitions of microbiome profiles within a study population and to characterize\nthe distinctive attributes of each resulting microbial community. While raw\ncounts or relative compositions are commonly used for such analysis, variations\nbetween clusters may be driven or distorted by subject-level covariates,\nreflecting underlying biological and clinical heterogeneity across individuals.\nSimultaneously detecting latent communities and identifying covariates that\ndifferentiate them can enhance our understanding of the microbiome and its\nassociation with health outcomes. To this end, we propose a\nDirichlet-multinomial mixture regression (DMMR) model that enables joint\nclustering of microbiome profiles while accounting for covariates with either\nhomogeneous or heterogeneous effects across clusters. A novel symmetric link\nfunction is introduced to facilitate covariate modeling through the\ncompositional parameters. We develop efficient algorithms with convergence\nguarantees for parameter estimation and establish theoretical properties of the\nproposed estimators. Extensive simulation studies demonstrate the effectiveness\nof the method in clustering, feature selection, and heterogeneity detection. We\nillustrate the utility of DMMR through a comprehensive application to\nupper-airway microbiota data from a pediatric asthma study, uncovering distinct\nmicrobial subtypes and their associations with clinical characteristics."}
