{"id": "2511.09571", "pdf": "https://arxiv.org/pdf/2511.09571", "abs": "https://arxiv.org/abs/2511.09571", "authors": ["Margaret R. Martin", "Soha Hassoun"], "title": "General Intelligence-based Fragmentation (GIF): A framework for peak-labeled spectra simulation", "categories": ["q-bio.QM", "cs.AI"], "comment": null, "summary": "Despite growing reference libraries and advanced computational tools, progress in the field of metabolomics remains constrained by low rates of annotating measured spectra. The recent developments of large language models (LLMs) have led to strong performance across a wide range of generation and reasoning tasks, spurring increased interest in LLMs' application to domain-specific scientific challenges, such as mass spectra annotation. Here, we present a novel framework, General Intelligence-based Fragmentation (GIF), that guides pretrained LLMs through spectra simulation using structured prompting and reasoning. GIF utilizes tagging, structured inputs/outputs, system prompts, instruction-based prompts, and iterative refinement. Indeed, GIF offers a structured alternative to ad hoc prompting, underscoring the need for systematic guidance of LLMs on complex scientific tasks. Using GIF, we evaluate current generalist LLMs' ability to use reasoning towards fragmentation and to perform intensity prediction after fine-tuning. We benchmark performance on a novel QA dataset, the MassSpecGym QA-sim dataset, that we derive from the MassSpecGym dataset. Through these implementations of GIF, we find that GPT-4o and GPT-4o-mini achieve a cosine similarity of 0.36 and 0.35 between the simulated and true spectra, respectively, outperforming other pretrained models including GPT-5, Llama-3.1, and ChemDFM, despite GPT-5's recency and ChemDFM's domain specialization. GIF outperforms several deep learning baselines. Our evaluation of GIF highlights the value of using LLMs not only for spectra simulation but for enabling human-in-the-loop workflows and structured, explainable reasoning in molecular fragmentation."}
{"id": "2511.09576", "pdf": "https://arxiv.org/pdf/2511.09576", "abs": "https://arxiv.org/abs/2511.09576", "authors": ["Abraham Francisco Arellano Tavara", "Umesh Kumar", "Jathurshan Pradeepkumar", "Jimeng Sun"], "title": "Prostate-VarBench: A Benchmark with Interpretable TabNet Framework for Prostate Cancer Variant Classification", "categories": ["q-bio.QM", "cs.AI", "cs.LG"], "comment": null, "summary": "Variants of Uncertain Significance (VUS) limit the clinical utility of prostate cancer genomics by delaying diagnosis and therapy when evidence for pathogenicity or benignity is incomplete. Progress is further limited by inconsistent annotations across sources and the absence of a prostate-specific benchmark for fair comparison. We introduce Prostate-VarBench, a curated pipeline for creating prostate-specific benchmarks that integrates COSMIC (somatic cancer mutations), ClinVar (expert-curated clinical variants), and TCGA-PRAD (prostate tumor genomics from The Cancer Genome Atlas) into a harmonized dataset of 193,278 variants supporting patient- or gene-aware splits to prevent data leakage. To ensure data integrity, we corrected a Variant Effect Predictor (VEP) issue that merged multiple transcript records, introducing ambiguity in clinical significance fields. We then standardized 56 interpretable features across eight clinically relevant tiers, including population frequency, variant type, and clinical context. AlphaMissense pathogenicity scores were incorporated to enhance missense variant classification and reduce VUS uncertainty. Building on this resource, we trained an interpretable TabNet model to classify variant pathogenicity, whose step-wise sparse masks provide per-case rationales consistent with molecular tumor board review practices. On the held-out test set, the model achieved 89.9% accuracy with balanced class metrics, and the VEP correction yields an 6.5% absolute reduction in VUS."}
{"id": "2511.09583", "pdf": "https://arxiv.org/pdf/2511.09583", "abs": "https://arxiv.org/abs/2511.09583", "authors": ["Dmytro Leontiev", "Abicumaran Uthamacumaran", "Riya Nagar", "Hector Zenil"], "title": "Exhaustive Investigation of CBC-Derived Biomarker Ratios for Clinical Outcome Prediction: The RDW-to-MCHC Ratio as a Novel Mortality Predictor in Critical Care", "categories": ["q-bio.QM"], "comment": "26 pages with Appendix", "summary": "Ratios of common biomarkers and blood analytes are well established for early detection and predictive purposes. Early risk stratification in critical care is often limited by the delayed availability of complex severity scores. Complete blood count (CBC) parameters, available within hours of admission, may enable rapid prognostication. We conducted an exhaustive and systematic evaluation of CBC-derived ratios for mortality prediction to identify robust, accessible, and generalizable biomarkers. We generated all feasible two-parameter CBC ratios with unit checks and plausibility filters on more than 90,000 ICU admissions (MIMIC-IV). Discrimination was assessed via cross-validated and external AUC, calibration via isotonic regression, and clinical utility with decision-curve analysis. Retrospective validation was performed on eICU-CRD (n = 156530) participants. The ratio of Red Cell Distribution Width (RDW) to Mean Corpuscular Hemoglobin Concentration (MCHC), denoted RDW:MCHC, emerged as the top biomarker (AUC = 0.699 discovery; 0.662 validation), outperforming RDW and NLR. It achieved near-universal availability (99.9\\% vs.\\ 35.0\\% for NLR), excellent calibration (Hosmer--Lemeshow $p = 1.0$; $\\mathrm{ECE} < 0.001$), and preserved performance across diagnostic groups, with only modest attenuation in respiratory cases. Expressed as a logistic odds ratio, each one standard deviation increase in RDW:MCHC nearly quadrupled 30-day mortality odds (OR = 3.81, 95\\% CI [3.70, 3.95]). Decision-curve analysis showed positive net benefit at high-risk triage thresholds. A simple, widely available CBC-derived feature (RDW:MCHC) provides consistent, externally validated signal for early mortality risk. While not a substitute for multivariable scores, it offers a pragmatic adjunct for rapid triage when full scoring is impractical."}
{"id": "2511.10014", "pdf": "https://arxiv.org/pdf/2511.10014", "abs": "https://arxiv.org/abs/2511.10014", "authors": ["Guofeng Meng", "Li Shen", "Qiuyan Zhong", "Wei Wang", "Haizhou Zhang", "Xiaozhen Wang"], "title": "fastbmRAG: A Fast Graph-Based RAG Framework for Efficient Processing of Large-Scale Biomedical Literature", "categories": ["q-bio.QM", "cs.AI"], "comment": "8 pages, 2 figure, 1 table", "summary": "Large language models (LLMs) are rapidly transforming various domains, including biomedicine and healthcare, and demonstrate remarkable potential from scientific research to new drug discovery. Graph-based retrieval-augmented generation (RAG) systems, as a useful application of LLMs, can improve contextual reasoning through structured entity and relationship identification from long-context knowledge, e.g. biomedical literature. Even though many advantages over naive RAGs, most of graph-based RAGs are computationally intensive, which limits their application to large-scale dataset. To address this issue, we introduce fastbmRAG, an fast graph-based RAG optimized for biomedical literature. Utilizing well organized structure of biomedical papers, fastbmRAG divides the construction of knowledge graph into two stages, first drafting graphs using abstracts; and second, refining them using main texts guided by vector-based entity linking, which minimizes redundancy and computational load. Our evaluations demonstrate that fastbmRAG is over 10x faster than existing graph-RAG tools and achieve superior coverage and accuracy to input knowledge. FastbmRAG provides a fast solution for quickly understanding, summarizing, and answering questions about biomedical literature on a large scale. FastbmRAG is public available in https://github.com/menggf/fastbmRAG."}
{"id": "2511.10223", "pdf": "https://arxiv.org/pdf/2511.10223", "abs": "https://arxiv.org/abs/2511.10223", "authors": ["David F. Anderson", "Aidan S. Howells", "Diego Rojas La Luz"], "title": "Stochastic Reaction Networks Within Interacting Compartments with Content-Dependent Fragmentation", "categories": ["math.PR", "q-bio.MN"], "comment": "23 pages", "summary": "Stochastic reaction networks with mass-action kinetics provide a useful framework for understanding processes -- biochemical and otherwise -- in homogeneous environments. However, cellular reactions are often compartmentalized, either at the cell level or within cells, and hence non-homogeneous. A general framework for compartmentalized chemistry with dynamic compartments was proposed in (Duso and Zechner, PNAS, 2020), and the special case where the compartment dynamics do not depend on their contents was studied mathematically in (Anderson and Howells, Bull. Math. Biol., 2023). In the present paper, we investigate the case in which the rate of fragmentation of a compartment depends on the abundance of some designated species inside that compartment. The main focus of this work is on providing general conditions for (positive) recurrence and non-explosivity of the models. In particular, we demonstrate that the explosivity characterization from (Anderson and Howells, Bull. Math. Biol., 2023) fails in this setting and provide new sufficient conditions for non-explosivity and positive recurrence, under the assumption that the underlying CRN admits a linear Lyapunov function. These results extend the theoretical foundation for modeling content-mediated compartment dynamics, with implications for systems such as cell division and intracellular transport."}
{"id": "2511.09574", "pdf": "https://arxiv.org/pdf/2511.09574", "abs": "https://arxiv.org/abs/2511.09574", "authors": ["Alexander Ingold", "Richard G. Baird", "Dasmeet Kaur", "Nidhi Dwivedi", "Reed Sorenson", "Leslie Sieburth", "Chang-Jun Liu", "Rajesh Menon"], "title": "HAMscope: a snapshot Hyperspectral Autofluorescence Miniscope for real-time molecular imaging", "categories": ["physics.optics", "eess.IV", "q-bio.QM"], "comment": null, "summary": "We introduce HAMscope, a compact, snapshot hyperspectral autofluorescence miniscope that enables real-time, label-free molecular imaging in a wide range of biological systems. By integrating a thin polymer diffuser into a widefield miniscope, HAMscope spectrally encodes each frame and employs a probabilistic deep learning framework to reconstruct 30-channel hyperspectral stacks (452 to 703 nm) or directly infer molecular composition maps from single images. A scalable multi-pass U-Net architecture with transformer-based attention and per-pixel uncertainty estimation enables high spatio-spectral fidelity (mean absolute error ~ 0.0048) at video rates. While initially demonstrated in plant systems, including lignin, chlorophyll, and suberin imaging in intact poplar and cork tissues, the platform is readily adaptable to other applications such as neural activity mapping, metabolic profiling, and histopathology. We show that the system generalizes to out-of-distribution tissue types and supports direct molecular mapping without the need for spectral unmixing. HAMscope establishes a general framework for compact, uncertainty-aware spectral imaging that combines minimal optics with advanced deep learning, offering broad utility for real-time biochemical imaging across neuroscience, environmental monitoring, and biomedicine."}
{"id": "2511.10337", "pdf": "https://arxiv.org/pdf/2511.10337", "abs": "https://arxiv.org/abs/2511.10337", "authors": ["D. Evan Piephoff", "Jianshu Cao"], "title": "Stochastic Thermodynamics of Cooperative Biomolecular Machines: Fluctuation Relations and Hidden Detailed Balance Breaking", "categories": ["cond-mat.stat-mech", "physics.bio-ph", "physics.chem-ph", "q-bio.MN"], "comment": null, "summary": "We examine a biomolecular machine involving a driven, observable process coupled to a hidden process in a kinetically cooperative manner. A stochastic thermodynamics framework is employed to analyze a fluctuation theorem for the first-passage time of the observable process under nonequilibrium steady-state conditions. Based on a generic kinetic model, we demonstrate that, along first-passage trajectories, entropy production remains constant when the changes in stochastic entropy and free energy of the machine are balanced, which corresponds to zero net hidden flux through the initial state manifold. Under this condition, which we define quite generally, this first-passage time fluctuation theorem can be established, with its violation serving as an experimentally detectable signature of hidden detailed balance breaking (which we subsequently characterize). In addition, using an enzymatic model, we show that the violation of our first-passage time fluctuation theorem can be thought of as a consequence of the breakdown of local detailed balance in the steps linking coarse-grained states that correspond to the initial and intermediate state manifolds. In the absence of hidden current, the fluctuation theorem is restored, and a mesoscopic local detailed balance condition can be established, which has implications for the thermodynamic analysis of driven, coarse-grained systems. This work sheds significant light on the unique connections between stochastic thermodynamic quantities and kinetic measurements in complex cooperative networks."}
{"id": "2511.09581", "pdf": "https://arxiv.org/pdf/2511.09581", "abs": "https://arxiv.org/abs/2511.09581", "authors": ["Phillip Sloan", "Edwin Simpson", "Majid Mirmehdi"], "title": "Clinically-aligned Multi-modal Chest X-ray Classification", "categories": ["eess.IV", "q-bio.QM"], "comment": "9 Pages, 2 Figures, 3 Tables & 2 Supplementary Tables in Appendix. Accepted to ML4H 2025 (Proceedings)", "summary": "Radiology is essential to modern healthcare, yet rising demand and staffing shortages continue to pose major challenges. Recent advances in artificial intelligence have the potential to support radiologists and help address these challenges. Given its widespread use and clinical importance, chest X-ray classification is well suited to augment radiologists' workflows. However, most existing approaches rely solely on single-view, image-level inputs, ignoring the structured clinical information and multi-image studies available at the time of reporting. In this work, we introduce CaMCheX, a multimodal transformer-based framework that aligns multi-view chest X-ray studies with structured clinical data to better reflect how clinicians make diagnostic decisions. Our architecture employs view-specific ConvNeXt encoders for frontal and lateral chest radiographs, whose features are fused with clinical indications, history, and vital signs using a transformer fusion module. This design enables the model to generate context-aware representations that mirror reasoning in clinical practice. Our results exceed the state of the art for both the original MIMIC-CXR dataset and the more recent CXR-LT benchmarks, highlighting the value of clinically grounded multimodal alignment for advancing chest X-ray classification."}
{"id": "2511.10609", "pdf": "https://arxiv.org/pdf/2511.10609", "abs": "https://arxiv.org/abs/2511.10609", "authors": ["Praneet Nandan", "Beatriz Pascual-Escudero", "Diego Rojas La Luz"], "title": "Multistationarity in semi-open Phosphorylation-Dephosphorylation Cycles", "categories": ["math.DS", "q-bio.MN"], "comment": "24 pages", "summary": "Multistationarity, underlies biochemical switching and cellular decision-making. We study how multistationarity in the sequential n-site phosphorylation-dephosphorylation cycle is affected when only some species are open, meaning allowed to exchange with the environment (so-called semi-open networks). Working under mass action kinetics, we obtain two complementary structural results for every $n\\geq 2$. First, opening any nonempty subset of the substrate species preserves the network's capacity for nondegenerate multistationarity. Second, opening the enzyme species (both kinase and phosphatase), possibly together with any subset of substrates, always destroys multistationarity. The latter result is proved by a general reduction framework combining the detection of absolute concentration robustness (ACR) with projection onto the remaining species; when the projection is monostationary, the full semi-open system is monostationary. We also illustrate the general method on multi-layer cascade variants and discuss biological implications: opening enzymes acts as a robust switch that converts a potentially multistationary phosphorylation module into a monostationary one, while substrate exchange preserves switching capacity and thus the ability to couple cycles to downstream processes."}
{"id": "2511.09588", "pdf": "https://arxiv.org/pdf/2511.09588", "abs": "https://arxiv.org/abs/2511.09588", "authors": ["Vincenzo Marcianò", "Hava Chaptoukaev", "Virginia Fernandez", "M. Jorge Cardoso", "Sébastien Ourselin", "Michela Antonelli", "Maria A. Zuluaga"], "title": "Diffusion-Based Quality Control of Medical Image Segmentations across Organs", "categories": ["eess.IV", "q-bio.QM"], "comment": null, "summary": "Medical image segmentation using deep learning (DL) has enabled the development of automated analysis pipelines for large-scale population studies. However, state-of-the-art DL methods are prone to hallucinations, which can result in anatomically implausible segmentations. With manual correction impractical at scale, automated quality control (QC) techniques have to address the challenge. While promising, existing QC methods are organ-specific, limiting their generalizability and usability beyond their original intended task. To overcome this limitation, we propose no-new Quality Control (nnQC), a robust QC framework based on a diffusion-generative paradigm that self-adapts to any input organ dataset. Central to nnQC is a novel Team of Experts (ToE) architecture, where two specialized experts independently encode 3D spatial awareness, represented by the relative spatial position of an axial slice, and anatomical information derived from visual features from the original image. A weighted conditional module dynamically combines the pair of independent embeddings, or opinions to condition the sampling mechanism within a diffusion process, enabling the generation of a spatially aware pseudo-ground truth for predicting QC scores. Within its framework, nnQC integrates fingerprint adaptation to ensure adaptability across organs, datasets, and imaging modalities. We evaluated nnQC on seven organs using twelve publicly available datasets. Our results demonstrate that nnQC consistently outperforms state-of-the-art methods across all experiments, including cases where segmentation masks are highly degraded or completely missing, confirming its versatility and effectiveness across different organs."}
{"id": "2511.09592", "pdf": "https://arxiv.org/pdf/2511.09592", "abs": "https://arxiv.org/abs/2511.09592", "authors": ["Himashi Peiris", "Sizhe Wang", "Gary Egan", "Mehrtash Harandi", "Meng Law", "Zhaolin Chen"], "title": "Segment Any Tumour: An Uncertainty-Aware Vision Foundation Model for Whole-Body Analysis", "categories": ["eess.IV", "q-bio.QM"], "comment": null, "summary": "Prompt-driven vision foundation models, such as the Segment Anything Model, have recently demonstrated remarkable adaptability in computer vision. However, their direct application to medical imaging remains challenging due to heterogeneous tissue structures, imaging artefacts, and low-contrast boundaries, particularly in tumours and cancer primaries leading to suboptimal segmentation in ambiguous or overlapping lesion regions. Here, we present Segment Any Tumour 3D (SAT3D), a lightweight volumetric foundation model designed to enable robust and generalisable tumour segmentation across diverse medical imaging modalities. SAT3D integrates a shifted-window vision transformer for hierarchical volumetric representation with an uncertainty-aware training pipeline that explicitly incorporates uncertainty estimates as prompts to guide reliable boundary prediction in low-contrast regions. Adversarial learning further enhances model performance for the ambiguous pathological regions. We benchmark SAT3D against three recent vision foundation models and nnUNet across 11 publicly available datasets, encompassing 3,884 tumour and cancer cases for training and 694 cases for in-distribution evaluation. Trained on 17,075 3D volume-mask pairs across multiple modalities and cancer primaries, SAT3D demonstrates strong generalisation and robustness. To facilitate practical use and clinical translation, we developed a 3D Slicer plugin that enables interactive, prompt-driven segmentation and visualisation using the trained SAT3D model. Extensive experiments highlight its effectiveness in improving segmentation accuracy under challenging and out-of-distribution scenarios, underscoring its potential as a scalable foundation model for medical image analysis."}
{"id": "2511.09605", "pdf": "https://arxiv.org/pdf/2511.09605", "abs": "https://arxiv.org/abs/2511.09605", "authors": ["Johannes Kiechle", "Stefan M. Fischer", "Daniel M. Lang", "Cosmin I. Bercea", "Matthew J. Nyflot", "Lina Felsner", "Julia A. Schnabel", "Jan C. Peeken"], "title": "TomoGraphView: 3D Medical Image Classification with Omnidirectional Slice Representations and Graph Neural Networks", "categories": ["eess.IV", "cs.AI", "cs.LG", "q-bio.QM"], "comment": "Preprint submitted to Medical Image Analysis (MedIA)", "summary": "The growing number of medical tomography examinations has necessitated the development of automated methods capable of extracting comprehensive imaging features to facilitate downstream tasks such as tumor characterization, while assisting physicians in managing their growing workload. However, 3D medical image classification remains a challenging task due to the complex spatial relationships and long-range dependencies inherent in volumetric data. Training models from scratch suffers from low data regimes, and the absence of 3D large-scale multimodal datasets has limited the development of 3D medical imaging foundation models. Recent studies, however, have highlighted the potential of 2D vision foundation models, originally trained on natural images, as powerful feature extractors for medical image analysis. Despite these advances, existing approaches that apply 2D models to 3D volumes via slice-based decomposition remain suboptimal. Conventional volume slicing strategies, which rely on canonical planes such as axial, sagittal, or coronal, may inadequately capture the spatial extent of target structures when these are misaligned with standardized viewing planes. Furthermore, existing slice-wise aggregation strategies rarely account for preserving the volumetric structure, resulting in a loss of spatial coherence across slices. To overcome these limitations, we propose TomoGraphView, a novel framework that integrates omnidirectional volume slicing with spherical graph-based feature aggregation. We publicly share our accessible code base at http://github.com/compai-lab/2025-MedIA-kiechle and provide a user-friendly library for omnidirectional volume slicing at https://pypi.org/project/OmniSlicer."}
{"id": "2511.10165", "pdf": "https://arxiv.org/pdf/2511.10165", "abs": "https://arxiv.org/abs/2511.10165", "authors": ["Yuancheng Sun", "Yuxuan Ren", "Zhaoming Chen", "Xu Han", "Kang Liu", "Qiwei Ye"], "title": "EPO: Diverse and Realistic Protein Ensemble Generation via Energy Preference Optimization", "categories": ["cs.LG", "q-bio.QM"], "comment": "Accepted as AAAI 2026 Poster", "summary": "Accurate exploration of protein conformational ensembles is essential for uncovering function but remains hard because molecular-dynamics (MD) simulations suffer from high computational costs and energy-barrier trapping. This paper presents Energy Preference Optimization (EPO), an online refinement algorithm that turns a pretrained protein ensemble generator into an energy-aware sampler without extra MD trajectories. Specifically, EPO leverages stochastic differential equation sampling to explore the conformational landscape and incorporates a novel energy-ranking mechanism based on list-wise preference optimization. Crucially, EPO introduces a practical upper bound to efficiently approximate the intractable probability of long sampling trajectories in continuous-time generative models, making it easily adaptable to existing pretrained generators. On Tetrapeptides, ATLAS, and Fast-Folding benchmarks, EPO successfully generates diverse and physically realistic ensembles, establishing a new state-of-the-art in nine evaluation metrics. These results demonstrate that energy-only preference signals can efficiently steer generative models toward thermodynamically consistent conformational ensembles, providing an alternative to long MD simulations and widening the applicability of learned potentials in structural biology and drug discovery."}
{"id": "2511.10432", "pdf": "https://arxiv.org/pdf/2511.10432", "abs": "https://arxiv.org/abs/2511.10432", "authors": ["Willem Bonnaffé", "Yang Hu", "Andrea Chatrian", "Mengran Fan", "Stefano Malacrino", "Sandy Figiel", "CRUK ICGC Prostate Group", "Srinivasa R. Rao", "Richard Colling", "Richard J. Bryant", "Freddie C. Hamdy", "Dan J. Woodcock", "Ian G. Mills", "Clare Verrill", "Jens Rittscher"], "title": "Histology-informed tiling of whole tissue sections improves the interpretability and predictability of cancer relapse and genetic alterations", "categories": ["cs.CV", "q-bio.QM", "q-bio.TO"], "comment": "26 pages, 6 figures", "summary": "Histopathologists establish cancer grade by assessing histological structures, such as glands in prostate cancer. Yet, digital pathology pipelines often rely on grid-based tiling that ignores tissue architecture. This introduces irrelevant information and limits interpretability. We introduce histology-informed tiling (HIT), which uses semantic segmentation to extract glands from whole slide images (WSIs) as biologically meaningful input patches for multiple-instance learning (MIL) and phenotyping. Trained on 137 samples from the ProMPT cohort, HIT achieved a gland-level Dice score of 0.83 +/- 0.17. By extracting 380,000 glands from 760 WSIs across ICGC-C and TCGA-PRAD cohorts, HIT improved MIL models AUCs by 10% for detecting copy number variation (CNVs) in genes related to epithelial-mesenchymal transitions (EMT) and MYC, and revealed 15 gland clusters, several of which were associated with cancer relapse, oncogenic mutations, and high Gleason. Therefore, HIT improved the accuracy and interpretability of MIL predictions, while streamlining computations by focussing on biologically meaningful structures during feature extraction."}
