{"id": "2509.20402", "pdf": "https://arxiv.org/pdf/2509.20402", "abs": "https://arxiv.org/abs/2509.20402", "authors": ["Muhammed Furkan Dasdelen", "Ivan Kukuljan", "Peter Lienemann", "Ario Sadafi", "Matthias Hehr", "Karsten Spiekermann", "Christian Pohlkamp", "Carsten Marr"], "title": "cAItomorph: Transformer-Based Hematological Malignancy Prediction from Peripheral Blood Smears in a Real-Word Cohort", "categories": ["q-bio.QM"], "comment": "23 pages, 11 figures", "summary": "Peripheral blood smears remain a cornerstone in the diagnosis of\nhematological neoplasms, offering rapid and valuable insights that inform\nsubsequent diagnostic steps. However, since neoplastic transformations\ntypically arise in the bone marrow, they may not manifest as detectable\naberrations in peripheral blood, presenting a diagnostic challenge. In this\npaper, we introduce cAItomorph, an explainable transformer-based AI model,\ntrained to classify hematological malignancies based on peripheral blood\ncytomorphology. Our data comprises peripheral blood single-cell images from\n6115 patients with diagnoses confirmed by cytomorphology, cytogenetics,\nmolecular genetics, and immunophenotyping from bone marrow samples, and 495\nhealthy controls, categorized into 22 detailed and 7 coarse classes. cAItomorph\nleverages the DinoBloom hematology foundation model and aggregates image\nencodings via a transformer-based architecture into a single vector. It\nachieves an overall accuracy of 68$\\pm$1% (mean$\\pm$s.d., 5-fold\ncross-validation) in 7-disease classification, with F1 scores of 74$\\pm$2% for\nacute leukemia, 75$\\pm$3% for myeloproliferative neoplasms and 82$\\pm$3% for no\nmalignancy cases. The overall accuracy increases to 84$\\pm$1% in top-2\npredictions. By analyzing multi-head attentions, we demonstrate clinically\nrelevant cell-level attentions and pixel-level heatmaps. Moreover, our model's\ncalibrated prediction probabilities reduced the false discovery rate from 13.8%\nto 12% without missing any acute leukemia cases, thereby decreasing the number\nof unnecessary bone marrow aspirations. Our code, test data, and model weights\nare publicly available to ensure reproducibility. This study highlights the\npotential of AI-assisted diagnostics in hematological malignancies,\nillustrating how models trained on real-world data could enhance diagnostic\naccuracy and reduce invasive procedures."}
{"id": "2509.21132", "pdf": "https://arxiv.org/pdf/2509.21132", "abs": "https://arxiv.org/abs/2509.21132", "authors": ["Dongmin Kim", "Théo Michelot", "Katherine Mertes", "Jared A. Stabach", "John Fieberg"], "title": "Detecting disease progression from animal movement using hidden Markov models", "categories": ["q-bio.QM", "stat.AP"], "comment": null, "summary": "Understanding disease dynamics is crucial for managing wildlife populations\nand assessing spillover risk to domestic animals and humans, but infection data\non free-ranging animals are difficult to obtain. Because pathogen and parasite\ninfections can alter host movement, infection status may be inferred from\nanimal trajectories. We present a hidden Markov model (HMM) framework that\nlinks observed movement behaviors to unobserved infection states, consistent\nwith epidemiological compartmental models (e.g., susceptible, infected,\nrecovered, dead). Using movement data from 84 reintroduced scimitar-horned oryx\n(Oryx dammah), 38 confirmed dead in the field and 6 sampled for disease\ntesting, we demonstrate how HMMs can incorporate epidemiological structure\nthrough (1) constrained transition probabilities (e.g., to preclude or allow\nrecovery), (2) covariate effects on transmission, and (3) hierarchically\nstructured HMMs (HHMMs) for multi-scale transitions. Comparing veterinary\ndiagnostic reports with model outputs, we found that HMMs with epidemiological\nconstraints successfully identified infection-associated reductions in\nmovement, whereas unconstrained models failed to capture disease progression.\nSimulations further showed that constrained HMMs accurately classified\nsusceptible, infected, and recovered states. By illustrating flexible\nformulations and a workflow for model selection, we provide a transferable\napproach for detecting infection from movement data. This framework can enhance\nwildlife disease surveillance, guide population management, and improve\nunderstanding of disease dynamics."}
{"id": "2509.20719", "pdf": "https://arxiv.org/pdf/2509.20719", "abs": "https://arxiv.org/abs/2509.20719", "authors": ["Alston Lo", "Connor W. Coley", "Wojciech Matusik"], "title": "A Genetic Algorithm for Navigating Synthesizable Molecular Spaces", "categories": ["cs.LG", "q-bio.QM"], "comment": null, "summary": "Inspired by the effectiveness of genetic algorithms and the importance of\nsynthesizability in molecular design, we present SynGA, a simple genetic\nalgorithm that operates directly over synthesis routes. Our method features\ncustom crossover and mutation operators that explicitly constrain it to\nsynthesizable molecular space. By modifying the fitness function, we\ndemonstrate the effectiveness of SynGA on a variety of design tasks, including\nsynthesizable analog search and sample-efficient property optimization, for\nboth 2D and 3D objectives. Furthermore, by coupling SynGA with a machine\nlearning-based filter that focuses the building block set, we boost SynGA to\nstate-of-the-art performance. For property optimization, this manifests as a\nmodel-based variant SynGBO, which employs SynGA and block filtering in the\ninner loop of Bayesian optimization. Since SynGA is lightweight and enforces\nsynthesizability by construction, our hope is that SynGA can not only serve as\na strong standalone baseline but also as a versatile module that can be\nincorporated into larger synthesis-aware workflows in the future."}
{"id": "2509.20850", "pdf": "https://arxiv.org/pdf/2509.20850", "abs": "https://arxiv.org/abs/2509.20850", "authors": ["Qiong Wu", "Hannah Klinkhammer", "Kiran Kunwar", "Christian Staerk", "Carlo Maj", "Andreas Mayr"], "title": "Detecting gene-environment interactions to guide personalized intervention: boosting distributional regression for polygenic scores", "categories": ["stat.AP", "q-bio.GN", "q-bio.QM", "stat.CO"], "comment": "18 pages with 8 figures", "summary": "Polygenic risk scores can be used to model the individual genetic liability\nfor human traits. Current methods primarily focus on modeling the mean of a\nphenotype neglecting the variance. However, genetic variants associated with\nphenotypic variance can provide important insights to gene-environment\ninteraction studies. To overcome this, we propose snpboostlss, a cyclical\ngradient boosting algorithm for a Gaussian location-scale model to jointly\nderive sparse polygenic models for both the mean and the variance of a\nquantitative phenotype. To improve computational efficiency on high-dimensional\nand large-scale genotype data (large n and large p), we only consider a batch\nof most relevant variants in each boosting step. We investigate the effect of\nstatins therapy (the environmental factor) on low-density lipoprotein in the UK\nBiobank cohort using the new snpboostlss algorithm. We are able to verify the\ninteraction between statins usage and the polygenic risk scores for phenotypic\nvariance in both cross sectional and longitudinal analyses. Particularly,\nfollowing the spirit of target trial emulation, we observe that the treatment\neffect of statins is more substantial in people with higher polygenic risk\nscores for phenotypic variance, indicating gene-environment interaction. When\napplying to body mass index, the newly constructed polygenic risk scores for\nvariance show significant interaction with physical activity and sedentary\nbehavior. Therefore, the polygenic risk scores for phenotypic variance derived\nby snpboostlss have potential to identify individuals that could benefit more\nfrom environmental changes (e.g. medical intervention and lifestyle changes)."}
{"id": "2509.21191", "pdf": "https://arxiv.org/pdf/2509.21191", "abs": "https://arxiv.org/abs/2509.21191", "authors": ["Carson Dudley", "Marisa Eisenberg"], "title": "Not All Accuracy Is Equal: Prioritizing Diversity in Infectious Disease Forecasting", "categories": ["stat.AP", "q-bio.QM"], "comment": "5 pages, 2 figures", "summary": "Ensemble forecasts have become a cornerstone of large-scale disease response,\nunderpinning decision making at agencies such as the US Centers for Disease\nControl and Prevention (CDC). Their growing use reflects the goal of combining\nmultiple models to improve accuracy and stability versus using a single model.\nHowever, recent experience shows these benefits are not guaranteed. During the\nCOVID-19 pandemic, the CDC's multi-model forecasting ensemble outperformed the\nbest single model by only 1%, and CDC flu forecasting ensembles have often\nranked below multiple individual models.\n  This raises a key question: why are ensembles underperforming? We posit that\na central reason is that both model developers and ensemble builders typically\nfocus on stand-alone accuracy. Models are fit to minimize their own forecasting\nerror, and ensembles are often weighted according to those same scores.\nHowever, most epidemic forecasts are built from a small set of approaches and\ntrained on the same surveillance data, leading to highly correlated errors.\nThis redundancy limits the benefit of ensembling and may explain why large\nensembles sometimes deliver only marginal gains.\n  To realize the potential of ensembles, both modelers and ensemblers should\nprioritize models that contribute complementary information rather than\nreplicating existing approaches. Ensembles built with this principle in mind\nmove beyond size for its own sake toward true diversity, producing forecasts\nthat are more robust and more valuable for epidemic preparedness and response."}
{"id": "2509.21206", "pdf": "https://arxiv.org/pdf/2509.21206", "abs": "https://arxiv.org/abs/2509.21206", "authors": ["Benedikt Hoock", "Tobias Köppl"], "title": "Data-driven Neural Networks for Windkessel Parameter Calibration", "categories": ["q-bio.TO", "cs.LG", "cs.NA", "math.NA", "math.OC", "q-bio.QM", "68T07 (primary) 65M08, 65M60, 68T20, 76S05, 76Z05, 92C17, 92C42\n  (secondary)"], "comment": "32 pages, 15 figures, for associated git see\n  https://github.com/bhoock/WKcalNN, submitted to International Journal for\n  Numerical Methods in Biomedical Engineering", "summary": "In this work, we propose a novel method for calibrating Windkessel (WK)\nparameters in a dimensionally reduced 1D-0D coupled blood flow model. To this\nend, we design a data-driven neural network (NN)trained on simulated blood\npressures in the left brachial artery. Once trained, the NN emulates the\npressure pulse waves across the entire simulated domain, i.e., over time, space\nand varying WK parameters, with negligible error and computational effort. To\ncalibrate the WK parameters on a measured pulse wave, the NN is extended by\ndummy neurons and retrained only on these. The main objective of this work is\nto assess the effectiveness of the method in various scenarios -- particularly,\nwhen the exact measurement location is unknown or the data are affected by\nnoise."}
{"id": "2509.21239", "pdf": "https://arxiv.org/pdf/2509.21239", "abs": "https://arxiv.org/abs/2509.21239", "authors": ["Shakib Khan", "Fariba Dambandkhameneh", "Nazim Shaikh", "Yao Nie", "Raghavan Venugopal", "Xiao Li"], "title": "SlideMamba: Entropy-Based Adaptive Fusion of GNN and Mamba for Enhanced Representation Learning in Digital Pathology", "categories": ["cs.CV", "q-bio.QM"], "comment": null, "summary": "Advances in computational pathology increasingly rely on extracting\nmeaningful representations from Whole Slide Images (WSIs) to support various\nclinical and biological tasks. In this study, we propose a generalizable deep\nlearning framework that integrates the Mamba architecture with Graph Neural\nNetworks (GNNs) for enhanced WSI analysis. Our method is designed to capture\nboth local spatial relationships and long-range contextual dependencies,\noffering a flexible architecture for digital pathology analysis. Mamba modules\nexcels in capturing long-range global dependencies, while GNNs emphasize\nfine-grained short-range spatial interactions. To effectively combine these\ncomplementary signals, we introduce an adaptive fusion strategy that uses an\nentropy-based confidence weighting mechanism. This approach dynamically\nbalances contributions from both branches by assigning higher weight to the\nbranch with more confident (lower-entropy) predictions, depending on the\ncontextual importance of local versus global information for different\ndownstream tasks. We demonstrate the utility of our approach on a\nrepresentative task: predicting gene fusion and mutation status from WSIs. Our\nframework, SlideMamba, achieves an area under the precision recall curve\n(PRAUC) of 0.751 \\pm 0.05, outperforming MIL (0.491 \\pm 0.042), Trans-MIL (0.39\n\\pm 0.017), Mamba-only (0.664 \\pm 0.063), GNN-only (0.748 \\pm 0.091), and a\nprior similar work GAT-Mamba (0.703 \\pm 0.075). SlideMamba also achieves\ncompetitive results across ROC AUC (0.738 \\pm 0.055), sensitivity (0.662 \\pm\n0.083), and specificity (0.725 \\pm 0.094). These results highlight the strength\nof the integrated architecture, enhanced by the proposed entropy-based adaptive\nfusion strategy, and suggest promising potential for application of\nspatially-resolved predictive modeling tasks in computational pathology."}
