{"id": "2507.10601", "pdf": "https://arxiv.org/pdf/2507.10601", "abs": "https://arxiv.org/abs/2507.10601", "authors": ["Ruixi Zheng", "Wei Zhang", "Yijie Li", "Xi Zhu", "Zhou Lan", "Jarrett Rushmore", "Yogesh Rathi", "Nikos Makris", "Lauren J. O'Donnell", "Fan Zhang"], "title": "AGFS-Tractometry: A Novel Atlas-Guided Fine-Scale Tractometry Approach for Enhanced Along-Tract Group Statistical Comparison Using Diffusion MRI Tractography", "categories": ["q-bio.QM", "cs.CV", "cs.LG", "eess.IV", "stat.ME"], "comment": "31 pages and 7 figures", "summary": "Diffusion MRI (dMRI) tractography is currently the only method for in vivo\nmapping of the brain's white matter (WM) connections. Tractometry is an\nadvanced tractography analysis technique for along-tract profiling to\ninvestigate the morphology and microstructural properties along the fiber\ntracts. Tractometry has become an essential tool for studying local along-tract\ndifferences between different populations (e.g., health vs disease). In this\nstudy, we propose a novel atlas-guided fine-scale tractometry method, namely\nAGFS-Tractometry, that leverages tract spatial information and permutation\ntesting to enhance the along-tract statistical analysis between populations.\nThere are two major contributions in AGFS-Tractometry. First, we create a novel\natlas-guided tract profiling template that enables consistent, fine-scale,\nalong-tract parcellation of subject-specific fiber tracts. Second, we propose a\nnovel nonparametric permutation testing group comparison method to enable\nsimultaneous analysis across all along-tract parcels while correcting for\nmultiple comparisons. We perform experimental evaluations on synthetic datasets\nwith known group differences and in vivo real data. We compare AGFS-Tractometry\nwith two state-of-the-art tractometry methods, including Automated Fiber-tract\nQuantification (AFQ) and BUndle ANalytics (BUAN). Our results show that the\nproposed AGFS-Tractometry obtains enhanced sensitivity and specificity in\ndetecting local WM differences. In the real data analysis experiments,\nAGFS-Tractometry can identify more regions with significant differences, which\nare anatomically consistent with the existing literature. Overall, these\ndemonstrate the ability of AGFS-Tractometry to detect subtle or spatially\nlocalized WM group-level differences. The created tract profiling template and\nrelated code are available at:\nhttps://github.com/ZhengRuixi/AGFS-Tractometry.git."}
{"id": "2507.10625", "pdf": "https://arxiv.org/pdf/2507.10625", "abs": "https://arxiv.org/abs/2507.10625", "authors": ["Ashish Poonia", "Siddhartha P. Chakrabarty"], "title": "Strategic Control of Drug-Resistant HIV: Multi-Strain Modeling with Diagnosis, Adherence, and Treatment Switching", "categories": ["q-bio.QM"], "comment": null, "summary": "A central challenge in Human Immunodeficiency Virus (HIV) public health\npolicy lies in determining whether to universally expand treatment access,\ndespite the risk of sub-optimal adherence and consequent drug resistance, or to\nadopt a more strategic allocation of resources that balances treatment coverage\nwith adherence support. This dilemma is further complicated by the need for\ntimely switching to second-line therapy, which is critical for managing\ntreatment failure but imposes additional burdens on limited healthcare\nresources. In this study, we develop and analyze a compartmental model of HIV\ntransmission that incorporates both drug-sensitive and drug-resistant strains,\ndiagnosis status, and treatment progression, including switching to second-line\ntherapy upon detection of resistance. Basic reproduction numbers for both\nstrains are derived, and equilibrium analysis reveals the existence of a\ndisease-free state and two endemic states, where the drug-sensitive strain may\nbe eliminated while the drug-resistant strain persists. Local and global\nsensitivity analyses are performed, using partial rank correlation coefficient\n(PRCC) and Sobol methods, to identify key parameters influencing different\nmodel outcomes. We extend the model using optimal control theory to assess\nmultiple intervention strategies targeting diagnosis, treatment initiation, and\nadherence. A novel dynamic control framework is proposed to achieve the UNAIDS\n95-95-95 targets through efficient resource allocation. Numerical simulations\nvalidate the analytical results and compare the effectiveness and\ncost-efficiency of control strategies. Our findings highlight that long-term\nHIV epidemic control depends critically on prioritizing adherence-focused\ninterventions alongside efforts to expand first-line treatment coverage."}
{"id": "2507.10714", "pdf": "https://arxiv.org/pdf/2507.10714", "abs": "https://arxiv.org/abs/2507.10714", "authors": ["Bright Kwaku Manu", "Trevor Reckell", "Beckett Sterner", "Petar Jevtic"], "title": "A Simple Approximate Bayesian Inference Neural Surrogate for Stochastic Petri Net Models", "categories": ["cs.LG", "q-bio.QM", "stat.ML", "68, 92", "I.6; I.2.6"], "comment": "12 pages, 10 figures, for all associated codes and files, see\n  https://github.com/BrightManu-lang/SPN-param-recovery.git", "summary": "Stochastic Petri Nets (SPNs) are an increasingly popular tool of choice for\nmodeling discrete-event dynamics in areas such as epidemiology and systems\nbiology, yet their parameter estimation remains challenging in general and in\nparticular when transition rates depend on external covariates and explicit\nlikelihoods are unavailable. We introduce a neural-surrogate\n(neural-network--based approximation of the posterior distribution) framework\nthat predicts the coefficients of known covariate-dependent rate functions\ndirectly from noisy, partially observed token trajectories. Our model employs a\nlightweight 1D Convolutional Residual Network trained end-to-end on\nGillespie-simulated SPN realizations, learning to invert system dynamics under\nrealistic conditions of event dropout. During inference, Monte Carlo dropout\nprovides calibrated uncertainty bounds together with point estimates. On\nsynthetic SPNs with 20% missing events, our surrogate recovers rate-function\ncoefficients with an RMSE = 0.108 and substantially runs faster than\ntraditional Bayesian approaches. These results demonstrate that data-driven,\nlikelihood-free surrogates can enable accurate, robust, and real-time parameter\nrecovery in complex, partially observed discrete-event systems."}
{"id": "2507.10793", "pdf": "https://arxiv.org/pdf/2507.10793", "abs": "https://arxiv.org/abs/2507.10793", "authors": ["Rayanne A. Luke", "Prajakta Bedekar", "Lyndsey M. Muehling", "Glenda Canderan", "Yesun Lee", "Wesley A. Cheng", "Judith A. Woodfolk", "Jeffrey M. Wilson", "Pia S. Pannaraj", "Anthony J. Kearsley"], "title": "Probabilistic Modeling of Antibody Kinetics Post Infection and Vaccination: A Markov Chain Approach", "categories": ["q-bio.PE", "math.PR", "physics.bio-ph", "q-bio.QM", "stat.ME", "92D30, 92-10"], "comment": "34 pages, 23 figures, supplementary material (videos)", "summary": "Understanding the dynamics of antibody levels is crucial for characterizing\nthe time-dependent response to immune events: either infections or\nvaccinations. The sequence and timing of these events significantly influence\nantibody level changes. Despite extensive interest in the topic in the recent\nyears and many experimental studies, the effect of immune event sequences on\nantibody levels is not well understood. Moreover, disease or vaccination\nprevalence in the population are time-dependent. This, alongside the\ncomplexities of personal antibody kinetics, makes it difficult to analyze a\nsample immune measurement from a population. As a solution, we design a\nrigorous mathematical characterization in terms of a time-inhomogeneous Markov\nchain model for event-to-event transitions coupled with a probabilistic\nframework for the post-event antibody kinetics of multiple immune events. We\ndemonstrate that this is an ideal model for immune event sequences, referred to\nas personal trajectories. This novel modeling framework surpasses the\nsusceptible-infected-recovered (SIR) characterizations by rigorously tracking\nthe probability distribution of population antibody response across time. To\nillustrate our ideas, we apply our mathematical framework to longitudinal\nsevere acute respiratory syndrome coronavirus 2 (SARS-CoV-2) data from\nindividuals with multiple documented infection and vaccination events. Our work\nis an important step towards a comprehensive understanding of antibody kinetics\nthat could lead to an effective way to analyze the protective power of natural\nimmunity or vaccination, predict missed immune events at an individual level,\nand inform booster timing recommendations."}
{"id": "2507.10953", "pdf": "https://arxiv.org/pdf/2507.10953", "abs": "https://arxiv.org/abs/2507.10953", "authors": ["Balu Bhasuran", "Sabenabanu Abdulkadhar", "Jeyakumar Natarajan"], "title": "Unraveling the Biomarker Prospects of High-Altitude Diseases: Insights from Biomolecular Event Network Constructed using Text Mining", "categories": ["cs.IR", "q-bio.QM"], "comment": null, "summary": "High-altitude diseases (HAD), encompassing acute mountain sickness (AMS),\nhigh-altitude cerebral edema (HACE), and high-altitude pulmonary edema (HAPE),\nare triggered by hypobaric hypoxia at elevations above 2,500 meters. These\nconditions pose significant health risks, yet the molecular mechanisms remain\ninsufficiently understood. In this study, we developed a biomolecular event\nextraction pipeline integrating supervised machine learning with feature-based\nand multiscale Laplacian graph kernels to analyze 7,847 curated HAD-related\nabstracts from PubMed. We extracted over 150 unique biomolecular events\nincluding gene expression, regulation, binding, and localization and\nconstructed a weighted, undirected biomolecular event network comprising 97\nnodes and 153 edges. Using the PageRank algorithm, we prioritized key\nbiomolecules based on their centrality within the event network. The top-ranked\nproteins included Erythropoietin (EPO) (0.0163), Vascular endothelial growth\nfactor (VEGF) (0.0148), Hypoxia-inducible factor 1 (HIF-1) alpha (0.0136),\nEndothelial PAS Domain Protein 1 (EPAS1) and Angiotensin-Converting Enzyme\n(ACE) (0.0119), Egl nine homolog 1 (EGLN1), Endothelin 1 (ET-1), and 70\nkilodalton heat shock protein (Hsp70)(0.0118), all of which play crucial roles\nin oxygen sensing, vascular remodeling, erythropoiesis, and blood pressure\nregulation. Subnetwork analysis revealed three major functional clusters\ncentered on hypoxia response, inflammation, and stress adaptation pathways. Our\nintegrative approach demonstrates the utility of large-scale text mining and\ngraph-based analysis to uncover mechanistic insights and prioritize potential\nbiomarkers for high-altitude disease."}
