{"id": "2511.19535", "pdf": "https://arxiv.org/pdf/2511.19535", "abs": "https://arxiv.org/abs/2511.19535", "authors": ["Ilán Carretero", "Roshni Mahtani", "Silvia Perez-Deben", "José Francisco González-Muñoz", "Carlos Monteagudo", "Valery Naranjo", "Rocío del Amor"], "title": "Masked Autoencoder Joint Learning for Robust Spitzoid Tumor Classification", "categories": ["q-bio.QM", "cs.LG"], "comment": "Accepted in CASEIB 2025", "summary": "Accurate diagnosis of spitzoid tumors (ST) is critical to ensure a favorable prognosis and to avoid both under- and over-treatment. Epigenetic data, particularly DNA methylation, provide a valuable source of information for this task. However, prior studies assume complete data, an unrealistic setting as methylation profiles frequently contain missing entries due to limited coverage and experimental artifacts. Our work challenges these favorable scenarios and introduces ReMAC, an extension of ReMasker designed to tackle classification tasks on high-dimensional data under complete and incomplete regimes. Evaluation on real clinical data demonstrates that ReMAC achieves strong and robust performance compared to competing classification methods in the stratification of ST. Code is available: https://github.com/roshni-mahtani/ReMAC."}
{"id": "2511.19549", "pdf": "https://arxiv.org/pdf/2511.19549", "abs": "https://arxiv.org/abs/2511.19549", "authors": ["Axel Petzold", "Joachim Pum", "David P Crabb"], "title": "Parallelism in Neurodegenerative Biomarker Tests: Hidden Errors and the Risk of Misconduct", "categories": ["q-bio.QM", "stat.AP"], "comment": null, "summary": "Biomarkers are critical tools in the diagnosis and monitoring of neurodegenerative diseases. Reliable quantification depends on assay validity, especially the demonstration of parallelism between diluted biological samples and the assay's standard curve. Inadequate parallelism can lead to biased concentration estimates, jeopardizing both clinical and research applications. Here we systematically review the evidence of analytical parallelism in body fluid (serum, plasma, cerebrospinal fluid) biomarker assays for neurodegeneration and evaluate the extent, reproducibility, and reporting quality of partial parallelism.\n  This systematic review was registered on PROSPERO (CRD42024568766) and conducted in accordance with PRISMA guidelines. We included studies published between December 2010 to July 2024 without language restrictions. ...\n  In conclusion, partial parallelism was infrequently observed and inconsistently reported in most biomarker assays for neurodegeneration. Narrow dilution ranges and variable methodologies limit generalizability. Transparent reporting of dilution protocols and adherence to established analytical validation guidelines is needed. This systematic review has practical implications for clinical trial design, regulatory approval processes, and the reliability of biomarker-based diagnostics."}
{"id": "2511.19769", "pdf": "https://arxiv.org/pdf/2511.19769", "abs": "https://arxiv.org/abs/2511.19769", "authors": ["Amit Lavon"], "title": "Blini: lightweight nucleotide sequence search and dereplication", "categories": ["q-bio.QM"], "comment": null, "summary": "Blini is a tool for quick lookup of nucleotide sequences in databases, and for quick dereplication of sequence collections. It is meant to help clean and characterize large collections of assembled contigs or long sequences that would otherwise be too big to search with online tools, or too demanding for a local machine to process. Benchmarks on simulated data demonstrate that it is faster than existing tools and requires less RAM, while preserving search and clustering accuracy."}
{"id": "2511.19894", "pdf": "https://arxiv.org/pdf/2511.19894", "abs": "https://arxiv.org/abs/2511.19894", "authors": ["Sixtus Dakurah"], "title": "Spanning Tree Basis for Unbiased Averaging of Network Topologies", "categories": ["q-bio.QM"], "comment": null, "summary": "In recent years there has been a paradigm shift from the study of local task-related activation to the organization and functioning of large-scale functional and structural brain networks. However, a long-standing challenge in this large-scale brain network analysis is how to compare network organizations irrespective of their complexity. The maximum spanning tree (MST) has served as a simple, unbiased, standardized representation of complex brain networks and effectively addressed this long-standing challenge. This tree representation, however, has been limited to individual networks. Group-level trees are always constructed from the average network or through a bootstrap procedure. Constructing the group-level tree from the average network introduces bias from individual subjects with outlying connectivities. The bootstrap method can be computationally prohibitive if a good approximation is desired. To address these issues, we propose a novel spectral representation of trees using the spanning tree basis. This spectral representation enables us to compute the average MST and demonstrate that this average tree captures the global properties of all the MSTs in the group and also overlaps with the union of the shortest paths in the functional brain networks."}
{"id": "2511.20392", "pdf": "https://arxiv.org/pdf/2511.20392", "abs": "https://arxiv.org/abs/2511.20392", "authors": ["Debabrata Auddya", "Shiva Rudraraju"], "title": "Mechano-chemical modeling of glia initiated secondary injury of neurons under mechanical load", "categories": ["q-bio.QM", "q-bio.NC"], "comment": "26 pages, 10 figures", "summary": "Traumatic Brain Injury (TBI) results from an impact or concussion to the head with the injury being specifically characterized through pathological degradation at various biological length scales. Following injury, various mechanical modeling techniques have been proposed in the literature that seek to quantify neuronal-scale to tissue-scale metrics of brain damage. Broadly, the two categories of degradation encompass physiological deterioration of neurons and upregulation of chemical entities such as neurotransmitters which causes initiation of downstream pathophysiological effects. Despite the many contributing pathways, in this work, we delineate and model a potential glia-initiated injury pathway that leads to secondary injury. The goal of this work is to demonstrate a continuum framework which models the multiphysics of mechano-chemical interactions underlying TBI. Using a coupled PDE (partial differential equation) formulation and FEM (finite element method) discretization, the framework highlights evolution of field variables which spatio-temporally resolve mechanical metrics and chemical species across neuronal clusters. The modeling domain encompasses microglia, neurons and the extracellular matrix. The continuum framework used to model the mechano-chemical interactions assumes a three dimensional viscoelastic network to capture the mechanical response underlying proteins constituting the neuron microstructure and advection-diffusion equations modeling spatio-temporal evolution of chemical species. We use this framework to numerically estimate key concentrations of chemical species produced by the strain field. In this work, we identify key biomarkers within the labyrinth of molecular pathways and build a framework that captures the core mechano-chemical interactions. This framework is an attempt to quantify secondary injury and thus assist in developing targeted TBI treatments."}
{"id": "2511.20493", "pdf": "https://arxiv.org/pdf/2511.20493", "abs": "https://arxiv.org/abs/2511.20493", "authors": ["Marzio Galdi", "Davide Cannatà", "Flavia Celentano", "Luigia Rizzo", "Domenico Rossi", "Tecla Bocchino", "Stefano Martina"], "title": "Development of a fully deep learning model to improve the reproducibility of sector classification systems for predicting unerupted maxillary canine likelihood of impaction", "categories": ["eess.IV", "cs.CV", "q-bio.QM"], "comment": null, "summary": "Objectives. The aim of the present study was to develop a fully deep learning model to reduce the intra- and inter-operator reproducibility of sector classification systems for predicting unerupted maxillary canine likelihood of impaction. Methods. Three orthodontists (Os) and three general dental practitioners (GDPs) classified the position of unerupted maxillary canines on 306 radiographs (T0) according to the three different sector classification systems (5-, 4-, and 3-sector classification system). The assessment was repeated after four weeks (T1). Intra- and inter-observer agreement were evaluated with Cohen's K and Fleiss K, and between group differences with a z-test. The same radiographs were tested on different artificial intelligence (AI) models, pre-trained on an extended dataset of 1,222 radiographs. The best-performing model was identified based on its sensitivity and precision. Results. The 3-sector system was found to be the classification method with highest reproducibility, with an agreement (Cohen's K values) between observations (T0 versus T1) for each examiner ranged from 0.80 to 0.92, and an overall agreement of 0.85 [95% confidence interval (CI) = 0.83-0.87]. The overall inter-observer agreement (Fleiss K) ranged from 0.69 to 0.7. The educational background did not affect either intra- or inter-observer agreement (p>0.05). DenseNet121 proved to be the best-performing model in allocating impacted canines in the three different classes, with an overall accuracy of 76.8%. Conclusion. AI models can be designed to automatically classify the position of unerupted maxillary canines."}
