{"id": "2511.13790", "pdf": "https://arxiv.org/pdf/2511.13790", "abs": "https://arxiv.org/abs/2511.13790", "authors": ["Lukas Picek", "César Leblanc", "Alexis Joly", "Pierre Bonnet", "Rémi Palard", "Maximilien Servajean"], "title": "GeoPl@ntNet: A Platform for Exploring Essential Biodiversity Variables", "categories": ["q-bio.QM", "cs.AI"], "comment": "4 pages, 5 figures, and 2 tables", "summary": "This paper describes GeoPl@ntNet, an interactive web application designed to make Essential Biodiversity Variables accessible and understandable to everyone through dynamic maps and fact sheets. Its core purpose is to allow users to explore high-resolution AI-generated maps of species distributions, habitat types, and biodiversity indicators across Europe. These maps, developed through a cascading pipeline involving convolutional neural networks and large language models, provide an intuitive yet information-rich interface to better understand biodiversity, with resolutions as precise as 50x50 meters. The website also enables exploration of specific regions, allowing users to select areas of interest on the map (e.g., urban green spaces, protected areas, or riverbanks) to view local species and their coverage. Additionally, GeoPl@ntNet generates comprehensive reports for selected regions, including insights into the number of protected species, invasive species, and endemic species."}
{"id": "2511.13791", "pdf": "https://arxiv.org/pdf/2511.13791", "abs": "https://arxiv.org/abs/2511.13791", "authors": ["Pratik Chakraborty", "Aryan Bhargava"], "title": "XAI-Driven Deep Learning for Protein Sequence Functional Group Classification", "categories": ["q-bio.QM", "cs.AI", "cs.LG"], "comment": "8 pages, 4 figures", "summary": "Proteins perform essential biological functions, and accurate classification of their sequences is critical for understanding structure-function relationships, enzyme mechanisms, and molecular interactions. This study presents a deep learning-based framework for functional group classification of protein sequences derived from the Protein Data Bank (PDB). Four architectures were implemented: Convolutional Neural Network (CNN), Bidirectional Long Short-Term Memory (BiLSTM), CNN-BiLSTM hybrid, and CNN with Attention. Each model was trained using k-mer integer encoding to capture both local and long-range dependencies. Among these, the CNN achieved the highest validation accuracy of 91.8%, demonstrating the effectiveness of localized motif detection. Explainable AI techniques, including Grad-CAM and Integrated Gradients, were applied to interpret model predictions and identify biologically meaningful sequence motifs. The discovered motifs, enriched in histidine, aspartate, glutamate, and lysine, represent amino acid residues commonly found in catalytic and metal-binding regions of transferase enzymes. These findings highlight that deep learning models can uncover functionally relevant biochemical signatures, bridging the gap between predictive accuracy and biological interpretability in protein sequence analysis."}
{"id": "2511.13797", "pdf": "https://arxiv.org/pdf/2511.13797", "abs": "https://arxiv.org/abs/2511.13797", "authors": ["Zhaoxuan Wang", "Weichen Kang", "Yutian Han", "Lingyuan Zhao", "Bo Li"], "title": "MAT-MPNN: A Mobility-Aware Transformer-MPNN Model for Dynamic Spatiotemporal Prediction of HIV Diagnoses in California, Florida, and New England", "categories": ["q-bio.QM", "cs.AI", "cs.LG"], "comment": "21 pages, 20 figures,1 table. Preprint", "summary": "Human Immunodeficiency Virus (HIV) has posed a major global health challenge for decades, and forecasting HIV diagnoses continues to be a critical area of research. However, capturing the complex spatial and temporal dependencies of HIV transmission remains challenging. Conventional Message Passing Neural Network (MPNN) models rely on a fixed binary adjacency matrix that only encodes geographic adjacency, which is unable to represent interactions between non-contiguous counties. Our study proposes a deep learning architecture Mobility-Aware Transformer-Message Passing Neural Network (MAT-MPNN) framework to predict county-level HIV diagnosis rates across California, Florida, and the New England region. The model combines temporal features extracted by a Transformer encoder with spatial relationships captured through a Mobility Graph Generator (MGG). The MGG improves conventional adjacency matrices by combining geographic and demographic information. Compared with the best-performing hybrid baseline, the Transformer MPNN model, MAT-MPNN reduced the Mean Squared Prediction Error (MSPE) by 27.9% in Florida, 39.1% in California, and 12.5% in New England, and improved the Predictive Model Choice Criterion (PMCC) by 7.7%, 3.5%, and 3.9%, respectively. MAT-MPNN also achieved better results than the Spatially Varying Auto-Regressive (SVAR) model in Florida and New England, with comparable performance in California. These results demonstrate that applying mobility-aware dynamic spatial structures substantially enhances predictive accuracy and calibration in spatiotemporal epidemiological prediction."}
{"id": "2511.13799", "pdf": "https://arxiv.org/pdf/2511.13799", "abs": "https://arxiv.org/abs/2511.13799", "authors": ["Hirokuni Miyamoto", "Kenta Suzuki", "Shigeharu Moriya", "Makiko Matsuura", "Naoko Tsuji", "Teruno Nakaguma", "Chitose Ishii", "Takayuki Nagatsuka", "Takashi Satoh", "Wataru Suda", "Tamotsu Kato", "Chie Shindo", "Atsushi Kurotani", "Hiroaki Kodama", "Hiroshi Masuya", "Satoshi Wada", "Nobuhiro Kawachi", "Hisashi Miyamoto", "Yukinari Tsuruda", "Yohei Shimasaki", "Shouzo Ogizo", "Nobuo Suzuki", "Tomoharu Yuge", "Toshio Takahashi", "Tomohito Ojima", "Toshio Furota", "Akio Sakamoto", "Keiichi Takimoto", "Kozo Kugimiya", "Takehiro Tanaka", "Takashi Kimura", "Yuuji Oshima", "Jun Kikuchi", "Hiroshi Ohno"], "title": "Symbiotic causal network of seagrass-bacteria-alga-diatom interactions", "categories": ["q-bio.QM"], "comment": "11 pages, 36 figures (5 main figures)", "summary": "Seagrass meadows contribute to the conservation of marine ecosystems, reduction in global warming impacts and pathogen controls. However, the decline in seagrass habitats due to environmental loads has become an urgent global issue. One way to address this issue is to better understand healthy seagrass habitats. Here, we estimate the structural characteristics of symbiotic and metabolic systems in sediments from eight coastal regions of Japan, with each region containing both seagrass-covered areas and adjacent unvegetated areas. Notably, seagrasses commonly maintain a balanced symbiotic relationship characterized by a positive association with cable bacteria (Desulfobulbaceae), nitrogen-cycling bacteria (Hyphomonadaceae), and coral alga (Corallinophycidae) and a negative association with diatoms (Diatomea). Furthermore, seagrass growth conditions influence metabolic pathways by activating nitrogen-related metabolism while attenuating methanogenesis. Our findings highlight the crucial roles of marine plants and their symbiotic systems in ensuring environmental conservation within the context of blue carbon storage across environmental gradients."}
{"id": "2511.13786", "pdf": "https://arxiv.org/pdf/2511.13786", "abs": "https://arxiv.org/abs/2511.13786", "authors": ["Yue Ling", "Peiqi Zhang", "Zhenyi Zhang", "Peijie Zhou"], "title": "CellStream: Dynamical Optimal Transport Informed Embeddings for Reconstructing Cellular Trajectories from Snapshots Data", "categories": ["q-bio.GN", "cs.LG"], "comment": "Published as a conference paper at AAAI 2026 (oral)", "summary": "Single-cell RNA sequencing (scRNA-seq), especially temporally resolved datasets, enables genome-wide profiling of gene expression dynamics at single-cell resolution across discrete time points. However, current technologies provide only sparse, static snapshots of cell states and are inherently influenced by technical noise, complicating the inference and representation of continuous transcriptional dynamics. Although embedding methods can reduce dimensionality and mitigate technical noise, the majority of existing approaches typically treat trajectory inference separately from embedding construction, often neglecting temporal structure. To address this challenge, here we introduce CellStream, a novel deep learning framework that jointly learns embedding and cellular dynamics from single-cell snapshot data by integrating an autoencoder with unbalanced dynamical optimal transport. Compared to existing methods, CellStream generates dynamics-informed embeddings that robustly capture temporal developmental processes while maintaining high consistency with the underlying data manifold. We demonstrate CellStream's effectiveness on both simulated datasets and real scRNA-seq data, including spatial transcriptomics. Our experiments indicate significant quantitative improvements over state-of-the-art methods in representing cellular trajectories with enhanced temporal coherence and reduced noise sensitivity. Overall, CellStream provides a new tool for learning and representing continuous streams from the noisy, static snapshots of single-cell gene expression."}
{"id": "2511.14083", "pdf": "https://arxiv.org/pdf/2511.14083", "abs": "https://arxiv.org/abs/2511.14083", "authors": ["Zhonghao Liu", "Hanxue Gu", "Qihang Li", "Michael Fox", "Jay M. Levin", "Maciej A. Mazurowski", "Brian C. Lau"], "title": "Automated glenoid bone loss measurement and segmentation in CT scans for pre-operative planning in shoulder instability", "categories": ["cs.CV", "cs.AI", "q-bio.QM"], "comment": null, "summary": "Reliable measurement of glenoid bone loss is essential for operative planning in shoulder instability, but current manual and semi-automated methods are time-consuming and often subject to interreader variability. We developed and validated a fully automated deep learning pipeline for measuring glenoid bone loss on three-dimensional computed tomography (CT) scans using a linear-based, en-face view, best-circle method. Shoulder CT images of 91 patients (average age, 40 years; range, 14-89 years; 65 men) were retrospectively collected along with manual labels including glenoid segmentation, landmarks, and bone loss measurements. The multi-stage algorithm has three main stages: (1) segmentation, where we developed a U-Net to automatically segment the glenoid and humerus; (2) anatomical landmark detection, where a second network predicts glenoid rim points; and (3) geometric fitting, where we applied principal component analysis (PCA), projection, and circle fitting to compute the percentage of bone loss. The automated measurements showed strong agreement with consensus readings and exceeded surgeon-to-surgeon consistency (intraclass correlation coefficient (ICC) 0.84 vs 0.78), including in low- and high-bone-loss subgroups (ICC 0.71 vs 0.63 and 0.83 vs 0.21, respectively; P < 0.001). For classifying patients into low, medium, and high bone-loss categories, the pipeline achieved a recall of 0.714 for low and 0.857 for high severity, with no low cases misclassified as high or vice versa. These results suggest that our method is a time-efficient and clinically reliable tool for preoperative planning in shoulder instability and for screening patients with substantial glenoid bone loss. Code and dataset are available at https://github.com/Edenliu1/Auto-Glenoid-Measurement-DL-Pipeline."}
{"id": "2511.14694", "pdf": "https://arxiv.org/pdf/2511.14694", "abs": "https://arxiv.org/abs/2511.14694", "authors": ["Rui Zhu", "Xiaopu Zhou", "Haixu Tang", "Stephen W. Scherer", "Lucila Ohno-Machado"], "title": "Near-Lossless Model Compression Enables Longer Context Inference in DNA Large Language Models", "categories": ["q-bio.GN", "cs.AI", "cs.LG", "q-bio.PE"], "comment": null, "summary": "Trained on massive cross-species DNA corpora, DNA large language models (LLMs) learn the fundamental \"grammar\" and evolutionary patterns of genomic sequences. This makes them powerful priors for DNA sequence modeling, particularly over long ranges. However, two major constraints hinder their use in practice: the quadratic computational cost of self-attention and the growing memory required for key-value (KV) caches during autoregressive decoding. These constraints force the use of heuristics such as fixed-window truncation or sliding windows, which compromise fidelity on ultra-long sequences by discarding distant information. We introduce FOCUS (Feature-Oriented Compression for Ultra-long Self-attention), a progressive context-compression module that can be plugged into pretrained DNA LLMs. FOCUS combines the established k-mer representation in genomics with learnable hierarchical compression: it inserts summary tokens at k-mer granularity and progressively compresses attention key and value activations across multiple Transformer layers, retaining only the summary KV states across windows while discarding ordinary-token KV. A shared-boundary windowing scheme yields a stationary cross-window interface that propagates long-range information with minimal loss. We validate FOCUS on an Evo-2-based DNA LLM fine-tuned on GRCh38 chromosome 1 with self-supervised training and randomized compression schedules to promote robustness across compression ratios. On held-out human chromosomes, FOCUS achieves near-lossless fidelity: compressing a 1 kb context into only 10 summary tokens (about 100x) shifts the average per-nucleotide probability by only about 0.0004. Compared to a baseline without compression, FOCUS reduces KV-cache memory and converts effective inference scaling from O(N^2) to near-linear O(N), enabling about 100x longer inference windows on commodity GPUs with near-lossless fidelity."}
{"id": "2511.14388", "pdf": "https://arxiv.org/pdf/2511.14388", "abs": "https://arxiv.org/abs/2511.14388", "authors": ["Oriol Cabanas-Tirapu", "Sergio Cobo-Lopez", "Savannah E. Sanchez", "Forest L. Rohwer", "Marta Sales-Pardo", "Roger Guimerà"], "title": "Integral Bayesian symbolic regression for optimal discovery of governing equations from scarce and noisy data", "categories": ["physics.data-an", "math.DS", "physics.bio-ph", "q-bio.QM"], "comment": null, "summary": "Understanding how systems evolve over time often requires discovering the differential equations that govern their behavior. Automatically learning these equations from experimental data is challenging when the data are noisy or limited, and existing approaches struggle, in particular, with the estimation of unobserved derivatives. Here, we introduce an integral Bayesian symbolic regression method that learns governing equations directly from raw time-series data, without requiring manual assumptions or error-prone derivative estimation. By sampling the space of symbolic differential equations and evaluating them via numerical integration, our method robustly identifies governing equations even from noisy or scarce data. We show that this approach accurately recovers ground-truth models in synthetic benchmarks, and that it makes quasi-optimal predictions of system dynamics for all noise regimes. Applying this method to bacterial growth experiments across multiple species and substrates, we discover novel growth equations that outperform classical models in accurately capturing all phases of microbial proliferation, including lag, exponential, and saturation. Unlike standard approaches, our method reveals subtle shifts in growth dynamics, such as double ramp-ups or non-canonical transitions, offering a deeper, data-driven understanding of microbial physiology."}
{"id": "2511.13762", "pdf": "https://arxiv.org/pdf/2511.13762", "abs": "https://arxiv.org/abs/2511.13762", "authors": ["Jiaxin Qi", "Yan Cui", "Jianqiang Huang", "Gaogang Xie"], "title": "Gene Incremental Learning for Single-Cell Transcriptomics", "categories": ["cs.LG", "cs.AI", "q-bio.GN"], "comment": "Accepted by AAAI 2026", "summary": "Classes, as fundamental elements of Computer Vision, have been extensively studied within incremental learning frameworks. In contrast, tokens, which play essential roles in many research fields, exhibit similar characteristics of growth, yet investigations into their incremental learning remain significantly scarce. This research gap primarily stems from the holistic nature of tokens in language, which imposes significant challenges on the design of incremental learning frameworks for them. To overcome this obstacle, in this work, we turn to a type of token, gene, for a large-scale biological dataset--single-cell transcriptomics--to formulate a pipeline for gene incremental learning and establish corresponding evaluations. We found that the forgetting problem also exists in gene incremental learning, thus we adapted existing class incremental learning methods to mitigate the forgetting of genes. Through extensive experiments, we demonstrated the soundness of our framework design and evaluations, as well as the effectiveness of our method adaptations. Finally, we provide a complete benchmark for gene incremental learning in single-cell transcriptomics."}
{"id": "2511.14559", "pdf": "https://arxiv.org/pdf/2511.14559", "abs": "https://arxiv.org/abs/2511.14559", "authors": ["Xinzhe Zheng", "Shiyu Jiang", "Gustavo Seabra", "Chenglong Li", "Yanjun Li"], "title": "Apo2Mol: 3D Molecule Generation via Dynamic Pocket-Aware Diffusion Models", "categories": ["q-bio.BM", "cs.AI", "cs.LG", "q-bio.QM"], "comment": "Accepted by AAAI 2026", "summary": "Deep generative models are rapidly advancing structure-based drug design, offering substantial promise for generating small molecule ligands that bind to specific protein targets. However, most current approaches assume a rigid protein binding pocket, neglecting the intrinsic flexibility of proteins and the conformational rearrangements induced by ligand binding, limiting their applicability in practical drug discovery. Here, we propose Apo2Mol, a diffusion-based generative framework for 3D molecule design that explicitly accounts for conformational flexibility in protein binding pockets. To support this, we curate a dataset of over 24,000 experimentally resolved apo-holo structure pairs from the Protein Data Bank, enabling the characterization of protein structure changes associated with ligand binding. Apo2Mol employs a full-atom hierarchical graph-based diffusion model that simultaneously generates 3D ligand molecules and their corresponding holo pocket conformations from input apo states. Empirical studies demonstrate that Apo2Mol can achieve state-of-the-art performance in generating high-affinity ligands and accurately capture realistic protein pocket conformational changes."}
