{"id": "2512.15808", "pdf": "https://arxiv.org/pdf/2512.15808", "abs": "https://arxiv.org/abs/2512.15808", "authors": ["Amgad Muneer", "Kai Zhang", "Ibraheem Hamdi", "Rizwan Qureshi", "Muhammad Waqas", "Shereen Fouad", "Hazrat Ali", "Syed Muhammad Anwar", "Jia Wu"], "title": "Foundation Models in Biomedical Imaging: Turning Hype into Reality", "categories": ["q-bio.QM", "cs.AI", "cs.CV", "cs.LG"], "comment": "5 figures and 3 tables", "summary": "Foundation models (FMs) are driving a prominent shift in artificial intelligence across different domains, including biomedical imaging. These models are designed to move beyond narrow pattern recognition towards emulating sophisticated clinical reasoning, understanding complex spatial relationships, and integrating multimodal data with unprecedented flexibility. However, a critical gap exists between this potential and the current reality, where the clinical evaluation and deployment of FMs are hampered by significant challenges. Herein, we critically assess the current state-of-the-art, analyzing hype by examining the core capabilities and limitations of FMs in the biomedical domain. We also provide a taxonomy of reasoning, ranging from emulated sequential logic and spatial understanding to the integration of explicit symbolic knowledge, to evaluate whether these models exhibit genuine cognition or merely mimic surface-level patterns. We argue that a critical frontier lies beyond statistical correlation, in the pursuit of causal inference, which is essential for building robust models that understand cause and effect. Furthermore, we discuss the paramount issues in deployment stemming from trustworthiness, bias, and safety, dissecting the challenges of algorithmic bias, data bias and privacy, and model hallucinations. We also draw attention to the need for more inclusive, rigorous, and clinically relevant validation frameworks to ensure their safe and ethical application. We conclude that while the vision of autonomous AI-doctors remains distant, the immediate reality is the emergence of powerful technology and assistive tools that would benefit clinical practice. The future of FMs in biomedical imaging hinges not on scale alone, but on developing hybrid, causally aware, and verifiably safe systems that augment, rather than replace, human expertise."}
{"id": "2512.15828", "pdf": "https://arxiv.org/pdf/2512.15828", "abs": "https://arxiv.org/abs/2512.15828", "authors": ["Henry Nunns", "Manda Riehl"], "title": "Accessibility of Modified NK Fitness Landscapes", "categories": ["q-bio.QM"], "comment": "18 pages plus 13 pages of references and supplementary information", "summary": "In this paper we present two modifications of traditional $NK$ fitness landscapes, the $θNK$ and $HNK$ models, and explore these modifications via accessibility and ruggedness. The $θNK$ model introduces a parameter $θ$ to integrate local Rough Mount Fuji-type correlations in subgenotype contributions, simulating more biologically realistic correlated fitness effects. The $HNK$ model incorporates gene regulation effects by introducing a masking mechanism where certain loci modulate the expression of other loci, simulating effects observed in gene regulatory networks without modeling the full network. Through extensive simulations across a wide range of parameters ($N$, $K$, $θ$, and $H$), we analyze the impact of these modifications on landscape accessibility and the number of local optima. We find that increasing $θ$ or the number of masking loci ($H$) generally enhances accessibility, even in landscapes with many local optima, showing that ruggedness doesn't necessarily hinder evolutionary pathways. Additionally, distinct interaction patterns (blocked, adjacent, random) lead to different observations in accessibility and optimum structure. While more complex than traditional $NK$, we believe each model provides a new biologically relevant facet to fitness landscapes and provides insight into how genetic and regulatory structures influence the evolutionary potential of populations."}
{"id": "2512.15837", "pdf": "https://arxiv.org/pdf/2512.15837", "abs": "https://arxiv.org/abs/2512.15837", "authors": ["Ariful Islam Khandaker", "Abdullah Al Shafi", "Mohiuddin Ahmad"], "title": "Handling Class Imbalance Problem in Skin Lesion Classification: Finding Strengths and Weaknesses of Various Balancing Techniques", "categories": ["q-bio.QM"], "comment": "Accepted at 2025 International Conference on Quantum Photonics, Artificial Intelligence, and Networking (QPAIN)", "summary": "Automatic skin lesion classification from dermoscopy images is important for the early diagnosis of skin diseases such as melanoma. Class imbalance in skin lesion datasets, notably the defects in the representation of malignant(cancerous) cases, is one of the difficulties for deep learning models' performances and generalizations. This paper offers an exhaustive review of some of the balancing methods that aim to address class imbalances using the example of the ISIC 2016 dataset. A light-weight CNN model, MobileNetV2, was combined with under-sampling, over-sampling, and hybrid balancing methods such as Tomek Links(TL), SMOTE, and SMOTE with TL. Over-sampling methods like SMOTE and ADASYN improve performance but may lead to overfitting due to redundant synthetic samples. Hybrid methods like SMOTE+TL counter this drawback by removing noisy or boundary samples so that model generalization is enhanced. Thus, this analysis stresses the need to choose the right balancing methods for robust and sensitive diagnostic systems in medical image processing."}
{"id": "2512.15930", "pdf": "https://arxiv.org/pdf/2512.15930", "abs": "https://arxiv.org/abs/2512.15930", "authors": ["Matthew Sinclair", "Moeen Meigooni", "Archit Vasan", "Ozan Gokdemir", "Xinran Lian", "Heng Ma", "Yadu Babuji", "Alexander Brace", "Khalid Hossain", "Carlo Siebenschuh", "Thomas Brettin", "Kyle Chard", "Christopher Henry", "Venkatram Vishwanath", "Rick L. Stevens", "Ian T. Foster", "Arvind Ramanathan"], "title": "Scalable Agentic Reasoning for Designing Biologics Targeting Intrinsically Disordered Proteins", "categories": ["q-bio.QM", "cs.AI"], "comment": "This manuscript is under peer review for acceptance to the Proceedings of the Platform for Advanced Scientific Computing (PASC) 26 Conference", "summary": "Intrinsically disordered proteins (IDPs) represent crucial therapeutic targets due to their significant role in disease -- approximately 80\\% of cancer-related proteins contain long disordered regions -- but their lack of stable secondary/tertiary structures makes them \"undruggable\". While recent computational advances, such as diffusion models, can design high-affinity IDP binders, translating these to practical drug discovery requires autonomous systems capable of reasoning across complex conformational ensembles and orchestrating diverse computational tools at scale.To address this challenge, we designed and implemented StructBioReasoner, a scalable multi-agent system for designing biologics that can be used to target IDPs. StructBioReasoner employs a novel tournament-based reasoning framework where specialized agents compete to generate and refine therapeutic hypotheses, naturally distributing computational load for efficient exploration of the vast design space. Agents integrate domain knowledge with access to literature synthesis, AI-structure prediction, molecular simulations, and stability analysis, coordinating their execution on HPC infrastructure via an extensible federated agentic middleware, Academy. We benchmark StructBioReasoner across Der f 21 and NMNAT-2 and demonstrate that over 50\\% of 787 designed and validated candidates for Der f 21 outperformed the human-designed reference binders from literature, in terms of improved binding free energy. For the more challenging NMNAT-2 protein, we identified three binding modes from 97,066 binders, including the well-studied NMNAT2:p53 interface. Thus, StructBioReasoner lays the groundwork for agentic reasoning systems for IDP therapeutic discovery on Exascale platforms."}
{"id": "2512.16084", "pdf": "https://arxiv.org/pdf/2512.16084", "abs": "https://arxiv.org/abs/2512.16084", "authors": ["Zeinab Jabbari Velisdeh", "David K. Mills"], "title": "Can plants grow on the Moon and Mars: seed germination enhancement using magnesium oxide coated halloysite nanotubes (MgO HNTs)", "categories": ["q-bio.QM"], "comment": "36 pages, 17 figures, 7 tables", "summary": "This study examines the application of metal coated nanotubes, specifically magnesium oxide coated halloysite nanotubes (MgO HNTs), to enhance seed germination and early plant development under Earth, lunar, and Martian soil conditions. MgO HNTs were synthesized through an electrodeposition process and characterized by scanning electron microscopy to confirm successful surface modification. Growth experiments using Heirloom Cherry Tomato and Golden Tomato seeds were conducted under hydroponic and soil based conditions and subsequently extended to lunar and Martian regolith simulants. A response surface methodology approach based on a Box Behnken design was used to evaluate the effects of temperature, MgO HNT concentration, and light duration on multiple growth responses. Seedling length and the root length stress tolerance index were identified as the most responsive indicators of MgO HNT treatment. Optimal conditions consisting of 25 C, 12 h light exposure, and 100 mg per L MgO HNTs produced the greatest increases in root and shoot length in Earth soil simulants. Validation experiments in extraterrestrial regolith analogs showed that MgO HNTs supported germination, root penetration, and overall seedling vigor under nutrient limited and high stress conditions. Lunar regolith exhibited maximal root development at 100 mg per L, whereas Martian regolith showed optimal growth at 10 mg per L, reflecting differences in mineral composition and oxidative characteristics. These findings demonstrate that MgO HNTs can enhance early plant development across both terrestrial and extraterrestrial substrates and support their potential use as nanomaterial based amendments for sustainable plant cultivation in Earth and space environments."}
