{"id": "2512.21895", "pdf": "https://arxiv.org/pdf/2512.21895", "abs": "https://arxiv.org/abs/2512.21895", "authors": ["Hao-Yu Zhu", "Shi-Jie Du", "Lu Xu", "Wei Shi"], "title": "Drug discovery guided by maximum drug likeness", "categories": ["q-bio.QM"], "comment": "46 pages,8 figures, 5 tables", "summary": "To overcome the high attrition rate and limited clinical translatability in drug discovery, we introduce the concept of Maximum Drug-Likeness (MDL) and develop an applicable Fivefold MDL strategy (5F-MDL) to reshape the screening paradigm. The 5F-MDL strategy integrates an ensemble of 33 deep learning sub-models to construct a 33-dimensional property spectrum that quantifies the global phenotypic alignment of candidate molecules with clinically approved drugs along five axes: physicochemical properties, pharmacokinetics, efficacy, safety, and stability. Using drug-likeness scores derived from this 33-dimensional profile, we prioritized 15 high-potential molecules from a 16-million-molecule library. Experimental validation demonstrated that the lead compound M2 not only exhibits potent antibacterial activity, with a minimum inhibitory concentration (MIC) of 25.6 ug/mL, but also achieves binding stability superior to cefuroxime, as indicated by Molecular Mechanics Poisson-Boltzmann surface area (MM-PBSA) calculations of -38.54 kcal/mol and a root-mean-square deviation (RMSD) of 2.8 A. This strategy could overcome scaffold constraints and offers an efficient route for discovering lead compounds with favorable prospects against drug-resistant bacteria."}
{"id": "2512.21952", "pdf": "https://arxiv.org/pdf/2512.21952", "abs": "https://arxiv.org/abs/2512.21952", "authors": ["Md Fantacher Islam", "Emeral Norzagaray", "Corneliu Antonescu", "Vignesh Subbian"], "title": "Characterizing Fungal Infections in the All of Us Research Program", "categories": ["q-bio.QM"], "comment": null, "summary": "Fungal infections, such as Coccidioidomycosis, Aspergillosis, and Histoplasmosis, represent a growing public health concern in the United States. The rising incidence of these mycoses is linked to climate shifts, demographic changes, and social determinants of health. However, the actual burden of these infections is often underestimated by traditional surveillance methods. Therefore, this study aims to characterize these infections within the All of Us Research Program and evaluate the quality of clinical and health data related to fungal infections. We constructed three fungi cohorts of Coccidioidomycosis (n=1,173), Aspergillosis (n=687), and Histoplasmosis (n=345) among over 400,000 participants using electronic health record data. We analyzed geographic and sociodemographic distributions and performed a data quality assessment on ten key laboratory biomarkers to evaluate data completeness, unit conformance, and measurement concordance within a 90-day window of diagnosis. Our analysis confirmed known epidemiological patterns, including the geographic distributions of Coccidioidomycosis in the Southwest and Histoplasmosis in the Midwest. Fungal infections disproportionately affected older adults, males, and White non-Hispanic individuals. The data quality assessment revealed high completeness for general hematology markers (e.g., Hemoglobin > 70%) but limited availability for biomarkers, such as Beta 1,3 Glucan (< 15%). While measurement concordance was strong (e.g., hemoglobin-hematocrit correlation, r = 0.94), unit conformance was poor for key inflammatory markers, such as erythrocyte sedimentation rate. In conclusion, the All of Us dataset is a valuable resource for characterizing fungal infections. However, significant data quality issues related to completeness and conformance for specialized biomarkers must be addressed to enhance their applicability for robust clinical research."}
{"id": "2512.21997", "pdf": "https://arxiv.org/pdf/2512.21997", "abs": "https://arxiv.org/abs/2512.21997", "authors": ["Daan Beijersbergen", "Jérôme Charmet"], "title": "Sample volume as a key design parameter in affinity-based biosensors", "categories": ["q-bio.QM"], "comment": "30 pages including Main Article (19 pages, 6 figures) and Supplementary Material (11 pages, 10 figures)", "summary": "Affinity-based biosensors have become indispensable in modern diagnostics and health monitoring. While considerable research has focused on optimizing analyte transport and binding kinetics, a fundamental parameter - sample volume - remains largely underexplored in biosensor design. This is critical because biosensor performance depends on the absolute number of target molecules present, not solely their concentration, making volume a key consideration where sample availability is limited. To address this gap, we developed a tractable two-compartment mathematical model integrating simplified mass transport, Langmuir binding kinetics, and mass conservation under finite volume constraints. Validated against experimental measurements and numerical simulations, the model accurately predicts critical performance metrics including assay time and minimum required sample volume while achieving more than a 10,000-fold reduction in computational time compared to commercial simulation packages. Through systematic analysis, we derived quantitative design rules for biosensor optimization that explicitly account for measurement time and sample volume as primary decision variables. We validated this framework experimentally by optimizing flow rate parameters for a quartz crystal microbalance (QCM) biosensor and retrospectively applied it to enhance sensitivity of published biosensor designs. Released as open-source software, our model enables researchers to gain mechanistic insights, optimize device performance, and make informed design decisions tailored to specific healthcare contexts, including point-of-care testing and resource-constrained environments."}
{"id": "2512.21623", "pdf": "https://arxiv.org/pdf/2512.21623", "abs": "https://arxiv.org/abs/2512.21623", "authors": ["Takahide Suzuki", "Kazuki Nakanishi", "Takashi Fujiwara", "Hideyuki Shimizu"], "title": "Democratizing Drug Discovery with an Orchestrated, Knowledge-Driven Multi-Agent Team for User-Guided Therapeutic Design", "categories": ["cs.AI", "cs.MA", "q-bio.QM"], "comment": "51 pages, 4 figures (with supplementary information)", "summary": "Therapeutic discovery remains a formidable challenge, impeded by the fragmentation of specialized domains and the execution gap between computational design and physiological validation. Although generative AI offers promise, current models often function as passive assistants rather than as autonomous executors. Here, we introduce OrchestRA, a human-in-the-loop multi-agent platform that unifies biology, chemistry, and pharmacology into an autonomous discovery engine. Unlike static code generators, our agents actively execute simulations and reason the results to drive iterative optimization. Governed by an Orchestrator, a Biologist Agent leverages deep reasoning over a massive knowledge graph (>10 million associations) to pinpoint high-confidence targets; a Chemist Agent autonomously detects structural pockets for de novo design or drug repositioning; and a Pharmacologist Agent evaluates candidates via rigorous physiologically based pharmacokinetic (PBPK) simulations. This architecture establishes a dynamic feedback loop where pharmacokinetic and toxicity profiles directly trigger structural reoptimization. By seamlessly integrating autonomous execution with human guidance, OrchestRA democratizes therapeutic design, transforming drug discovery from a stochastic search to a programmable evidence-based engineering discipline."}
{"id": "2512.21988", "pdf": "https://arxiv.org/pdf/2512.21988", "abs": "https://arxiv.org/abs/2512.21988", "authors": ["Sungwoo Kang"], "title": "The Color-Clinical Decoupling: Why Perceptual Calibration Fails Clinical Biomarkers in Smartphone Dermatology", "categories": ["eess.IV", "cs.CV", "q-bio.QM"], "comment": null, "summary": "Smartphone-based tele-dermatology assumes that colorimetric calibration ensures clinical reliability, yet this remains untested for underrepresented skin phototypes. We investigated whether standard calibration translates to reliable clinical biomarkers using 43,425 images from 965 Korean subjects (Fitzpatrick III-IV) across DSLR, tablet, and smartphone devices. While Linear Color Correction Matrix (CCM) normalization reduced color error by 67-77% -- achieving near-clinical accuracy (Delta E < 2.3) -- this success did not translate to biomarker reliability.\n  We identify a phenomenon termed \"color-clinical decoupling\": despite perceptual accuracy, the Individual Typology Angle (ITA) showed poor inter-device agreement (ICC = 0.40), while the Melanin Index achieved good agreement (ICC = 0.77). This decoupling is driven by the ITA formula's sensitivity to b* channel noise and is further compounded by anatomical variance. Facial region accounts for 25.2% of color variance -- 3.6x greater than device effects (7.0%) -- challenging the efficacy of single-patch calibration. Our results demonstrate that current colorimetric standards are insufficient for clinical-grade biomarker extraction, necessitating region-aware protocols for mobile dermatology."}
