{"id": "2510.06290", "pdf": "https://arxiv.org/pdf/2510.06290", "abs": "https://arxiv.org/abs/2510.06290", "authors": ["Bang Chen", "Lijun Guo", "Houli Fan", "Wentao He", "Rong Zhang"], "title": "Soft-Evidence Fused Graph Neural Network for Cancer Driver Gene Identification across Multi-View Biological Graphs", "categories": ["q-bio.GN", "cs.AI", "cs.LG"], "comment": "8pages", "summary": "Identifying cancer driver genes (CDGs) is essential for understanding cancer\nmechanisms and developing targeted therapies. Graph neural networks (GNNs) have\nrecently been employed to identify CDGs by capturing patterns in biological\ninteraction networks. However, most GNN-based approaches rely on a single\nprotein-protein interaction (PPI) network, ignoring complementary information\nfrom other biological networks. Some studies integrate multiple networks by\naligning features with consistency constraints to learn unified gene\nrepresentations for CDG identification. However, such representation-level\nfusion often assumes congruent gene relationships across networks, which may\noverlook network heterogeneity and introduce conflicting information. To\naddress this, we propose Soft-Evidence Fusion Graph Neural Network (SEFGNN), a\nnovel framework for CDG identification across multiple networks at the decision\nlevel. Instead of enforcing feature-level consistency, SEFGNN treats each\nbiological network as an independent evidence source and performs\nuncertainty-aware fusion at the decision level using Dempster-Shafer Theory\n(DST). To alleviate the risk of overconfidence from DST, we further introduce a\nSoft Evidence Smoothing (SES) module that improves ranking stability while\npreserving discriminative performance. Experiments on three cancer datasets\nshow that SEFGNN consistently outperforms state-of-the-art baselines and\nexhibits strong potential in discovering novel CDGs."}
{"id": "2510.06554", "pdf": "https://arxiv.org/pdf/2510.06554", "abs": "https://arxiv.org/abs/2510.06554", "authors": ["Yue Hu", "Zanxia Cao", "Yingchao Liu"], "title": "UniOTalign: A Global Matching Framework for Protein Alignment via Optimal Transport", "categories": ["q-bio.QM", "92D20"], "comment": "7 pages, 1 table", "summary": "Protein sequence alignment is a cornerstone of bioinformatics, traditionally\napproached using dynamic programming (DP) algorithms that find an optimal\nsequential path. This paper introduces UniOTalign, a novel framework that\nrecasts alignment from a fundamentally different perspective: global matching\nvia Optimal Transport (OT). Instead of finding a path, UniOTalign computes an\noptimal flow or transport plan between two proteins, which are represented as\ndistributions of residues in a high-dimensional feature space. We leverage\npre-trained Protein Language Models (PLMs) to generate rich, context-aware\nembeddings for each residue. The core of our method is the Fused Unbalanced\nGromov-Wasserstein (FUGW) distance, which finds a correspondence that\nsimultaneously minimizes feature dissimilarity and preserves the internal\ngeometric structure of the sequences. This approach naturally handles sequences\nof different lengths and is particularly powerful for aligning proteins with\nnonsequential similarities, such as domain shuffling or circular permutations,\nwhich are challenging for traditional DP methods. UniOTalign therefore offers a\nnew, mathematically principled, global matching paradigm for protein alignment,\nmoving beyond the limitations of path-finding algorithms."}
{"id": "2510.06578", "pdf": "https://arxiv.org/pdf/2510.06578", "abs": "https://arxiv.org/abs/2510.06578", "authors": ["Wensi Wu", "Matthew Daemer", "Jeffrey A. Weiss", "Alison M. Pouch", "Matthew A. Jolley"], "title": "Novel point cloud registration approach for noninvasive patient specific estimation of leaflet strain from 3D images of heart valves", "categories": ["q-bio.QM"], "comment": null, "summary": "Valvular heart disease is prevalent and a major contributor to heart failure.\nValve leaflet strain is a promising metric for evaluating the mechanics\nunderlying the initiation and progression of valvular pathology. However,\nrobust and generalizable methods for noninvasively quantifying valvular strain\nfrom clinically acquired patient images remain limited. In this work, we\npresent a novel feature-tracking framework for quantifying leaflet strain in\natrioventricular valves using 3D echocardiographic images of pediatric and\nadult patients. Our method demonstrated superior accuracy in the assessment of\nanatomical deformation and strain of heart valves compared to other point-based\napproaches, as verified against a finite element benchmark. Further, our\napproach can robustly track inter-phase deformation of valves across highly\nvariable morphologies without parameter tuning. Our analysis revealed that a\nmedian and interquartile range of the 1st principal strain greater than 0.5 is\nassociated with leaflet billow (prolapse). Further investigation of the\nbiomechanical signatures of heart valve disease has the potential to enhance\nprognostic assessment and longitudinal evaluation of valvular disease."}
{"id": "2510.07286", "pdf": "https://arxiv.org/pdf/2510.07286", "abs": "https://arxiv.org/abs/2510.07286", "authors": ["Jigang Fan", "Xiaoran Jiao", "Shengdong Lin", "Zhanming Liang", "Weian Mao", "Chenchen Jing", "Hao Chen", "Chunhua Shen"], "title": "Evolutionary Profiles for Protein Fitness Prediction", "categories": ["cs.LG", "cs.AI", "q-bio.BM", "q-bio.QM"], "comment": null, "summary": "Predicting the fitness impact of mutations is central to protein engineering\nbut constrained by limited assays relative to the size of sequence space.\nProtein language models (pLMs) trained with masked language modeling (MLM)\nexhibit strong zero-shot fitness prediction; we provide a unifying view by\ninterpreting natural evolution as implicit reward maximization and MLM as\ninverse reinforcement learning (IRL), in which extant sequences act as expert\ndemonstrations and pLM log-odds serve as fitness estimates. Building on this\nperspective, we introduce EvoIF, a lightweight model that integrates two\ncomplementary sources of evolutionary signal: (i) within-family profiles from\nretrieved homologs and (ii) cross-family structural-evolutionary constraints\ndistilled from inverse folding logits. EvoIF fuses sequence-structure\nrepresentations with these profiles via a compact transition block, yielding\ncalibrated probabilities for log-odds scoring. On ProteinGym (217 mutational\nassays; >2.5M mutants), EvoIF and its MSA-enabled variant achieve\nstate-of-the-art or competitive performance while using only 0.15% of the\ntraining data and fewer parameters than recent large models. Ablations confirm\nthat within-family and cross-family profiles are complementary, improving\nrobustness across function types, MSA depths, taxa, and mutation depths. The\ncodes will be made publicly available at https://github.com/aim-uofa/EvoIF."}
