{"id": "2512.18442", "pdf": "https://arxiv.org/pdf/2512.18442", "abs": "https://arxiv.org/abs/2512.18442", "authors": ["Tianyu Wu"], "title": "Markovian Promoter Models: A Mechanistic Alternative to Hill Functions in Gene Regulatory Networks", "categories": ["q-bio.MN", "q-bio.QM"], "comment": null, "summary": "Gene regulatory networks are typically modeled using ordinary differential equations (ODEs) with phenomenological Hill functions to represent transcriptional regulation. While computationally efficient, Hill functions lack mechanistic grounding and cannot capture stochastic promoter dynamics. We present a hybrid Markovian-ODE framework that explicitly models discrete promoter states while maintaining computational tractability. Our approach tracks individual transcription factor binding events as a continuous-time Markov chain, coupled with deterministic ODEs for molecular concentrations. We validate this framework on seven gene regulatory systems spanning basic to advanced complexity: the GAL system, repressilator, Goodwin oscillator, toggle switch, incoherent feed-forward loop, p53-Mdm2 oscillator, and NF-$κ$B pathway. Comparison with stochastic simulation algorithm (SSA) ground truth demonstrates that Markovian promoter models achieve similar accuracy to full stochastic simulations while being 10-100$\\times$ faster. Our framework provides a mechanistic foundation for gene regulation modeling and enables investigation of promoter-level stochasticity in complex regulatory networks."}
{"id": "2512.18752", "pdf": "https://arxiv.org/pdf/2512.18752", "abs": "https://arxiv.org/abs/2512.18752", "authors": ["Michael Jirasek", "Abhishek Sharma", "Mary Wong", "Jennifer Munro", "Leroy Cronin"], "title": "Quantifying the Emergence of Selection Prior to Biological Evolution", "categories": ["q-bio.MN", "physics.bio-ph", "q-bio.PE"], "comment": "20 pages, 6 figures, 29 references", "summary": "Selection is central to biological evolution, yet there has been no general experimental framework for quantifying selection in chemical systems before life. Here we demonstrate that selection in a prebiological chemical system can be directly quantified. Assembly Theory predicts that selection corresponds to a transition from undirected to directed exploration of chemical possibility space, measurable through the amount of Assembly, A, which integrates molecular assembly index with observed copy number. By analysing peptide ensembles produced under diverse polymerisation conditions, we show that undirected reactions explore sequence space almost uniformly, yielding exploration ratios of 0.85-0.95, whereas reactions influenced by evolved proteases generate markedly lower ratios (0.51-0.75) and elevated A, consistent with selective reinforcement of specific assembly pathways. Across multiple environments and amino-acid combinations, the exploration ratio and ensemble assembly A robustly distinguish directed from undirected exploration, establishing a general, experimentally tractable metric for detecting and measuring selection in chemical evolution."}
{"id": "2512.17988", "pdf": "https://arxiv.org/pdf/2512.17988", "abs": "https://arxiv.org/abs/2512.17988", "authors": ["Avigail Taylor", "Micah P. Fletcher"], "title": "easyplater: The easy way to generate microplate designs deconvolved from multivariate clinical data", "categories": ["q-bio.QM"], "comment": "All in one PDF: 18 pages, 10 figures, 2 boxes, 1 table", "summary": "Microplate-based 'omic studies of large clinical cohorts can massively accelerate biomedical research, but experimental power and veracity may be negatively impacted when plate positional effects confound clinical variables of interest. Plate designs must therefore deconvolve this technical and biological variation, and several computational approaches now exist to achieve this. However, even the most advanced of these methods requires too much user intervention to ensure designs adhere to spatial constraints. Here, we aim to significantly reduce researcher-hours spent in plate design with three innovations: First, we propose a weighted, multivariate plate design score that uses a novel metric of spatial autocorrelation to reward designs where similar samples are in distal wells, and which also incorporates penalties for local, variable-wise homogeneous regions; Next, we use a network-based approach to identify clinically similar samples, and then generate an initial plate design randomized under the constraint that similar samples are allocated to distal wells; Lastly, we propose a novel method to quickly search plate-design space for an improvement on the initial design, as measured by the plate design score. We have implemented this method in easyplater, an R package for generating 96-well plate designs which takes sample clinical data and user-assigned clinical variable weights as input, and outputs the most deconvolved plate design it finds in CSV, XLSX, and HTML formats. Overall, easyplater reduces the need for user intervention in plate design, outperforms currently available methods, and is an important advancement as large, well-phenotyped cohorts become available for high-throughput 'omic studies and numbers of plates and clinical variables increase."}
{"id": "2512.18114", "pdf": "https://arxiv.org/pdf/2512.18114", "abs": "https://arxiv.org/abs/2512.18114", "authors": ["Robert Calef", "Arthur Liang", "Manolis Kellis", "Marinka Zitnik"], "title": "Greater than the Sum of Its Parts: Building Substructure into Protein Encoding Models", "categories": ["q-bio.QM"], "comment": null, "summary": "Protein representation learning has advanced rapidly with the scale-up of sequence and structure supervision, but most models still encode proteins either as per-residue token sequences or as single global embeddings. This overlooks a defining property of protein organization: proteins are built from recurrent, evolutionarily conserved substructures that concentrate biochemical activity and mediate core molecular functions. Although substructures such as domains and functional sites are systematically cataloged, they are rarely used as training signals or representation units in protein models. We introduce Magneton, an environment for developing substructure-aware protein models. Magneton provides (1) a dataset of 530,601 proteins annotated with over 1.7 million substructures spanning 13,075 types, (2) a training framework for incorporating substructures into existing protein models, and (3) a benchmark suite of 13 tasks probing representations at the residue, substructural, and protein levels. Using Magneton, we develop substructure-tuning, a supervised fine-tuning method that distills substructural knowledge into pretrained protein models. Across state-of-the-art sequence- and structure-based models, substructure-tuning improves function prediction, yields more consistent representations of substructure types never observed during tuning, and shows that substructural supervision provides information that is complementary to global structure inputs. The Magneton environment, datasets, and substructure-tuned models are all openly available (https://github.com/rcalef/magneton/)."}
{"id": "2512.18197", "pdf": "https://arxiv.org/pdf/2512.18197", "abs": "https://arxiv.org/abs/2512.18197", "authors": ["Yilei Wu", "Yichi Zhang", "Zijian Dong", "Fang Ji", "An Sen Tan", "Gifford Tan", "Sizhao Tang", "Huijuan Chen", "Zijiao Chen", "Eric Kwun Kei Ng", "Jose Bernal", "Hang Min", "Ying Xia", "Ines Vati", "Liz Cooper", "Xiaoyu Hu", "Yuchen Pei", "Yutao Ma", "Victor Nozais", "Ami Tsuchida", "Pierre-Yves Hervé", "Philippe Boutinaud", "Marc Joliot", "Junghwa Kang", "Wooseung Kim", "Dayeon Bak", "Rachika E. Hamadache", "Valeriia Abramova", "Xavier Lladó", "Yuntao Zhu", "Zhenyu Gong", "Xin Chen", "John McFadden", "Pek Lan Khong", "Roberto Duarte Coello", "Hongwei Bran Li", "Woon Puay Koh", "Christopher Chen", "Joanna M. Wardlaw", "Maria del C. Valdés Hernández", "Juan Helen Zhou"], "title": "Standardized Evaluation of Automatic Methods for Perivascular Spaces Segmentation in MRI -- MICCAI 2024 Challenge Results", "categories": ["q-bio.QM", "cs.CV", "eess.IV"], "comment": null, "summary": "Perivascular spaces (PVS), when abnormally enlarged and visible in magnetic resonance imaging (MRI) structural sequences, are important imaging markers of cerebral small vessel disease and potential indicators of neurodegenerative conditions. Despite their clinical significance, automatic enlarged PVS (EPVS) segmentation remains challenging due to their small size, variable morphology, similarity with other pathological features, and limited annotated datasets. This paper presents the EPVS Challenge organized at MICCAI 2024, which aims to advance the development of automated algorithms for EPVS segmentation across multi-site data. We provided a diverse dataset comprising 100 training, 50 validation, and 50 testing scans collected from multiple international sites (UK, Singapore, and China) with varying MRI protocols and demographics. All annotations followed the STRIVE protocol to ensure standardized ground truth and covered the full brain parenchyma. Seven teams completed the full challenge, implementing various deep learning approaches primarily based on U-Net architectures with innovations in multi-modal processing, ensemble strategies, and transformer-based components. Performance was evaluated using dice similarity coefficient, absolute volume difference, recall, and precision metrics. The winning method employed MedNeXt architecture with a dual 2D/3D strategy for handling varying slice thicknesses. The top solutions showed relatively good performance on test data from seen datasets, but significant degradation of performance was observed on the previously unseen Shanghai cohort, highlighting cross-site generalization challenges due to domain shift. This challenge establishes an important benchmark for EPVS segmentation methods and underscores the need for the continued development of robust algorithms that can generalize in diverse clinical settings."}
{"id": "2512.19416", "pdf": "https://arxiv.org/pdf/2512.19416", "abs": "https://arxiv.org/abs/2512.19416", "authors": ["Mamoru Saita", "Yutaka Hori"], "title": "Machine Learning of Temperature-dependent Chemical Kinetics Using Parallel Droplet Microreactors", "categories": ["q-bio.QM", "eess.SY", "physics.bio-ph"], "comment": null, "summary": "Temperature is a fundamental regulator of chemical and biochemical kinetics, yet capturing nonlinear thermal effects directly from experimental data remains a major challenge due to limited throughput and model flexibility. Recent advances in machine learning have enabled flexible modeling beyond conventional physical laws, but most existing strategies remain confined to surrogate models of end-point yields rather than full kinetic dynamics. Consequently, an end-to-end framework that unifies systematic kinetic data acquisition with machine learning based modeling has been lacking. In this paper, we present a unified framework that integrates droplet microfluidics with machine learning for the systematic analysis of temperature-dependent reaction kinetics. The platform is specifically designed to enable stable immobilization and long-term time-lapse imaging of thousands of droplets under dynamic thermal gradients. This configuration yields massively parallel time-resolved datasets across diverse temperature conditions that capture transient kinetics and provides particularly suitable inputs for training machine-learning models of reaction dynamics. Leveraging these datasets, we train Neural ODE models, which embed neural networks within differential equations to flexibly represent nonlinear temperature dependencies beyond conventional formulations. We demonstrate accurate prediction of enzymatic kinetics across diverse thermal environments, highlighting the robustness and versatility of the approach. Our framework bridges high-throughput experimental data acquisition with data-driven modeling, establishing a versatile foundation for enhanced predictive ability and rational analysis and design of temperature-sensitive biochemical processes."}
{"id": "2512.08589", "pdf": "https://arxiv.org/pdf/2512.08589", "abs": "https://arxiv.org/abs/2512.08589", "authors": ["Swarn Singh Warshaneyan", "Maksims Ivanovs", "Blaž Cugmas", "Inese Bērziņa", "Laura Goldberga", "Mindaugas Tamosiunas", "Roberts Kadiķis"], "title": "Automated Pollen Recognition in Optical and Holographic Microscopy Images", "categories": ["cs.CV", "cs.LG", "q-bio.QM"], "comment": "08 pages, 10 figures, 04 tables, 20 references. Date of Conference: 13-14 June 2025 Date Added to IEEE Xplore: 10 July 2025 Electronic ISBN: 979-8-3315-0969-9 Print on Demand(PoD) ISBN: 979-8-3315-0970-5 DOI: 10.1109/AICCONF64766.2025.11064260 Conference Location: Prague, Czech Republic Online Access: https://ieeexplore.ieee.org/document/11064260", "summary": "This study explores the application of deep learning to improve and automate pollen grain detection and classification in both optical and holographic microscopy images, with a particular focus on veterinary cytology use cases. We used YOLOv8s for object detection and MobileNetV3L for the classification task, evaluating their performance across imaging modalities. The models achieved 91.3% mAP50 for detection and 97% overall accuracy for classification on optical images, whereas the initial performance on greyscale holographic images was substantially lower. We addressed the performance gap issue through dataset expansion using automated labeling and bounding box area enlargement. These techniques, applied to holographic images, improved detection performance from 2.49% to 13.3% mAP50 and classification performance from 42% to 54%. Our work demonstrates that, at least for image classification tasks, it is possible to pair deep learning techniques with cost-effective lensless digital holographic microscopy devices."}
{"id": "2512.17930", "pdf": "https://arxiv.org/pdf/2512.17930", "abs": "https://arxiv.org/abs/2512.17930", "authors": ["Aziz Muminov", "Anne Pham"], "title": "CytoDINO: Risk-Aware and Biologically-Informed Adaptation of DINOv3 for Bone Marrow Cytomorphology", "categories": ["q-bio.OT", "cs.CV", "eess.IV", "q-bio.QM"], "comment": "11 pages, 3 figures", "summary": "Bone marrow cell cytomorphology analysis is critical for the diagnosis of hematological malignancies but remains a labor-intensive process subject to significant inter-observer variability. While recent foundation models have shown promise in computational pathology, they often require extensive computational resources and fail to account for the asymmetric risks associated with clinical misdiagnosis. We introduce CytoDINO, a framework that achieves state-of-the-art performance on the Munich Leukemia Laboratory (MLL) dataset by fine-tuning DINOv3 using Low-Rank Adaptation (LoRA). Our primary contribution is a novel Hierarchical Focal Loss with Critical Penalties, which encodes biological relationships between cell lineages and explicitly penalizes clinically dangerous misclassifications (e.g., classifying blasts as normal cells). CytoDINO achieves an 88.2% weighted F1 score and 76.5% macro F1 on a held-out test set of 21 cell classes. By utilizing parameter-efficient fine-tuning with only 8% trainable parameters on a single NVIDIA RTX 5080, we demonstrate that consumer-grade hardware can match specialized infrastructure. Furthermore, confidence-based selective prediction yields 99.5% accuracy on 67% of samples, suggesting a viable pathway for clinical deployment where high-uncertainty cases are flagged for expert review"}
{"id": "2512.18442", "pdf": "https://arxiv.org/pdf/2512.18442", "abs": "https://arxiv.org/abs/2512.18442", "authors": ["Tianyu Wu"], "title": "Markovian Promoter Models: A Mechanistic Alternative to Hill Functions in Gene Regulatory Networks", "categories": ["q-bio.MN", "q-bio.QM"], "comment": null, "summary": "Gene regulatory networks are typically modeled using ordinary differential equations (ODEs) with phenomenological Hill functions to represent transcriptional regulation. While computationally efficient, Hill functions lack mechanistic grounding and cannot capture stochastic promoter dynamics. We present a hybrid Markovian-ODE framework that explicitly models discrete promoter states while maintaining computational tractability. Our approach tracks individual transcription factor binding events as a continuous-time Markov chain, coupled with deterministic ODEs for molecular concentrations. We validate this framework on seven gene regulatory systems spanning basic to advanced complexity: the GAL system, repressilator, Goodwin oscillator, toggle switch, incoherent feed-forward loop, p53-Mdm2 oscillator, and NF-$κ$B pathway. Comparison with stochastic simulation algorithm (SSA) ground truth demonstrates that Markovian promoter models achieve similar accuracy to full stochastic simulations while being 10-100$\\times$ faster. Our framework provides a mechanistic foundation for gene regulation modeling and enables investigation of promoter-level stochasticity in complex regulatory networks."}
{"id": "2512.18454", "pdf": "https://arxiv.org/pdf/2512.18454", "abs": "https://arxiv.org/abs/2512.18454", "authors": ["David Graber", "Victor Armegioiu", "Rebecca Buller", "Siddhartha Mishra"], "title": "Out-of-Distribution Detection in Molecular Complexes via Diffusion Models for Irregular Graphs", "categories": ["cs.LG", "q-bio.QM"], "comment": null, "summary": "Predictive machine learning models generally excel on in-distribution data, but their performance degrades on out-of-distribution (OOD) inputs. Reliable deployment therefore requires robust OOD detection, yet this is particularly challenging for irregular 3D graphs that combine continuous geometry with categorical identities and are unordered by construction. Here, we present a probabilistic OOD detection framework for complex 3D graph data built on a diffusion model that learns a density of the training distribution in a fully unsupervised manner. A key ingredient we introduce is a unified continuous diffusion over both 3D coordinates and discrete features: categorical identities are embedded in a continuous space and trained with cross-entropy, while the corresponding diffusion score is obtained analytically via posterior-mean interpolation from predicted class probabilities. This yields a single self-consistent probability-flow ODE (PF-ODE) that produces per-sample log-likelihoods, providing a principled typicality score for distribution shift. We validate the approach on protein-ligand complexes and construct strict OOD datasets by withholding entire protein families from training. PF-ODE likelihoods identify held-out families as OOD and correlate strongly with prediction errors of an independent binding-affinity model (GEMS), enabling a priori reliability estimates on new complexes. Beyond scalar likelihoods, we show that multi-scale PF-ODE trajectory statistics - including path tortuosity, flow stiffness, and vector-field instability - provide complementary OOD information. Modeling the joint distribution of these trajectory features yields a practical, high-sensitivity detector that improves separation over likelihood-only baselines, offering a label-free OOD quantification workflow for geometric deep learning."}
