{"id": "2508.03759", "pdf": "https://arxiv.org/pdf/2508.03759", "abs": "https://arxiv.org/abs/2508.03759", "authors": ["Tatwadarshi P. Nagarhalli", "Shruti S. Pawar", "Soham A. Dahanukar", "Uday Aswalekar", "Ashwini M. Save", "Sanket D. Patil"], "title": "Assessing the Impact of Image Super Resolution on White Blood Cell Classification Accuracy", "categories": ["eess.IV", "cs.CV", "cs.LG", "q-bio.QM"], "comment": null, "summary": "Accurately classifying white blood cells from microscopic images is essential\nto identify several illnesses and conditions in medical diagnostics. Many deep\nlearning technologies are being employed to quickly and automatically classify\nimages. However, most of the time, the resolution of these microscopic pictures\nis quite low, which might make it difficult to classify them correctly. Some\npicture improvement techniques, such as image super-resolution, are being\nutilized to improve the resolution of the photos to get around this issue. The\nsuggested study uses large image dimension upscaling to investigate how\npicture-enhancing approaches affect classification performance. The study\nspecifically looks at how deep learning models may be able to understand more\ncomplex visual information by capturing subtler morphological changes when\nimage resolution is increased using cutting-edge techniques. The model may\nlearn from standard and augmented data since the improved images are\nincorporated into the training process. This dual method seeks to comprehend\nthe impact of image resolution on model performance and enhance classification\naccuracy. A well-known model for picture categorization is used to conduct\nextensive testing and thoroughly evaluate the effectiveness of this approach.\nThis research intends to create more efficient image identification algorithms\ncustomized to a particular dataset of white blood cells by understanding the\ntrade-offs between ordinary and enhanced images."}
{"id": "2508.04056", "pdf": "https://arxiv.org/pdf/2508.04056", "abs": "https://arxiv.org/abs/2508.04056", "authors": ["Yuelin Deng", "Hinayah Rojas de Oliveira", "Richard M. Voyles", "Upinder Kaur"], "title": "SCOUT: An in-vivo Methane Sensing System for Real-time Monitoring of Enteric Emissions in Cattle with ex-vivo Validation", "categories": ["cs.RO", "q-bio.QM"], "comment": null, "summary": "Accurate measurement of enteric methane emissions remains a critical\nbottleneck for advancing livestock sustainability through genetic selection and\nprecision management. Existing ambient sampling approaches suffer from low data\nretention rates, environmental interference, and limited temporal resolution.\nWe developed SCOUT (Smart Cannula-mounted Optical Unit for Trace-methane), the\nfirst robust in-vivo sensing system enabling continuous, high-resolution\nmonitoring of ruminal methane concentrations through an innovative closed-loop\ngas recirculation design. We conducted comprehensive validation with two\ncannulated Simmental heifers under contrasting dietary treatments, with\ncross-platform comparison against established ambient sniffer systems. SCOUT\nachieved exceptional performance with 82% data retention compared to 17% for\nconventional sniffer systems, while capturing methane concentrations 100-1000x\nhigher than ambient approaches. Cross-platform validation demonstrated strong\nscale-dependent correlations, with optimal correlation strength (r = -0.564\n$\\pm$ 0.007) at biologically relevant 40-minute windows and 100% statistical\nsignificance. High-frequency monitoring revealed novel behavior-emission\ncoupling, including rapid concentration changes (14.5 $\\pm$ 11.3k ppm)\ntriggered by postural transitions within 15 minutes, insights previously\ninaccessible through existing technologies. The SCOUT system represents a\ntransformative advancement, enabling accurate, continuous emission phenotyping\nessential for genomic selection programs and sustainable precision livestock\nmanagement. This validation framework establishes new benchmarks for\nagricultural sensor performance while generating unprecedented biological\ninsights into ruminal methane dynamics, contributing essential tools for\nsustainable livestock production in climate-conscious agricultural systems."}
{"id": "2508.04368", "pdf": "https://arxiv.org/pdf/2508.04368", "abs": "https://arxiv.org/abs/2508.04368", "authors": ["Zahra Ebrahimi", "Raheleh Salehi", "Nassir Navab", "Carsten Marr", "Ario Sadafi"], "title": "Continual Multiple Instance Learning for Hematologic Disease Diagnosis", "categories": ["cs.LG", "cs.CV", "eess.IV", "q-bio.QM"], "comment": "Accepted for publication at MICCAI 2024 workshop on Efficient Medical\n  AI", "summary": "The dynamic environment of laboratories and clinics, with streams of data\narriving on a daily basis, requires regular updates of trained machine learning\nmodels for consistent performance. Continual learning is supposed to help train\nmodels without catastrophic forgetting. However, state-of-the-art methods are\nineffective for multiple instance learning (MIL), which is often used in\nsingle-cell-based hematologic disease diagnosis (e.g., leukemia detection).\nHere, we propose the first continual learning method tailored specifically to\nMIL. Our method is rehearsal-based over a selection of single instances from\nvarious bags. We use a combination of the instance attention score and distance\nfrom the bag mean and class mean vectors to carefully select which samples and\ninstances to store in exemplary sets from previous tasks, preserving the\ndiversity of the data. Using the real-world input of one month of data from a\nleukemia laboratory, we study the effectiveness of our approach in a class\nincremental scenario, comparing it to well-known continual learning methods. We\nshow that our method considerably outperforms state-of-the-art methods,\nproviding the first continual learning approach for MIL. This enables the\nadaptation of models to shifting data distributions over time, such as those\ncaused by changes in disease occurrence or underlying genetic alterations."}
{"id": "2508.04590", "pdf": "https://arxiv.org/pdf/2508.04590", "abs": "https://arxiv.org/abs/2508.04590", "authors": ["Mizuka Komatsu"], "title": "Algebraically Observable Physics-Informed Neural Network and its Application to Epidemiological Modelling", "categories": ["cs.SC", "cs.LG", "math.DS", "q-bio.QM"], "comment": null, "summary": "Physics-Informed Neural Network (PINN) is a deep learning framework that\nintegrates the governing equations underlying data into a loss function. In\nthis study, we consider the problem of estimating state variables and\nparameters in epidemiological models governed by ordinary differential\nequations using PINNs. In practice, not all trajectory data corresponding to\nthe population described by models can be measured. Learning PINNs to estimate\nthe unmeasured state variables and epidemiological parameters using partial\nmeasurements is challenging.\n  Accordingly, we introduce the concept of algebraic observability of the state\nvariables. Specifically, we propose augmenting the unmeasured data based on\nalgebraic observability analysis. The validity of the proposed method is\ndemonstrated through numerical experiments under three scenarios in the context\nof epidemiological modelling. Specifically, given noisy and partial\nmeasurements, the accuracy of unmeasured states and parameter estimation of the\nproposed method is shown to be higher than that of the conventional methods.\nThe proposed method is also shown to be effective in practical scenarios, such\nas when the data corresponding to certain variables cannot be reconstructed\nfrom the measurements."}
