{"id": "2509.19566", "pdf": "https://arxiv.org/pdf/2509.19566", "abs": "https://arxiv.org/abs/2509.19566", "authors": ["George Hong", "Daniel Trejo Banos"], "title": "Nano Bio-Agents (NBA): Small Language Model Agents for Genomics", "categories": ["cs.AI", "q-bio.GN"], "comment": null, "summary": "We investigate the application of Small Language Models (<10 billion\nparameters) for genomics question answering via agentic framework to address\nhallucination issues and computational cost challenges. The Nano Bio-Agent\n(NBA) framework we implemented incorporates task decomposition, tool\norchestration, and API access into well-established systems such as NCBI and\nAlphaGenome. Results show that SLMs combined with such agentic framework can\nachieve comparable and in many cases superior performance versus existing\napproaches utilising larger models, with our best model-agent combination\nachieving 98% accuracy on the GeneTuring benchmark. Notably, small 3-10B\nparameter models consistently achieve 85-97% accuracy while requiring much\nlower computational resources than conventional approaches. This demonstrates\npromising potential for efficiency gains, cost savings, and democratization of\nML-powered genomics tools while retaining highly robust and accurate\nperformance."}
{"id": "2509.19410", "pdf": "https://arxiv.org/pdf/2509.19410", "abs": "https://arxiv.org/abs/2509.19410", "authors": ["Chunhuan Zhang", "Sean Cottrell", "Benjamin Jones", "Yueying Zhu", "Huahai Qiu", "Bengong Zhang", "Tianshou Zhou", "Jian Jiang"], "title": "Meta-analysis and Topological Perturbation in Interactomic Network for Anti-opioid Addiction Drug Repurposing", "categories": ["q-bio.MN", "q-bio.QM"], "comment": null, "summary": "The ongoing opioid crisis highlights the urgent need for novel therapeutic\nstrategies that can be rapidly deployed. This study presents a novel approach\nto identify potential repurposable drugs for the treatment of opioid addiction,\naiming to bridge the gap between transcriptomic data analysis and drug\ndiscovery. Speciffcally, we perform a meta-analysis of seven transcriptomic\ndatasets related to opioid addiction by differential gene expression (DGE)\nanalysis, and propose a novel multiscale topological differentiation to\nidentify key genes from a protein-protein interaction (PPI) network derived\nfrom DEGs. This method uses persistent Laplacians to accurately single out\nimportant nodes within the PPI network through a multiscale manner to ensure\nhigh reliability. Subsequent functional validation by pathway enrichment and\nrigorous data curation yield 1,865 high-conffdence targets implicated in opioid\naddiction, which are cross-referenced with DrugBank to compile a repurposing\ncandidate list. To evaluate drug-target interactions, we construct predictive\nmodels utilizing two natural language processing-derived molecular embeddings\nand a conventional molecular ffngerprint. Based on these models, we prioritize\ncompounds with favorable binding afffnity proffles, and select candidates that\nare further assessed through molecular docking simulations to elucidate their\nreceptor-level interactions. Additionally, pharmacokinetic and toxicological\nevaluations are performed via ADMET (absorption, distribution, metabolism,\nexcretion, and toxicity) proffling, providing a multidimensional assessment of\ndruggability and safety. This study offers a generalizable approach for drug\nrepurposing in other complex diseases beyond opioid addiction. Keywords: Opioid\naddiction; Interactomic network; Topological perturbation; Differentially\nexpressed gene; Drug repurposin"}
{"id": "2509.19399", "pdf": "https://arxiv.org/pdf/2509.19399", "abs": "https://arxiv.org/abs/2509.19399", "authors": ["Mihaela Macarie-Ancau", "Adrian Groza"], "title": "Deep Clustering for Blood Cell Classification and Quantification", "categories": ["q-bio.QM"], "comment": null, "summary": "Accurate classification of blood cells plays a key role in improving\nautomated blood analysis for both medical and veterinary applications. This\nwork presents a two-stage deep clustering method for classifying blood cells\nfrom high-dimensional signal data. In the first stage, red blood cells (RBCs)\nand platelets (PLTs) are separated using a combination of an improved\nautoencoder and the IDEC algorithm. The second stage further classifies RBC\nsubtypes, pure RBCs, reticulocytes, and clumped RBCs, through a variational\ndeep embedding (VaDE) approach. Due to the lack of detailed cell-level labels,\nsoft classification probabilities are generated from sample-level data to\napproximate the true distributions. The aim is to contribute to the development\nof low-cost, automated blood analysis systems suitable for veterinary and\nbiomedical use. Initial results indicate this method shows promise in\neffectively distinguishing different blood cell populations, even with limited\nsupervision."}
{"id": "2509.19536", "pdf": "https://arxiv.org/pdf/2509.19536", "abs": "https://arxiv.org/abs/2509.19536", "authors": ["Saranya Varakunan", "Melissa Stadt", "Mohammad Kohandel"], "title": "Integrating Mechanistic Modeling and Machine Learning to Study CD4+/CD8+ CAR-T Cell Dynamics with Tumor Antigen Regulation", "categories": ["q-bio.QM", "q-bio.CB"], "comment": "26 pages, 8 figures", "summary": "Chimeric antigen receptor (CAR) T cell therapy has shown remarkable success\nin hematological malignancies, yet patient responses remain highly variable and\nthe roles of CD4 and CD8 subsets are not fully understood. We present an\nextended mathematical framework of CAR-T cell dynamics that explicitly models\nCD4 helper and CD8 cytotoxic lineages and their interactions with tumor antigen\nburden. Building on the Kirouac et al. (2023) model of antigen-regulated\nmemory, effector, and exhaustion transitions, our system of differential\nequations incorporates cytokine-mediated modulation of CD8 proliferation,\ncytotoxicity, and memory regeneration by CD4 T cells. Sensitivity analyses\nidentify effector proliferation burst size, antigen turnover, and CD8 expansion\nrates as dominant determinants of treatment outcome. Virtual patient\nsimulations reproduce clinical findings that a 1:1 CD4:CD8 ratio enhances CAR-T\nexpansion and tumor clearance relative to CD8-only products. Finally, we\nintegrate a feed-forward neural network trained on noisy virtual patient data\nto improve predictive robustness, and apply SHAP analysis to interpret the\nnetwork predictions and compare them with mechanistic sensitivity analyses.\nThis work highlights the synergistic roles of CD4 and CD8 CAR-T cells and\nprovides a quantitative foundation for optimizing treatments and patient\nstratification."}
{"id": "2509.19766", "pdf": "https://arxiv.org/pdf/2509.19766", "abs": "https://arxiv.org/abs/2509.19766", "authors": ["Naeyma N Islam", "Mathew A Coban", "Jessica M Fuller", "Caleb Weber", "Rohit Chitale", "Benjamin Jussila", "Trisha J. Brock", "Cui Tao", "Thomas R Caulfield"], "title": "Dynamicasome: a molecular dynamics-guided and AI-driven pathogenicity prediction catalogue for all genetic mutations", "categories": ["q-bio.QM", "cs.AI", "physics.bio-ph", "q-bio.MN"], "comment": "14 pages , 6 Figures, 2 Tables", "summary": "Advances in genomic medicine accelerate the identi cation of mutations in\ndisease-associated genes, but the pathogenicity of many mutations remains\nunknown, hindering their use in diagnostics and clinical decision-making.\nPredictive AI models are generated to combat this issue, but current tools\ndisplay low accuracy when tested against functionally validated datasets. We\nshow that integrating detailed conformational data extracted from molecular\ndynamics simulations (MDS) into advanced AI-based models increases their\npredictive power. We carry out an exhaustive mutational analysis of the disease\ngene PMM2 and subject structural models of each variant to MDS. AI models\ntrained on this dataset outperform existing tools when predicting the known\npathogenicity of mutations. Our best performing model, a neuronal networks\nmodel, also predicts the pathogenicity of several PMM2 mutations currently\nconsidered of unknown signi cance. We believe this model helps alleviate the\nburden of unknown variants in genomic medicine."}
{"id": "2509.19410", "pdf": "https://arxiv.org/pdf/2509.19410", "abs": "https://arxiv.org/abs/2509.19410", "authors": ["Chunhuan Zhang", "Sean Cottrell", "Benjamin Jones", "Yueying Zhu", "Huahai Qiu", "Bengong Zhang", "Tianshou Zhou", "Jian Jiang"], "title": "Meta-analysis and Topological Perturbation in Interactomic Network for Anti-opioid Addiction Drug Repurposing", "categories": ["q-bio.MN", "q-bio.QM"], "comment": null, "summary": "The ongoing opioid crisis highlights the urgent need for novel therapeutic\nstrategies that can be rapidly deployed. This study presents a novel approach\nto identify potential repurposable drugs for the treatment of opioid addiction,\naiming to bridge the gap between transcriptomic data analysis and drug\ndiscovery. Speciffcally, we perform a meta-analysis of seven transcriptomic\ndatasets related to opioid addiction by differential gene expression (DGE)\nanalysis, and propose a novel multiscale topological differentiation to\nidentify key genes from a protein-protein interaction (PPI) network derived\nfrom DEGs. This method uses persistent Laplacians to accurately single out\nimportant nodes within the PPI network through a multiscale manner to ensure\nhigh reliability. Subsequent functional validation by pathway enrichment and\nrigorous data curation yield 1,865 high-conffdence targets implicated in opioid\naddiction, which are cross-referenced with DrugBank to compile a repurposing\ncandidate list. To evaluate drug-target interactions, we construct predictive\nmodels utilizing two natural language processing-derived molecular embeddings\nand a conventional molecular ffngerprint. Based on these models, we prioritize\ncompounds with favorable binding afffnity proffles, and select candidates that\nare further assessed through molecular docking simulations to elucidate their\nreceptor-level interactions. Additionally, pharmacokinetic and toxicological\nevaluations are performed via ADMET (absorption, distribution, metabolism,\nexcretion, and toxicity) proffling, providing a multidimensional assessment of\ndruggability and safety. This study offers a generalizable approach for drug\nrepurposing in other complex diseases beyond opioid addiction. Keywords: Opioid\naddiction; Interactomic network; Topological perturbation; Differentially\nexpressed gene; Drug repurposin"}
{"id": "2509.19988", "pdf": "https://arxiv.org/pdf/2509.19988", "abs": "https://arxiv.org/abs/2509.19988", "authors": ["Yanke Li", "Tianyu Cui", "Tommaso Mansi", "Mangal Prakash", "Rui Liao"], "title": "BioBO: Biology-informed Bayesian Optimization for Perturbation Design", "categories": ["stat.ML", "cs.LG", "q-bio.QM"], "comment": "NeurIPS: Structured Probabilistic Inference & Generative Modeling,\n  2025", "summary": "Efficient design of genomic perturbation experiments is crucial for\naccelerating drug discovery and therapeutic target identification, yet\nexhaustive perturbation of the human genome remains infeasible due to the vast\nsearch space of potential genetic interactions and experimental constraints.\nBayesian optimization (BO) has emerged as a powerful framework for selecting\ninformative interventions, but existing approaches often fail to exploit\ndomain-specific biological prior knowledge. We propose Biology-Informed\nBayesian Optimization (BioBO), a method that integrates Bayesian optimization\nwith multimodal gene embeddings and enrichment analysis, a widely used tool for\ngene prioritization in biology, to enhance surrogate modeling and acquisition\nstrategies. BioBO combines biologically grounded priors with acquisition\nfunctions in a principled framework, which biases the search toward promising\ngenes while maintaining the ability to explore uncertain regions. Through\nexperiments on established public benchmarks and datasets, we demonstrate that\nBioBO improves labeling efficiency by 25-40%, and consistently outperforms\nconventional BO by identifying top-performing perturbations more effectively.\nMoreover, by incorporating enrichment analysis, BioBO yields pathway-level\nexplanations for selected perturbations, offering mechanistic interpretability\nthat links designs to biologically coherent regulatory circuits."}
{"id": "2509.20013", "pdf": "https://arxiv.org/pdf/2509.20013", "abs": "https://arxiv.org/abs/2509.20013", "authors": ["Nicholas Steyn", "Freddie Bickford Smith", "Cathal Mills", "Vik Shirvaikar", "Christl A Donnelly", "Kris V Parag"], "title": "A decision-theoretic framework for uncertainty quantification in epidemiological modelling", "categories": ["stat.ME", "q-bio.QM"], "comment": "16 pages, 6 figures", "summary": "Estimating, understanding, and communicating uncertainty is fundamental to\nstatistical epidemiology, where model-based estimates regularly inform\nreal-world decisions. However, sources of uncertainty are rarely formalised,\nand existing classifications are often defined inconsistently. This lack of\nstructure hampers interpretation, model comparison, and targeted data\ncollection. Connecting ideas from machine learning, information theory,\nexperimental design, and health economics, we present a first-principles\ndecision-theoretic framework that defines uncertainty as the expected loss\nincurred by making an estimate based on incomplete information, arguing that\nthis is a highly useful and practically relevant definition for epidemiology.\nWe show how reasoning about future data leads to a notion of expected\nuncertainty reduction, which induces formal definitions of reducible and\nirreducible uncertainty. We demonstrate our approach using a case study of\nSARS-CoV-2 wastewater surveillance in Aotearoa New Zealand, estimating the\nuncertainty reduction if wastewater surveillance were expanded to the full\npopulation. We then connect our framework to relevant literature from adjacent\nfields, showing how it unifies and extends many of these ideas and how it\nallows these ideas to be applied to a wider range of models. Altogether, our\nframework provides a foundation for more reliable, consistent, and\npolicy-relevant uncertainty quantification in infectious disease epidemiology."}
{"id": "2509.20279", "pdf": "https://arxiv.org/pdf/2509.20279", "abs": "https://arxiv.org/abs/2509.20279", "authors": ["Songhao Li", "Jonathan Xu", "Tiancheng Bao", "Yuxuan Liu", "Yuchen Liu", "Yihang Liu", "Lilin Wang", "Wenhui Lei", "Sheng Wang", "Yinuo Xu", "Yan Cui", "Jialu Yao", "Shunsuke Koga", "Zhi Huang"], "title": "A co-evolving agentic AI system for medical imaging analysis", "categories": ["cs.CV", "q-bio.QM"], "comment": null, "summary": "Agentic AI is rapidly advancing in healthcare and biomedical research.\nHowever, in medical image analysis, their performance and adoption remain\nlimited due to the lack of a robust ecosystem, insufficient toolsets, and the\nabsence of real-time interactive expert feedback. Here we present \"TissueLab\",\na co-evolving agentic AI system that allows researchers to ask direct\nquestions, automatically plan and generate explainable workflows, and conduct\nreal-time analyses where experts can visualize intermediate results and refine\nthem. TissueLab integrates tool factories across pathology, radiology, and\nspatial omics domains. By standardizing inputs, outputs, and capabilities of\ndiverse tools, the system determines when and how to invoke them to address\nresearch and clinical questions. Across diverse tasks with clinically\nmeaningful quantifications that inform staging, prognosis, and treatment\nplanning, TissueLab achieves state-of-the-art performance compared with\nend-to-end vision-language models (VLMs) and other agentic AI systems such as\nGPT-5. Moreover, TissueLab continuously learns from clinicians, evolving toward\nimproved classifiers and more effective decision strategies. With active\nlearning, it delivers accurate results in unseen disease contexts within\nminutes, without requiring massive datasets or prolonged retraining. Released\nas a sustainable open-source ecosystem, TissueLab aims to accelerate\ncomputational research and translational adoption in medical imaging while\nestablishing a foundation for the next generation of medical AI."}
{"id": "2509.20290", "pdf": "https://arxiv.org/pdf/2509.20290", "abs": "https://arxiv.org/abs/2509.20290", "authors": ["Dayu Tan", "Jing Chen", "Xiaoping Zhou", "Yansen Su", "Chunhou Zheng"], "title": "PGCLODA: Prompt-Guided Graph Contrastive Learning for Oligopeptide-Infectious Disease Association Prediction", "categories": ["cs.LG", "cs.AI", "q-bio.QM"], "comment": "12page and 8 figures", "summary": "Infectious diseases continue to pose a serious threat to public health,\nunderscoring the urgent need for effective computational approaches to screen\nnovel anti-infective agents. Oligopeptides have emerged as promising candidates\nin antimicrobial research due to their structural simplicity, high\nbioavailability, and low susceptibility to resistance. Despite their potential,\ncomputational models specifically designed to predict associations between\noligopeptides and infectious diseases remain scarce. This study introduces a\nprompt-guided graph-based contrastive learning framework (PGCLODA) to uncover\npotential associations. A tripartite graph is constructed with oligopeptides,\nmicrobes, and diseases as nodes, incorporating both structural and semantic\ninformation. To preserve critical regions during contrastive learning, a\nprompt-guided graph augmentation strategy is employed to generate meaningful\npaired views. A dual encoder architecture, integrating Graph Convolutional\nNetwork (GCN) and Transformer, is used to jointly capture local and global\nfeatures. The fused embeddings are subsequently input into a multilayer\nperceptron (MLP) classifier for final prediction. Experimental results on a\nbenchmark dataset indicate that PGCLODA consistently outperforms\nstate-of-the-art models in AUROC, AUPRC, and accuracy. Ablation and\nhyperparameter studies confirm the contribution of each module. Case studies\nfurther validate the generalization ability of PGCLODA and its potential to\nuncover novel, biologically relevant associations. These findings offer\nvaluable insights for mechanism-driven discovery and oligopeptide-based drug\ndevelopment. The source code of PGCLODA is available online at\nhttps://github.com/jjnlcode/PGCLODA."}
