{"id": "2508.10058", "pdf": "https://arxiv.org/pdf/2508.10058", "abs": "https://arxiv.org/abs/2508.10058", "authors": ["Kimberly Ayers", "Maxwell Kooiker"], "title": "A Structural Analysis of Population Graphs", "categories": ["q-bio.QM", "05C90"], "comment": null, "summary": "The format of graphing algorithms for genomic data has been a debate in\nrecent biotechnology. In this paper, we discuss the construction of population\ngraphs using said genomic data. We first examine the GENPOFAD distance\nmeasurement, developed by Joly et. al., and prove that this constitutes a\nmetric function. We develop an algorithm to construct graphs to visualize the\nrelationships between individuals in a population. We then provide a\nstatistical analysis of these simulated population graphs, and show that they\nare distinct from randomly generated graphs, and also show differences from\nsmall-world graphs."}
{"id": "2508.10082", "pdf": "https://arxiv.org/pdf/2508.10082", "abs": "https://arxiv.org/abs/2508.10082", "authors": ["Yousra Hassan Alsaad Almeshale", "Abdulelah Hassan Almeshali", "Omar Alsaddique", "Noura Jandali", "Nadeen Garaween", "Bin Hu"], "title": "Developing an Inhaled NEU1 Inhibitor for Cystic Fibrosis via Pharmacokinetic and Biophysical Modeling", "categories": ["q-bio.QM"], "comment": "4 figures, 5 tables", "summary": "Background: Cystic fibrosis (CF) airway mucus exhibits reduced mucin\nsialylation, increasing viscosity and impairing mucociliary clearance (MCC).\nNEU1 inhibition has been proposed to restore MCC, but its quantitative\npharmacokinetic and rheological effects, particularly with inhaled delivery,\nremain uncharacterized.\n  Objective: To develop an integrated pharmacokinetic/pharmacodynamic (PK/PD)\nand biophysical model to assess the efficacy of an inhaled NEU1 inhibitor.\n  Methods: Empirical and preclinical NEU1 inhibition data were combined with\ninhalation PK/PD modeling and a biophysical viscosity framework linking mucin\nsialylation and extracellular DNA. Synthetic cohort simulations (N = 200) were\nreconciled with empirical PK benchmarks using Latin hypercube parameter\nsampling. Cross-validation, hold-out testing, and causal inference methods\n(inverse probability of treatment weighting and targeted maximum likelihood\nestimation) quantified predicted effects on lung function (delta FEV1).\n  Results: With reconciled parameters (F_dep = 0.12; k_abs = 0.21 per hour;\nk_muc = 0.24 per hour), epithelial lining fluid drug levels reached a peak\nconcentration of 7.5 micromolar (95 percent CI: 6 to 10 micromolar), achieving\nIC50 coverage for approximately 10 hours per day and greater than 80 percent\nmodeled NEU1 inhibition. Predicted mucus viscosity reduction averaged 25 to 28\npercent. Causal inference estimated delta FEV1 improvement of +0.13 liters (95\npercent CI: 0.10 to 0.15 liters), with about 70 percent mediated via MCC.\n  Conclusions: Empirically anchored PK/PD and biophysical modeling support the\nfeasibility of inhaled NEU1 inhibition as a rheology-targeting strategy in CF,\nprojecting clinically realistic efficacy while maintaining pharmacological\nviability. This calibrated proof of concept warrants in vivo validation in CF\nmodels."}
{"id": "2508.10178", "pdf": "https://arxiv.org/pdf/2508.10178", "abs": "https://arxiv.org/abs/2508.10178", "authors": ["Jozef Skakala"], "title": "Estimating carbon pools in the shelf sea environment: reanalysis or model-informed machine learning?", "categories": ["q-bio.QM", "cs.LG"], "comment": "24 pages, 9 figures (4 in the appendix)", "summary": "Shelf seas are important for carbon sequestration and carbon cycle, but\navailable in situ, or satellite data for carbon pools in the shelf sea\nenvironment are often sparse, or highly uncertain. Alternative can be provided\nby reanalyses, but these are often expensive to run. We propose to use an\nensemble of neural networks (NN) to learn from a coupled\nphysics-biogeochemistry model the relationship between the directly observable\nvariables and carbon pools. We demonstrate for North-West European Shelf (NWES)\nsea environment, that when the NN trained on a model free run simulation is\napplied to the NWES reanalysis, it is capable to reproduce the reanalysis\noutputs for carbon pools. Moreover, unlike the existing NWES reanalysis, the NN\nensemble is also capable to provide uncertainty information for the pools. We\nfocus on explainability of the results and demonstrate potential use of the NNs\nfor future climate what-if scenarios. We suggest that model-informed machine\nlearning presents a viable alternative to expensive reanalyses and could\ncomplement observational data, wherever they are missing and/or highly\nuncertain."}
{"id": "2508.10343", "pdf": "https://arxiv.org/pdf/2508.10343", "abs": "https://arxiv.org/abs/2508.10343", "authors": ["Daniel Semchin", "Emile d'Angremont", "Marco Lorenzi", "Boris Gutman"], "title": "Scalable Modeling of Nonlinear Network Dynamics in Neurodegenerative Disease", "categories": ["q-bio.QM", "q-bio.NC"], "comment": null, "summary": "Mechanistic models of progressive neurodegeneration offer great potential\nutility for clinical use and novel treatment development. Toward this end,\nseveral connectome-informed models of neuroimaging biomarkers have been\nproposed. However, these models typically do not scale well beyond a small\nnumber of biomarkers due to heterogeneity in individual disease trajectories\nand a large number of parameters. To address this, we introduce the\nConnectome-based Monotonic Inference of Neurodegenerative Dynamics (COMIND).\nThe model combines concepts from diffusion and logistic models with structural\nbrain connectivity. This guarantees monotonic disease trajectories while\nmaintaining a limited number of parameters to improve scalability. We evaluate\nour model on simulated data as well as on the Parkinson's Progressive Markers\nInitiative (PPMI) data. Our model generalizes to anatomical imaging\nrepresentations from a standard brain atlas without the need to reduce\nbiomarker number."}
{"id": "2508.10117", "pdf": "https://arxiv.org/pdf/2508.10117", "abs": "https://arxiv.org/abs/2508.10117", "authors": ["Nguyen Manh Son", "Pham Huu Vang", "Nguyen Thi Dung", "Nguyen Manh Ha. Ta Thi Thao", "Tran Thi Thu Thuy", "Phan Minh Giang"], "title": "In silico study on the cytotoxicity against Hela cancer cells of xanthones bioactive compounds from Garcinia cowa: QSAR based on Graph Deep Learning, Network Pharmacology, and Molecular Docking", "categories": ["q-bio.MN", "cs.LG"], "comment": null, "summary": "Cancer is recognized as a complex group of diseases, contributing to the\nhighest global mortality rates, with increasing prevalence and a trend toward\naffecting younger populations. It is characterized by uncontrolled\nproliferation of abnormal cells, invasion of adjacent tissues, and metastasis\nto distant organs. Garcinia cowa, a traditional medicinal plant widely used in\nSoutheast Asia, including Vietnam, is employed to treat fever, cough,\nindigestion, as a laxative, and for parasitic diseases. Numerous xanthone\ncompounds isolated from this species exhibit a broad spectrum of biological\nactivities, with some showing promise as anti cancer and antimalarial agents.\nNetwork pharmacology analysis successfully identified key bioactive compounds\nRubraxanthone, Garcinone D, Norcowanin, Cowanol, and Cowaxanthone alongside\ntheir primary protein targets (TNF, CTNNB1, SRC, NFKB1, and MTOR), providing\ncritical insights into the molecular mechanisms underlying their anti-cancer\neffects. The Graph Attention Network algorithm demonstrated superior predictive\nperformance, achieving an R2 of 0.98 and an RMSE of 0.02 after data\naugmentation, highlighting its accuracy in predicting pIC50 values for xanthone\nbased compounds. Additionally, molecular docking revealed MTOR as a potential\ntarget for inducing cytotoxicity in HeLa cancer cells from Garcinia cowa."}
{"id": "2508.10821", "pdf": "https://arxiv.org/pdf/2508.10821", "abs": "https://arxiv.org/abs/2508.10821", "authors": ["Jacob Egebjerg", "Daniel Wüstner"], "title": "SimAQ: Mitigating Experimental Artifacts in Soft X-Ray Tomography using Simulated Acquisitions", "categories": ["q-bio.QM"], "comment": null, "summary": "Soft X-ray tomography (SXT) provides detailed structural insight into whole\ncells but is hindered by experimental artifacts such as the missing wedge and\nby limited availability of annotated datasets. We present \\method, a simulation\npipeline that generates realistic cellular phantoms and applies synthetic\nartifacts to produce paired noisy volumes, sinograms, and reconstructions. We\nvalidate our approach by training a neural network primarily on synthetic data\nand demonstrate effective few-shot and zero-shot transfer learning on real SXT\ntomograms. Our model delivers accurate segmentations, enabling quantitative\nanalysis of noisy tomograms without relying on large labeled datasets or\ncomplex reconstruction methods."}
{"id": "2508.10262", "pdf": "https://arxiv.org/pdf/2508.10262", "abs": "https://arxiv.org/abs/2508.10262", "authors": ["Shanzhuo Zhang", "Xianbin Ye", "Donglong He", "Yueyang Huang", "Xiaonan Zhang", "Xiaomin Fang"], "title": "HelixVS: Deep Learning Enhanced Structure-based Virtual Screening Platform for Hit Discovery", "categories": ["q-bio.BM", "q-bio.QM"], "comment": null, "summary": "Drug discovery through virtual screening (VS) has become a popular strategy\nfor identifying hits against protein targets. VS has the potential to reduce\nthe cost and time needed for manual selection and wet-laboratory experiments.\nImproving the cost-effectiveness of virtual screening is a significant\nchallenge, aiming to explore larger compound libraries while maintaining lower\nscreening costs. Here, we present HelixVS, a structure-based VS platform\nenhanced by deep learning models. HelixVS integrates a precise deep\nlearning-based pose-scoring model and a pose-screening module into a\nmulti-stage VS process, enabling more effective screening of active compounds.\nCompared to classic molecular docking tools like Vina, HelixVS demonstrated\nsignificantly improved screening performance across nearly a hundred targets,\nachieving an average 2.6-fold higher enrichment factor (EF) and more than 10\ntimes faster screening speed. We applied HelixVS in four drug development\npipelines, targeting both traditional competitive drug-binding pockets and\nnovel protein-protein interaction interfaces. Wet-lab validations across these\npipelines consistently identified active compounds, with over 10% of the\nmolecules tested in wet labs demonstrating activity at uM or even nM levels.\nThis demonstrates the ability of HelixVS to identify high-affinity ligands for\nvarious targets and pockets. Furthermore, we provide a publicly available and\nfree version of HelixVS with limited computing power to assist drug development\nscientists in accelerating their drug discovery processes."}
