{"id": "2510.05383", "pdf": "https://arxiv.org/pdf/2510.05383", "abs": "https://arxiv.org/abs/2510.05383", "authors": ["David F. Anderson", "Jingyi Ma", "Praful Gagrani"], "title": "Mathematical Analysis for a Class of Stochastic Copolymerization Processes", "categories": ["math.PR", "math-ph", "math.MP", "q-bio.MN", "q-bio.QM", "60J27, 92C40, 60J20, 82C99"], "comment": "38 pages", "summary": "We study a stochastic model of a copolymerization process that has been\nextensively investigated in the physics literature. The main questions of\ninterest include: (i) what are the criteria for transience, null recurrence,\nand positive recurrence in terms of the system parameters; (ii) in the\ntransient regime, what are the limiting fractions of the different monomer\ntypes; and (iii) in the transient regime, what is the speed of growth of the\npolymer? Previous studies in the physics literature have addressed these\nquestions using heuristic methods. Here, we utilize rigorous mathematical\narguments to derive the results from the physics literature. Moreover, the\ntechniques developed allow us to generalize to the copolymerization process\nwith finitely many monomer types. We expect that the mathematical methods used\nand developed in this work will also enable the study of even more complex\nmodels in the future."}
{"id": "2510.05161", "pdf": "https://arxiv.org/pdf/2510.05161", "abs": "https://arxiv.org/abs/2510.05161", "authors": ["Xiaoxin Wang", "Kai Kang", "Leyi Zhang", "Changjing Zhuge"], "title": "Heterogeneous immune recovery after viral response through a dynamical model of feedback-driven persistence and clearance", "categories": ["q-bio.QM"], "comment": null, "summary": "Viral infections trigger complex immune responses with heterogeneous outcomes\nshaped by nonlinear feedbacks. An ordinary differential equation model is\ndeveloped to investigate immune response dynamics during viral infection,\nincorporating six modules: viral load, innate immunity, cellular immunity,\nhumoral immunity, immune suppression, and IL-6 levels. Bifurcation analysis\nreveals that under continuous viral exposure, when viral clearance rate and\nintrinsic viral death rate satisfy specific conditions, the system exhibits up\nto five stable equilibria. This indicates that different health and disease\nstates may coexist depending on initial conditions, while severe inflammation\nmainly arises from strong activation of cellular immunity, highlighting the\ncomplexity of immune responses. Simulations of finite-time viral exposure\ndemonstrate multi-timescale recovery characteristics: viral load and IL-6\nlevels decline rapidly, whereas humoral immune activation and immunosuppression\nshow delayed and sustained patterns. Furthermore, analysis of infectious period\nand disease duration also indicates that during transition from early acute\nresponse to chronic disease, viral replication rate plays a critical role,\nwhile immune response intensity is sensitive to both viral clearance and immune\nself-activation. Subsystem analysis identifies the three-component subsystem of\nviral load, innate immunity, and cellular immunity as core drivers of\nbistability and oscillations, while humoral immunity, immune suppression, and\nIL-6 primarily modulate response amplitude and timing. This work establishes a\ntheoretical framework for analyzing immune response and chronic risks through\nfeedback dynamical modelling, providing insights for intervention strategies."}
{"id": "2510.05183", "pdf": "https://arxiv.org/pdf/2510.05183", "abs": "https://arxiv.org/abs/2510.05183", "authors": ["Jiacheng Wu"], "title": "Aneurysm Growth Time Series Reconstruction Using Physics-informed Autoencoder", "categories": ["q-bio.QM", "cs.LG", "stat.AP", "stat.ML"], "comment": "21 pages, 13 figures", "summary": "Arterial aneurysm (Fig.1) is a bulb-shape local expansion of human arteries,\nthe rupture of which is a leading cause of morbidity and mortality in US.\nTherefore, the prediction of arterial aneurysm rupture is of great significance\nfor aneurysm management and treatment selection. The prediction of aneurysm\nrupture depends on the analysis of the time series of aneurysm growth history.\nHowever, due to the long time scale of aneurysm growth, the time series of\naneurysm growth is not always accessible. We here proposed a method to\nreconstruct the aneurysm growth time series directly from patient parameters.\nThe prediction is based on data pairs of [patient parameters, patient aneurysm\ngrowth time history]. To obtain the mapping from patient parameters to patient\naneurysm growth time history, we first apply autoencoder to obtain a compact\nrepresentation of the time series for each patient. Then a mapping is learned\nfrom patient parameters to the corresponding compact representation of time\nseries via a five-layer neural network. Moving average and convolutional output\nlayer are implemented to explicitly taking account the time dependency of the\ntime series.\n  Apart from that, we also propose to use prior knowledge about the mechanism\nof aneurysm growth to improve the time series reconstruction results. The prior\nphysics-based knowledge is incorporated as constraints for the optimization\nproblem associated with autoencoder. The model can handle both algebraic and\ndifferential constraints. Our results show that including physical model\ninformation about the data will not significantly improve the time series\nreconstruction results if the training data is error-free. However, in the case\nof training data with noise and bias error, incorporating physical model\nconstraints can significantly improve the predicted time series."}
{"id": "2510.05193", "pdf": "https://arxiv.org/pdf/2510.05193", "abs": "https://arxiv.org/abs/2510.05193", "authors": ["Oliver E. Jensen", "Christopher K. Revell"], "title": "Harmonic fields and the mechanical response of a cellular monolayer to ablation", "categories": ["q-bio.QM"], "comment": null, "summary": "Multicellular tissues, such as the epithelium coating a developing embryo,\noften combine complex tissue shapes with heterogeneity in the spatial\narrangement of individual cells. Discrete approximations, such as the cell\nvertex model, can accommodate these geometric features, but techniques for\nanalysis of such models are underdeveloped. Here, we express differential\noperators defined on a network representing a monolayer of confluent cells in\nthe framework of discrete exterior calculus, considering scalar fields defined\nover cell vertices and centres and vector fields defined over cell edges. We\nachieve this by defining Hodge stars, wedge products and musical isomorphisms\nthat are appropriate for a disordered monolayer for which cell edges and links\nbetween cell centres are not orthogonal, as is generic for epithelia. We use\nthis framework to evaluate the harmonic vector field arising in an ablated\nmonolayer, demonstrating an approximate 1/\\textit{r} scaling of the upper bound\nof the field's amplitude, where \\textit{r} is the distance from the ablation.\nUsing a vertex model that incorporates osmotic effects, we then calculate the\nmechanical response of a monolayer in a jammed state to ablation. Perturbation\ndisplacements exhibit long-range coherence, monopolar and quadrupolar features,\nand an approximate 1/\\textit{r} near-hole upper-bound scaling, implicating the\nharmonic field. The upper bounds on perturbation stress amplitudes scale\napproximately like 1/\\textit{r}$^2$, a feature relevant to long-range\nmechanical signalling."}
{"id": "2510.05194", "pdf": "https://arxiv.org/pdf/2510.05194", "abs": "https://arxiv.org/abs/2510.05194", "authors": ["Anni Tziakouri", "Filippo Menolascina"], "title": "Reinforcement Learning for Clinical Reasoning: Aligning LLMs with ACR Imaging Appropriateness Criteria", "categories": ["q-bio.QM"], "comment": null, "summary": "Medical imaging has revolutionized diagnosis, yet unnecessary procedures are\nrising, exposing patients to radiation and stress, limiting equitable access,\nand straining healthcare systems. The American College of Radiology\nAppropriateness Criteria, developed through extensive multidisciplinary review,\nprovide evidence-based guidance but remain underutilized. Leveraging advances\nin LLM reasoning, we introduce a Reasoning Agent trained with Reinforcement\nLearning (RL), specifically Group Relative Policy Optimization (GRPO), to\nreplicate expert clinical reasoning from the ACR Criteria. We present a novel\nRL approach for structured medical reasoning, systematically comparing\nreasoning-focused reward functions and evidence integration strategies. Our\nlightweight 8B model, MedReason-Embed, improves macro F1 by 18% over baseline,\nshows stronger reasoning alignment, and outperforms both larger and\nalternatively trained models, showing that reasoning-based supervision enables\nefficient, trustworthy clinical AI. Building on this, we design a modular\nend-to-end agentic architecture that automates imaging referrals: mapping\ndiagnoses to ICD codes, retrieving PubMed evidence, and recommending optimal\nprocedures. Crucially, the ability to generalize beyond static ACR guidelines\nnot only enables clinicians to handle out-of-distribution cases, but also\nsupports scaling the guideline development process itself, potentially reducing\nthe significant effort required to create and update them. This work shows the\npotential of reasoning-focused RL within agentic architectures to deliver\ntransparent, scalable, and reliable clinical decision support. Our code is\navailable at:\nhttps://anonymous.4open.science/r/agentic-imaging-recommender-iclr-877D"}
{"id": "2510.05355", "pdf": "https://arxiv.org/pdf/2510.05355", "abs": "https://arxiv.org/abs/2510.05355", "authors": ["Saud Lingawi", "Garrett Frank", "Benedictus H. Kartawidjaja", "Mahsa Khalili", "Brian Kwon", "Calvin Kuo"], "title": "Reducing Latency and Noise in PPG-Based SpO2 Measurements: A Kalman Filtering Approach Towards Acute Hypoxia Detection", "categories": ["q-bio.QM"], "comment": "16 pages including references, 5 figures, intended for a journal\n  submission", "summary": "Photoplethysmography (PPG) is a common tool for monitoring cardiopulmonary\nhealth. Relying on absorption or reflectance of light by hemoglobin in the\nblood, the measured PPG waveform can be analyzed per heart beat using\nphysiological assumptions to extract metrics ranging from heart rate to\nspecific blood oxygenation (SpO2). This has led to the widespread use of PPG\nfor bedside clinical monitoring to wearable consumer health monitoring.\nHowever, PPG is notoriously noisy and the measured absorption or reflectance of\nlight is sensitive to factors such as body movement and contact with the skin.\nTo reduce the noise in the PPG-derived SpO2, we developed combined traditional\nmethods of estimating SpO2 from the PPG waveform with a new method to extract\nchanges in SpO2 from the PPG waveform in a Kalman filter, and demonstrated its\nability to better estimate SpO2 in humans undergoing controlled hypoxia (down\nto 14% atmospheric oxygen). The Kalman filter reduced variability in SpO2 to\n4.30%SpO2 compared to the beat-to-beat SpO2 variability of 12.59%SpO2. This\nmirrored current methods of window-averaging the beat-to-beat SpO2, with a 30s\nwindow-average reducing SpO2 variability to 4.73%. However, current\nwindow-average methods also introduce delays, with 10s and 30s window-averaging\nintroducing delays of 5s and 14s respectively compared to the beat-to-beat\nSpO2. The Kalman filter reduced this delay to within 3s of the beat-to-beat\nSpO2, highlighting its ability to reduce noise while maintaining SpO2 dynamics.\nThis capability is particularly useful in reliably detecting clinically\nmeaningful, but transient, hypoxic states, such as those observed during apnea."}
{"id": "2510.05383", "pdf": "https://arxiv.org/pdf/2510.05383", "abs": "https://arxiv.org/abs/2510.05383", "authors": ["David F. Anderson", "Jingyi Ma", "Praful Gagrani"], "title": "Mathematical Analysis for a Class of Stochastic Copolymerization Processes", "categories": ["math.PR", "math-ph", "math.MP", "q-bio.MN", "q-bio.QM", "60J27, 92C40, 60J20, 82C99"], "comment": "38 pages", "summary": "We study a stochastic model of a copolymerization process that has been\nextensively investigated in the physics literature. The main questions of\ninterest include: (i) what are the criteria for transience, null recurrence,\nand positive recurrence in terms of the system parameters; (ii) in the\ntransient regime, what are the limiting fractions of the different monomer\ntypes; and (iii) in the transient regime, what is the speed of growth of the\npolymer? Previous studies in the physics literature have addressed these\nquestions using heuristic methods. Here, we utilize rigorous mathematical\narguments to derive the results from the physics literature. Moreover, the\ntechniques developed allow us to generalize to the copolymerization process\nwith finitely many monomer types. We expect that the mathematical methods used\nand developed in this work will also enable the study of even more complex\nmodels in the future."}
{"id": "2510.05433", "pdf": "https://arxiv.org/pdf/2510.05433", "abs": "https://arxiv.org/abs/2510.05433", "authors": ["Nazanin Ahmadi", "Qianying Cao", "Jay D. Humphrey", "George Em Karniadakis"], "title": "Physics-Informed Machine Learning in Biomedical Science and Engineering", "categories": ["cs.LG", "cs.AI", "q-bio.QM"], "comment": "Accepted for publication in the Annual Review of Biomedical\n  Engineering on October 2, 2025", "summary": "Physics-informed machine learning (PIML) is emerging as a potentially\ntransformative paradigm for modeling complex biomedical systems by integrating\nparameterized physical laws with data-driven methods. Here, we review three\nmain classes of PIML frameworks: physics-informed neural networks (PINNs),\nneural ordinary differential equations (NODEs), and neural operators (NOs),\nhighlighting their growing role in biomedical science and engineering. We begin\nwith PINNs, which embed governing equations into deep learning models and have\nbeen successfully applied to biosolid and biofluid mechanics, mechanobiology,\nand medical imaging among other areas. We then review NODEs, which offer\ncontinuous-time modeling, especially suited to dynamic physiological systems,\npharmacokinetics, and cell signaling. Finally, we discuss deep NOs as powerful\ntools for learning mappings between function spaces, enabling efficient\nsimulations across multiscale and spatially heterogeneous biological domains.\nThroughout, we emphasize applications where physical interpretability, data\nscarcity, or system complexity make conventional black-box learning\ninsufficient. We conclude by identifying open challenges and future directions\nfor advancing PIML in biomedical science and engineering, including issues of\nuncertainty quantification, generalization, and integration of PIML and large\nlanguage models."}
{"id": "2510.05886", "pdf": "https://arxiv.org/pdf/2510.05886", "abs": "https://arxiv.org/abs/2510.05886", "authors": ["Johannes Seiffarth", "Keitaro Kasahara", "Michelle Bund", "Benita Lückel", "Richard D. Paul", "Mathias Pesch", "Lennart Witting", "Michael Bott", "Dietrich Kohlheyer", "Katharina Nöh"], "title": "acia-workflows: Automated Single-cell Imaging Analysis for Scalable and Deep Learning-based Live-cell Imaging Analysis Workflows", "categories": ["cs.CV", "q-bio.QM"], "comment": null, "summary": "Live-cell imaging (LCI) technology enables the detailed spatio-temporal\ncharacterization of living cells at the single-cell level, which is critical\nfor advancing research in the life sciences, from biomedical applications to\nbioprocessing. High-throughput setups with tens to hundreds of parallel cell\ncultivations offer the potential for robust and reproducible insights. However,\nthese insights are obscured by the large amount of LCI data recorded per\nexperiment. Recent advances in state-of-the-art deep learning methods for cell\nsegmentation and tracking now enable the automated analysis of such large data\nvolumes, offering unprecedented opportunities to systematically study\nsingle-cell dynamics. The next key challenge lies in integrating these powerful\ntools into accessible, flexible, and user-friendly workflows that support\nroutine application in biological research. In this work, we present\nacia-workflows, a platform that combines three key components: (1) the\nAutomated live-Cell Imaging Analysis (acia) Python library, which supports the\nmodular design of image analysis pipelines offering eight deep learning\nsegmentation and tracking approaches; (2) workflows that assemble the image\nanalysis pipeline, its software dependencies, documentation, and visualizations\ninto a single Jupyter Notebook, leading to accessible, reproducible and\nscalable analysis workflows; and (3) a collection of application workflows\nshowcasing the analysis and customization capabilities in real-world\napplications. Specifically, we present three workflows to investigate various\ntypes of microfluidic LCI experiments ranging from growth rate comparisons to\nprecise, minute-resolution quantitative analyses of individual dynamic cells\nresponses to changing oxygen conditions. Our collection of more than ten\napplication workflows is open source and publicly available at\nhttps://github.com/JuBiotech/acia-workflows."}
