{"id": "2509.21594", "pdf": "https://arxiv.org/pdf/2509.21594", "abs": "https://arxiv.org/abs/2509.21594", "authors": ["Weitai Qian", "Rishad Raiyan Joarder", "Randall Fowler", "Begum Kasap", "Mahya Saffarpour", "Kourosh Vali", "Tailai Lihe", "Aijun Wang", "Diana Farmer", "Soheil Ghiasi"], "title": "Transabdominal Fetal Oximetry via Diffuse Optics: Principled Analysis and Demonstration in Pregnant Ovine Models", "categories": ["eess.IV", "eess.SP", "q-bio.QM"], "comment": "18 pages, 14 figures", "summary": "Diffuse optics has the potential to offer a substantial advancement in fetal\nhealth monitoring via enabling continuous measurement of fetal blood oxygen\nsaturation (fSpO$_2$). Aiming to enhance the sensing accuracy and to elucidate\nthe foundational limits of Transabdominal Fetal Oximetry (TFO) via diffuse\noptics, we introduce a theoretical derivation, and a comprehensive pipeline for\nfSpO$_2$ estimation from non-invasively sensed diffuse light intensity values,\nwhich are leveraged to analyze datasets obtained through both simulations and\nin-vivo experiments in gold standard large animal model of pregnancy. We\npropose the Exponential Pulsation Ratio (EPR) as a key feature, and develop\nmachine-learning models to fuse the information collected across multiple\ndetectors. Our proposed method demonstrates a Mean Absolute Error (MAE) of\n4.81% and 6.85% with a Pearson's r correlation of 0.81 (p<0.001) and 0.71\n(p<0.001) for estimation of fSpO$_2$ in simulated dataset and in-vivo dataset,\nrespectively. Across both datasets, our method outperforms the existing\napproaches, enhancing the accuracy of the fSpO$_2$ estimation and demonstrates\nits viability as a supplemental technology for intrapartum fetal monitoring."}
{"id": "2509.22520", "pdf": "https://arxiv.org/pdf/2509.22520", "abs": "https://arxiv.org/abs/2509.22520", "authors": ["Bjarke Frost Nielsen", "Amey P. Pasarkar", "Qiqi Yang", "Bryan T. Grenfell", "Adji Bousso Dieng"], "title": "Applications of the Vendi score in genomic epidemiology", "categories": ["q-bio.PE", "q-bio.QM"], "comment": null, "summary": "The Vendi score (VS), a diversity metric recently conceived in the context of\nmachine learning, with applications in a wide range of fields, has a few\ndistinct advantages over the metrics commonly used in ecology. It is\nclassification-independent, incorporates abundance information, and has a\ntunable sensitivity to rare/abundant types. Using rich COVID-19 sequence data\nas a paradigm, we develop methods for applying the VS to time-resolved sequence\ndata. We show how the VS allows for characterization of the overall diversity\nof circulating viruses and for discernment of emerging variants prior to formal\nidentification. Furthermore, applying the VS to phylogenetic trees provides a\nconvenient overview of within-clade diversity which can aid viral variant\ndetection."}
