{"id": "2507.16978", "pdf": "https://arxiv.org/pdf/2507.16978", "abs": "https://arxiv.org/abs/2507.16978", "authors": ["Mohammad Saleh Refahi", "Gavin Hearne", "Harrison Muller", "Kieran Lynch", "Bahrad A. Sokhansanj", "James R. Brown", "Gail Rosen"], "title": "Fast and Scalable Gene Embedding Search: A Comparative Study of FAISS and ScaNN", "categories": ["q-bio.GN", "cs.AI", "cs.LG"], "comment": null, "summary": "The exponential growth of DNA sequencing data has outpaced traditional\nheuristic-based methods, which struggle to scale effectively. Efficient\ncomputational approaches are urgently needed to support large-scale similarity\nsearch, a foundational task in bioinformatics for detecting homology,\nfunctional similarity, and novelty among genomic and proteomic sequences.\nAlthough tools like BLAST have been widely used and remain effective in many\nscenarios, they suffer from limitations such as high computational cost and\npoor performance on divergent sequences.\n  In this work, we explore embedding-based similarity search methods that learn\nlatent representations capturing deeper structural and functional patterns\nbeyond raw sequence alignment. We systematically evaluate two state-of-the-art\nvector search libraries, FAISS and ScaNN, on biologically meaningful gene\nembeddings. Unlike prior studies, our analysis focuses on\nbioinformatics-specific embeddings and benchmarks their utility for detecting\nnovel sequences, including those from uncharacterized taxa or genes lacking\nknown homologs. Our results highlight both computational advantages (in memory\nand runtime efficiency) and improved retrieval quality, offering a promising\nalternative to traditional alignment-heavy tools."}
{"id": "2507.16855", "pdf": "https://arxiv.org/pdf/2507.16855", "abs": "https://arxiv.org/abs/2507.16855", "authors": ["Joey Spronck", "Leander van Eekelen", "Dominique van Midden", "Joep Bogaerts", "Leslie Tessier", "Valerie Dechering", "Muradije Demirel-Andishmand", "Gabriel Silva de Souza", "Roland Nemeth", "Enrico Munari", "Giuseppe Bogina", "Ilaria Girolami", "Albino Eccher", "Balazs Acs", "Ceren Boyaci", "Natalie Klubickova", "Monika Looijen-Salamon", "Shoko Vos", "Francesco Ciompi"], "title": "A tissue and cell-level annotated H&E and PD-L1 histopathology image dataset in non-small cell lung cancer", "categories": ["q-bio.QM", "cs.CV", "eess.IV"], "comment": "Our dataset is available at 'https://zenodo.org/records/15674785' and\n  our code is available at\n  'https://github.com/DIAGNijmegen/ignite-data-toolkit'", "summary": "The tumor immune microenvironment (TIME) in non-small cell lung cancer\n(NSCLC) histopathology contains morphological and molecular characteristics\npredictive of immunotherapy response. Computational quantification of TIME\ncharacteristics, such as cell detection and tissue segmentation, can support\nbiomarker development. However, currently available digital pathology datasets\nof NSCLC for the development of cell detection or tissue segmentation\nalgorithms are limited in scope, lack annotations of clinically prevalent\nmetastatic sites, and forgo molecular information such as PD-L1\nimmunohistochemistry (IHC). To fill this gap, we introduce the IGNITE data\ntoolkit, a multi-stain, multi-centric, and multi-scanner dataset of annotated\nNSCLC whole-slide images. We publicly release 887 fully annotated regions of\ninterest from 155 unique patients across three complementary tasks: (i)\nmulti-class semantic segmentation of tissue compartments in H&E-stained slides,\nwith 16 classes spanning primary and metastatic NSCLC, (ii) nuclei detection,\nand (iii) PD-L1 positive tumor cell detection in PD-L1 IHC slides. To the best\nof our knowledge, this is the first public NSCLC dataset with manual\nannotations of H&E in metastatic sites and PD-L1 IHC."}
{"id": "2507.17446", "pdf": "https://arxiv.org/pdf/2507.17446", "abs": "https://arxiv.org/abs/2507.17446", "authors": ["Sven Larsen-Ledet", "Aleksandra Panfilova", "Amelie Stein"], "title": "Variant effects on protein-protein interactions: methods, models and diseases", "categories": ["q-bio.BM", "q-bio.MN"], "comment": null, "summary": "Advances in sequencing have revealed that each individual carries about\n10,000 missense variants. For the vast majority, we do not know what the\nfunctional consequences - if any - will be. Further, mechanistic insight, such\nas structural details, would be immensely helpful in development of therapeutic\napproaches. Here we review recent developments in experimental and\ncomputational techniques aimed to assess the impact of variants on\nprotein-protein interactions, including limitations and upcoming challenges."}
{"id": "2507.16876", "pdf": "https://arxiv.org/pdf/2507.16876", "abs": "https://arxiv.org/abs/2507.16876", "authors": ["Charlotte Jennings", "Andrew Broad", "Lucy Godson", "Emily Clarke", "David Westhead", "Darren Treanor"], "title": "Machine learning-based multimodal prognostic models integrating pathology images and high-throughput omic data for overall survival prediction in cancer: a systematic review", "categories": ["q-bio.QM", "cs.AI", "cs.LG"], "comment": "Main article (50 pages, inc 3 tables, 4 figures). Supplementary\n  material included with additional methodological information and data", "summary": "Multimodal machine learning integrating histopathology and molecular data\nshows promise for cancer prognostication. We systematically reviewed studies\ncombining whole slide images (WSIs) and high-throughput omics to predict\noverall survival. Searches of EMBASE, PubMed, and Cochrane CENTRAL\n(12/08/2024), plus citation screening, identified eligible studies. Data\nextraction used CHARMS; bias was assessed with PROBAST+AI; synthesis followed\nSWiM and PRISMA 2020. Protocol: PROSPERO (CRD42024594745).\n  Forty-eight studies (all since 2017) across 19 cancer types met criteria; all\nused The Cancer Genome Atlas. Approaches included regularised Cox regression\n(n=4), classical ML (n=13), and deep learning (n=31). Reported c-indices ranged\n0.550-0.857; multimodal models typically outperformed unimodal ones. However,\nall studies showed unclear/high bias, limited external validation, and little\nfocus on clinical utility.\n  Multimodal WSI-omics survival prediction is a fast-growing field with\npromising results but needs improved methodological rigor, broader datasets,\nand clinical evaluation.\n  Funded by NPIC, Leeds Teaching Hospitals NHS Trust, UK (Project 104687),\nsupported by UKRI Industrial Strategy Challenge Fund."}
{"id": "2507.17004", "pdf": "https://arxiv.org/pdf/2507.17004", "abs": "https://arxiv.org/abs/2507.17004", "authors": ["Maria Letícia Salvador", "Gabriel Rodrigues Palma", "Mariana Coelly Modesto Santos Tavares", "Iran Jose Oliveira Silva", "Idemauro Antonio Rodrigues de Lara"], "title": "Modelling longitudinal polytomous animal data using Bayesian hierarchical models", "categories": ["stat.ME", "q-bio.QM"], "comment": "25 pages", "summary": "The analysis of longitudinal categorical data can be complex and unfeasible\ndue to the number of parameters involved, characterised by overparameterisation\nleading to model non-convergence, in addition to problems related to sample\nsize and the presence or absence of overdispersion. In this context, we\nintroduce Bayesian hierarchical models as an alternative methodology to\nclassical statistical techniques for analysing nominal polytomous data in\nlongitudinal studies. The theoretical foundation is based on the use of\nnon-informative priors and advanced computational techniques, such as Markov\nChain Monte Carlo (MCMC) methods, which enable a robust and flexible data\nanalysis framework. As a motivating example, the procedure is illustrated\nthrough an applied study in agrarian science, focusing on animal welfare, which\nassessed seven types of behaviours exhibited by pigs over twelve weeks. The\nresults demonstrated the efficacy of Bayesian hierarchical models for the\nanalysis of longitudinal nominal polytomous data. Since the computational\nprocedures were implemented in the R software and the codes are available, this\nwork will serve as support for those who need such analyses, especially in\nagricultural designs, where longitudinal categorical data are frequently\nencountered."}
{"id": "2507.17009", "pdf": "https://arxiv.org/pdf/2507.17009", "abs": "https://arxiv.org/abs/2507.17009", "authors": ["Ming Huang", "Zehan Li", "Yan Hu", "Wanjing Wang", "Andrew Wen", "Scott Lane", "Salih Selek", "Lokesh Shahani", "Rodrigo Machado-Vieira", "Jair Soares", "Hua Xu", "Hongfang Liu"], "title": "Multi-Label Classification with Generative AI Models in Healthcare: A Case Study of Suicidality and Risk Factors", "categories": ["cs.CL", "cs.IR", "q-bio.QM"], "comment": null, "summary": "Suicide remains a pressing global health crisis, with over 720,000 deaths\nannually and millions more affected by suicide ideation (SI) and suicide\nattempts (SA). Early identification of suicidality-related factors (SrFs),\nincluding SI, SA, exposure to suicide (ES), and non-suicidal self-injury\n(NSSI), is critical for timely intervention. While prior studies have applied\nAI to detect SrFs in clinical notes, most treat suicidality as a binary\nclassification task, overlooking the complexity of cooccurring risk factors.\nThis study explores the use of generative large language models (LLMs),\nspecifically GPT-3.5 and GPT-4.5, for multi-label classification (MLC) of SrFs\nfrom psychiatric electronic health records (EHRs). We present a novel end to\nend generative MLC pipeline and introduce advanced evaluation methods,\nincluding label set level metrics and a multilabel confusion matrix for error\nanalysis. Finetuned GPT-3.5 achieved top performance with 0.94 partial match\naccuracy and 0.91 F1 score, while GPT-4.5 with guided prompting showed superior\nperformance across label sets, including rare or minority label sets,\nindicating a more balanced and robust performance. Our findings reveal\nsystematic error patterns, such as the conflation of SI and SA, and highlight\nthe models tendency toward cautious over labeling. This work not only\ndemonstrates the feasibility of using generative AI for complex clinical\nclassification tasks but also provides a blueprint for structuring unstructured\nEHR data to support large scale clinical research and evidence based medicine."}
{"id": "2507.17697", "pdf": "https://arxiv.org/pdf/2507.17697", "abs": "https://arxiv.org/abs/2507.17697", "authors": ["Janis Keck"], "title": "Frequentist Asymptotics of Variational Laplace", "categories": ["math.ST", "q-bio.QM", "stat.TH"], "comment": "30 pages, 3 figures, originally submitted as a master's thesis", "summary": "Variational inference is a general framework to obtain approximations to the\nposterior distribution in a Bayesian context. In essence, variational inference\nentails an optimization over a given family of probability distributions to\nchoose the member of this family best approximating the posterior. Variational\nLaplace, an iterative update scheme motivated by this objective, is widely used\nin different contexts in the cognitive neuroscience community. However, until\nnow, the theoretical properties of this scheme have not been systematically\ninvestigated. Here, we study variational Laplace in the light of frequentist\nasymptotic statistics. Asymptotical frequentist theory enables one to judge the\nquality of point estimates by their limit behaviour. We apply this framework to\nfind that point estimates generated by variational Laplace enjoy the desirable\nproperties of asymptotic consistency and efficiency in two toy examples.\nFurthermore, we derive conditions that are sufficient to establish these\nproperties in a general setting. Besides of point estimates, we also study the\nfrequentist convergence of distributions in the sense of total variation\ndistance, which may be useful to relate variational Laplace both to recent\nfindings regarding variational inference as well as to classical frequentist\nconsiderations on the Bayesian posterior. Finally, to illustrate the validity\nof our theoretical considerations, we conduct simulation experiments in our\nstudy examples."}
