{"id": "2602.02620", "pdf": "https://arxiv.org/pdf/2602.02620", "abs": "https://arxiv.org/abs/2602.02620", "authors": ["Weining Fu", "Kai Shu", "Kui Xu", "Qiangfeng Cliff Zhang"], "title": "CryoLVM: Self-supervised Learning from Cryo-EM Density Maps with Large Vision Models", "categories": ["q-bio.QM", "cs.AI", "cs.LG"], "comment": null, "summary": "Cryo-electron microscopy (cryo-EM) has revolutionized structural biology by enabling near-atomic-level visualization of biomolecular assemblies. However, the exponential growth in cryo-EM data throughput and complexity, coupled with diverse downstream analytical tasks, necessitates unified computational frameworks that transcend current task-specific deep learning approaches with limited scalability and generalizability. We present CryoLVM, a foundation model that learns rich structural representations from experimental density maps with resolved structures by leveraging the Joint-Embedding Predictive Architecture (JEPA) integrated with SCUNet-based backbone, which can be rapidly adapted to various downstream tasks. We further introduce a novel histogram-based distribution alignment loss that accelerates convergence and enhances fine-tuning performance. We demonstrate CryoLVM's effectiveness across three critical cryo-EM tasks: density map sharpening, density map super-resolution, and missing wedge restoration. Our method consistently outperforms state-of-the-art baselines across multiple density map quality metrics, confirming its potential as a versatile model for a wide spectrum of cryo-EM applications."}
{"id": "2602.02558", "pdf": "https://arxiv.org/pdf/2602.02558", "abs": "https://arxiv.org/abs/2602.02558", "authors": ["Zekang Yang", "Hong Liu", "Xiangdong Wang"], "title": "PA-MIL: Phenotype-Aware Multiple Instance Learning Guided by Language Prompting and Genotype-to-Phenotype Relationships", "categories": ["cs.LG", "cs.AI", "q-bio.QM"], "comment": null, "summary": "Deep learning has been extensively researched in the analysis of pathology whole-slide images (WSIs). However, most existing methods are limited to providing prediction interpretability by locating the model's salient areas in a post-hoc manner, failing to offer more reliable and accountable explanations. In this work, we propose Phenotype-Aware Multiple Instance Learning (PA-MIL), a novel ante-hoc interpretable framework that identifies cancer-related phenotypes from WSIs and utilizes them for cancer subtyping. To facilitate PA-MIL in learning phenotype-aware features, we 1) construct a phenotype knowledge base containing cancer-related phenotypes and their associated genotypes. 2) utilize the morphological descriptions of phenotypes as language prompting to aggregate phenotype-related features. 3) devise the Genotype-to-Phenotype Neural Network (GP-NN) grounded in genotype-to-phenotype relationships, which provides multi-level guidance for PA-MIL. Experimental results on multiple datasets demonstrate that PA-MIL achieves competitive performance compared to existing MIL methods while offering improved interpretability. PA-MIL leverages phenotype saliency as evidence and, using a linear classifier, achieves competitive results compared to state-of-the-art methods. Additionally, we thoroughly analyze the genotype-phenotype relationships, as well as cohort-level and case-level interpretability, demonstrating the reliability and accountability of PA-MIL."}
{"id": "2602.02638", "pdf": "https://arxiv.org/pdf/2602.02638", "abs": "https://arxiv.org/abs/2602.02638", "authors": ["Md Ishtyaq Mahmud", "Veena Kochat", "Suresh Satpati", "Jagan Mohan Reddy Dwarampudi", "Humaira Anzum", "Kunal Rai", "Tania Banerjee"], "title": "hSNMF: Hybrid Spatially Regularized NMF for Image-Derived Spatial Transcriptomics", "categories": ["cs.LG", "q-bio.QM"], "comment": "The paper is accepted to the 2026 IEEE 23rd International Symposium on Biomedical Imaging (ISBI); 5 pages, 1 figure", "summary": "High-resolution spatial transcriptomics platforms, such as Xenium, generate single-cell images that capture both molecular and spatial context, but their extremely high dimensionality poses major challenges for representation learning and clustering. In this study, we analyze data from the Xenium platform, which captures high-resolution images of tumor microarray (TMA) tissues and converts them into cell-by-gene matrices suitable for computational analysis. We benchmark and extend nonnegative matrix factorization (NMF) for spatial transcriptomics by introducing two spatially regularized variants. First, we propose Spatial NMF (SNMF), a lightweight baseline that enforces local spatial smoothness by diffusing each cell's NMF factor vector over its spatial neighborhood. Second, we introduce Hybrid Spatial NMF (hSNMF), which performs spatially regularized NMF followed by Leiden clustering on a hybrid adjacency that integrates spatial proximity (via a contact-radius graph) and transcriptomic similarity through a tunable mixing parameter alpha. Evaluated on a cholangiocarcinoma dataset, SNMF and hSNMF achieve markedly improved spatial compactness (CHAOS < 0.004, Moran's I > 0.96), greater cluster separability (Silhouette > 0.12, DBI < 1.8), and higher biological coherence (CMC and enrichment) compared to other spatial baselines. Availability and implementation: https://github.com/ishtyaqmahmud/hSNMF"}
{"id": "2602.02825", "pdf": "https://arxiv.org/pdf/2602.02825", "abs": "https://arxiv.org/abs/2602.02825", "authors": ["Jiayu Su", "Jun Hou Fung", "Haoyu Wang", "Dian Yang", "David A. Knowles", "Raul Rabadan"], "title": "On the consistent and scalable detection of spatial patterns", "categories": ["stat.AP", "q-bio.QM", "stat.ME"], "comment": null, "summary": "Detecting spatial patterns is fundamental to scientific discovery, yet current methods lack statistical consensus and face computational barriers when applied to large-scale spatial omics datasets. We unify major approaches through a single quadratic form and derive general consistency conditions. We reveal that several widely used methods, including Moran's I, are inconsistent, and propose scalable corrections. The resulting test enables robust pattern detection across millions of spatial locations and single-cell lineage-tracing datasets."}
{"id": "2602.02920", "pdf": "https://arxiv.org/pdf/2602.02920", "abs": "https://arxiv.org/abs/2602.02920", "authors": ["Jagan Mohan Reddy Dwarampudi", "Jennifer L Purks", "Joshua Wong", "Renjie Hu", "Tania Banerjee"], "title": "A Reproducible Framework for Bias-Resistant Machine Learning on Small-Sample Neuroimaging Data", "categories": ["cs.LG", "cs.CV", "q-bio.NC", "q-bio.QM"], "comment": "Accepted to ISBI 2026, 5 pages with 1 figure", "summary": "We introduce a reproducible, bias-resistant machine learning framework that integrates domain-informed feature engineering, nested cross-validation, and calibrated decision-threshold optimization for small-sample neuroimaging data. Conventional cross-validation frameworks that reuse the same folds for both model selection and performance estimation yield optimistically biased results, limiting reproducibility and generalization. Demonstrated on a high-dimensional structural MRI dataset of deep brain stimulation cognitive outcomes, the framework achieved a nested-CV balanced accuracy of 0.660\\,$\\pm$\\,0.068 using a compact, interpretable subset selected via importance-guided ranking. By combining interpretability and unbiased evaluation, this work provides a generalizable computational blueprint for reliable machine learning in data-limited biomedical domains."}
{"id": "2602.03343", "pdf": "https://arxiv.org/pdf/2602.03343", "abs": "https://arxiv.org/abs/2602.03343", "authors": ["Georgy Meshcheryakov", "Andrey I. Buyan"], "title": "MARADONER: Motif Activity Response Analysis Done Right", "categories": ["stat.CO", "q-bio.GN", "q-bio.QM"], "comment": null, "summary": "Inferring the activities of transcription factors from high-throughput transcriptomic or open chromatin profiling, such as RNA-/CAGE-/ATAC-Seq, is a long-standing challenge in systems biology. Identification of highly active master regulators enables mechanistic interpretation of differential gene expression, chromatin state changes, or perturbation responses across conditions, cell types, and diseases. Here, we describe MARADONER, a statistical framework and its software implementation for motif activity response analysis (MARA), utilizing the sequence-level features obtained with pattern matching (motif scanning) of individual promoters and promoter- or gene-level activity or expression estimates. Compared to the classic MARA, MARADONER (MARA-done-right) employs an unbiased variance parameter estimation and a bias-adjusted likelihood estimation of fixed effects, thereby enhancing goodness-of-fit and the accuracy of activity estimation. Further, MARADONER is capable of accounting for heteroscedasticity of motif scores and activity estimates."}
