{"id": "2602.10152", "pdf": "https://arxiv.org/pdf/2602.10152", "abs": "https://arxiv.org/abs/2602.10152", "authors": ["Zahra Khodagholi", "Niloofar Yousefi"], "title": "Validating Interpretability in siRNA Efficacy Prediction: A Perturbation-Based, Dataset-Aware Protocol", "categories": ["q-bio.GN", "cs.LG"], "comment": null, "summary": "Saliency maps are increasingly used as \\emph{design guidance} in siRNA efficacy prediction, yet attribution methods are rarely validated before motivating sequence edits. We introduce a \\textbf{pre-synthesis gate}: a protocol for \\emph{counterfactual sensitivity faithfulness} that tests whether mutating high-saliency positions changes model output more than composition-matched controls. Cross-dataset transfer reveals two failure modes that would otherwise go undetected: \\emph{faithful-but-wrong} (saliency valid, predictions fail) and \\emph{inverted saliency} (top-saliency edits less impactful than random). Strikingly, models trained on mRNA-level assays collapse on a luciferase reporter dataset, demonstrating that protocol shifts can silently invalidate deployment. Across four benchmarks, 19/20 fold instances pass; the single failure shows inverted saliency. A biology-informed regularizer (BioPrior) strengthens saliency faithfulness with modest, dataset-dependent predictive trade-offs. Our results establish saliency validation as essential pre-deployment practice for explanation-guided therapeutic design. Code is available at https://github.com/shadi97kh/BioPrior."}
{"id": "2602.10156", "pdf": "https://arxiv.org/pdf/2602.10156", "abs": "https://arxiv.org/abs/2602.10156", "authors": ["Boyang Fu", "George Dasoulas", "Sameer Gabbita", "Xiang Lin", "Shanghua Gao", "Xiaorui Su", "Soumya Ghosh", "Marinka Zitnik"], "title": "STRAND: Sequence-Conditioned Transport for Single-Cell Perturbations", "categories": ["q-bio.GN", "cs.LG", "q-bio.CB"], "comment": "8 pages for main draft, 6 main figures", "summary": "Predicting how genetic perturbations change cellular state is a core problem for building controllable models of gene regulation. Perturbations targeting the same gene can produce different transcriptional responses depending on their genomic locus, including different transcription start sites and regulatory elements. Gene-level perturbation models collapse these distinct interventions into the same representation.\n  We introduce STRAND, a generative model that predicts single-cell transcriptional responses by conditioning on regulatory DNA sequence. STRAND represents a perturbation by encoding the sequence at its genomic locus and uses this representation to parameterize a conditional transport process from control to perturbed cell states. Representing perturbations by sequence, rather than by a fixed set of gene identifiers, supports zero-shot inference at loci not seen during training and expands inference-time genomic coverage from ~1.5% for gene-level single-cell foundation models to ~95% of the genome.\n  We evaluate STRAND on CRISPR perturbation datasets in K562, Jurkat, and RPE1 cells. STRAND improves discrimination scores by up to 33% in low-sample regimes, achieves the best average rank on unseen gene perturbation benchmarks, and improves transfer to novel cell lines by up to 0.14 in Pearson correlation. Ablations isolate the gains to sequence conditioning and transport, and case studies show that STRAND resolves functionally alternative transcription start sites missed by gene-level models."}
{"id": "2602.10163", "pdf": "https://arxiv.org/pdf/2602.10163", "abs": "https://arxiv.org/abs/2602.10163", "authors": ["Edward Wijaya"], "title": "Beyond SMILES: Evaluating Agentic Systems for Drug Discovery", "categories": ["q-bio.QM", "cs.AI"], "comment": "46 pages, 8 figures, 15 tables", "summary": "Agentic systems for drug discovery have demonstrated autonomous synthesis planning, literature mining, and molecular design. We ask how well they generalize. Evaluating six frameworks against 15 task classes drawn from peptide therapeutics, in vivo pharmacology, and resource-constrained settings, we find five capability gaps: no support for protein language models or peptide-specific prediction, no bridges between in vivo and in silico data, reliance on LLM inference with no pathway to ML training or reinforcement learning, assumptions tied to large-pharma resources, and single-objective optimization that ignores safety-efficacy-stability trade-offs. A paired knowledge-probing experiment suggests the bottleneck is architectural rather than epistemic: four frontier LLMs reason about peptides at levels comparable to small molecules, yet no framework exposes this capability. We propose design requirements and a capability matrix for next-generation frameworks that function as computational partners under realistic constraints."}
{"id": "2602.10168", "pdf": "https://arxiv.org/pdf/2602.10168", "abs": "https://arxiv.org/abs/2602.10168", "authors": ["Ethan Bandasack", "Vincent Bouget", "Apolline Bruley", "Yannis Cattan", "Charlotte Claye", "Matthew Corney", "Julien Duquesne", "Karim El Kanbi", "Aziz Fouché", "Pierre Marschall", "Francesco Strozzi"], "title": "EVA: Towards a universal model of the immune system", "categories": ["q-bio.QM", "cs.AI", "cs.LG"], "comment": null, "summary": "The effective application of foundation models to translational research in immune-mediated diseases requires multimodal patient-level representations that can capture complex phenotypes emerging from multicellular interactions. Yet most current biological foundation models focus only on single-cell resolution and are evaluated on technical metrics often disconnected from actual drug development tasks and challenges. Here, we introduce EVA, the first cross-species, multimodal foundation model of immunology and inflammation, a therapeutic area where shared pathogenic mechanisms create unique opportunities for transfer learning. EVA harmonizes transcriptomics data across species, platforms, and resolutions, and integrates histology data to produce rich, unified patient representations. We establish clear scaling laws, demonstrating that increasing model size and compute translates to improvements in both pretraining and downstream tasks performance. We introduce a comprehensive evaluation suite of 39 tasks spanning the drug development pipeline: zero-shot target efficacy and gene function prediction for discovery, cross-species or cross-diseases molecular perturbations for preclinical development, and patient stratification with treatment response prediction or disease activity prediction for clinical trials applications. We benchmark EVA against several state-of-the-art biological foundation models and baselines on these tasks, and demonstrate state-of-the-art results on each task category. Using mechanistic interpretability, we further identify biological meaningful features, revealing intertwined representations across species and technologies. We release an open version of EVA for transcriptomics to accelerate research on immune-mediated diseases."}
{"id": "2602.10303", "pdf": "https://arxiv.org/pdf/2602.10303", "abs": "https://arxiv.org/abs/2602.10303", "authors": ["Haoling Wang", "Lang Zeng", "Tao Sun", "Youngjoo Cho", "Ying Ding"], "title": "ICODEN: Ordinary Differential Equation Neural Networks for Interval-Censored Data", "categories": ["cs.LG", "q-bio.QM", "stat.ML"], "comment": null, "summary": "Predicting time-to-event outcomes when event times are interval censored is challenging because the exact event time is unobserved. Many existing survival analysis approaches for interval-censored data rely on strong model assumptions or cannot handle high-dimensional predictors. We develop ICODEN, an ordinary differential equation-based neural network for interval-censored data that models the hazard function through deep neural networks and obtains the cumulative hazard by solving an ordinary differential equation. ICODEN does not require the proportional hazards assumption or a prespecified parametric form for the hazard function, thereby permitting flexible survival modeling. Across simulation settings with proportional or non-proportional hazards and both linear and nonlinear covariate effects, ICODEN consistently achieves satisfactory predictive accuracy and remains stable as the number of predictors increases. Applications to data from multiple phases of the Alzheimer's Disease Neuroimaging Initiative (ADNI) and to two Age-Related Eye Disease Studies (AREDS and AREDS2) for age-related macular degeneration (AMD) demonstrate ICODEN's robust prediction performance. In both applications, predicting time-to-AD or time-to-late AMD, ICODEN effectively uses hundreds to more than 1,000 SNPs and supports data-driven subgroup identification with differential progression risk profiles. These results establish ICODEN as a practical assumption-lean tool for prediction with interval-censored survival data in high-dimensional biomedical settings."}
