{"id": "2602.12310", "pdf": "https://arxiv.org/pdf/2602.12310", "abs": "https://arxiv.org/abs/2602.12310", "authors": ["Casper Asbjørn Eriksen", "Jakob Lykke Andersen", "Rolf Fagerberg", "Daniel Merkle"], "title": "ChemRecon: a Consolidated Meta-Database Platform for Biochemical Data Integration", "categories": ["q-bio.QM"], "comment": "9 pages, 1 figure. Submitted to Bioinformatics", "summary": "In this paper, we present ChemRecon, a meta-database and Python interface for integrating and exploring biochemical data across multiple heterogeneous resources by consolidating compounds, reactions, enzymes, molecular structures, and atom-to-atom maps from several major databases into a single, consistent ontology. ChemRecon enables unified querying, cross-database analysis, and the construction of graph-based representations of sets of related database entries by the traversal of inter-database connections. This facilitates information extraction which is impossible within any single database, including deriving consensus information from conflicting sources, of which identifying the most probable molecular structure associated with a given compound is just one example. The Python interface is available via pip from the Python Package Index (https://pypi.org/project/chemrecon/). ChemRecon is open-source and the source code is hosted at GitLab (https://gitlab.com/casbjorn/chemrecon). Documentation and additional information is available at https://chemrecon.org."}
{"id": "2602.12317", "pdf": "https://arxiv.org/pdf/2602.12317", "abs": "https://arxiv.org/abs/2602.12317", "authors": ["Yuhan Wei", "Yuting He", "Linshan Wu", "Fuxiang Huang", "Junlin Hou", "Hao Chen"], "title": "Free Lunch in Medical Image Foundation Model Pre-training via Randomized Synthesis and Disentanglement", "categories": ["q-bio.QM", "cs.AI", "cs.LG"], "comment": null, "summary": "Medical image foundation models (MIFMs) have demonstrated remarkable potential for a wide range of clinical tasks, yet their development is constrained by the scarcity, heterogeneity, and high cost of large-scale annotated datasets. Here, we propose RaSD (Randomized Synthesis and Disentanglement), a scalable framework for pre-training MIFMs entirely on synthetic data. By modeling anatomical structures and appearance variations with randomized Gaussian distributions, RaSD exposes models to sufficient multi-scale structural and appearance perturbations, forcing them to rely on invariant and task-relevant anatomical cues rather than dataset-specific textures, thereby enabling robust and transferable representation learning. We pre-trained RaSD on 1.2 million 3D volumes and 9.6 million 2D images, and extensively evaluated the resulting models across 6 imaging modalities, 48 datasets, and 56 downstream tasks. Across all evaluated downstream tasks, RaSD consistently outperforms training-from-scratch models, achieves the best performance on 17 tasks, and remains comparable to models pre-trained on large real datasets in most others. These results demonstrate that the capacity of synthetic data alone to drive robust representation learning. Our findings establish a paradigm shift in medical AI, demonstrating that synthetic data can serve as a \"free lunch\" for scalable, privacy-preserving, and clinically generalizable foundation models."}
{"id": "2602.12730", "pdf": "https://arxiv.org/pdf/2602.12730", "abs": "https://arxiv.org/abs/2602.12730", "authors": ["Andrei Preoteasa", "Andreas Grigorjew", "Alexandru I. Tomescu", "Hajk-Georg Drost"], "title": "EMERALD-UI: An interactive web application to unveil novel protein biology hidden in the suboptimal-alignment space", "categories": ["q-bio.QM"], "comment": null, "summary": "Life over the past four billion years has been shaped by proteins and their capacity to assemble into three dimensional conformations. Protein sequence alignments have been the enabling technology for exploring the evolution and functional adaptation of proteins across the tree of life. Recent advancements in scaling the prediction of three dimensional protein structures from primary sequence alone, revealed that different modes of conservation and function operate on the sequence and structure level. This difference in protein conservation patterns and their underlying functional change that could emerge in suboptimal alignment configurations is often ignored in optimal protein alignment approaches. We introduce EMERALD-UI, an open-source interactive web application which is designed to reveal unexplored biology by visualising stable structural conformations or protein regions hidden in the suboptimal alignment space.\n  Availability: EMERALD-UI is available at https://algbio.github.io/emerald-ui/.\n  Contact: hdrost001@dundee.ac.uk or alexandru.tomescu@helsinki.fi."}
{"id": "2602.13121", "pdf": "https://arxiv.org/pdf/2602.13121", "abs": "https://arxiv.org/abs/2602.13121", "authors": ["Chris C R Smith"], "title": "LinkedNN: a neural model of linkage disequilibrium decay for recent effective population size inference", "categories": ["q-bio.PE", "q-bio.QM"], "comment": null, "summary": "Summary: A bioinformatics tool is presented for estimating recent effective population size by using a neural network to automatically compute linkage disequilibrium-related features as a function of genomic distance between polymorphisms. The new method outperforms existing deep learning and summary statistic-based approaches using relatively few sequenced individuals and variant sites, making it particularly valuable for molecular ecology applications with sparse, unphased data. Availability and implementation: The program is available as an easily installable Python package with documentation here: https://pypi.org/project/linkedNN/. The open source code is available from: https://github.com/the-smith-lab/LinkedNN."}
