{"id": "2601.19002", "pdf": "https://arxiv.org/pdf/2601.19002", "abs": "https://arxiv.org/abs/2601.19002", "authors": ["Yihan Fang"], "title": "Intrinsic Limits of Read Trimming in Single-Stranded Bisulfite Sequencing", "categories": ["q-bio.GN"], "comment": null, "summary": "Single-stranded whole-genome bisulfite sequencing (ssWGBS) enables DNA methylation profiling in low-input and highly fragmented samples, including cell-free DNA, but introduces stochastic enzymatic artifacts that complicate preprocessing and downstream interpretation. In post-bisulfite library construction, Adaptase-mediated tailing blurs the boundary between biological sequence and synthetic additions, rendering read trimming a persistent source of variability across analytical pipelines. We show that this variability reflects an intrinsic limit of per-read boundary inference rather than an algorithmic shortcoming: boundary localization is fundamentally asymmetric between paired-end reads, with Read 2 exhibiting kinetically structured artifacts that support constrained read-level inference, while apparent contamination in Read 1 arises conditionally from geometry-driven read-through events and is not well-defined at the single-read level. Even within Read 2, bisulfite-induced compositional degeneracy creates an indistinguishable regime in which genomic and synthetic origins share support under the same observable sequence evidence, implying a strictly positive Bayes error under any deterministic per-read decision rule and placing a fundamental limit on per-read boundary fidelity. By explicitly characterizing these limits, we reframe read trimming in ssWGBS as a constrained inference problem and introduce a conservative framework that operates only where supported by observable evidence (including short-range nucleotide texture), exposes interpretable trade-offs between genomic retention and residual artifact risk, and avoids forced resolution where boundaries are intrinsically unresolvable. Together, these results clarify why fixed trimming heuristics persist in practice and provide a principled foundation for uncertainty-aware preprocessing in ssWGBS."}
{"id": "2601.19384", "pdf": "https://arxiv.org/pdf/2601.19384", "abs": "https://arxiv.org/abs/2601.19384", "authors": ["Julien Eudine", "Chu Li", "Zhuo Cheng", "Renzo Andri", "Can Firtina", "Mohammad Sadrosadati", "Nika Mansouri Ghiasi", "Konstantina Koliogeorgi", "Anirban Nag", "Arash Tavakkol", "Haiyu Mao", "Onur Mutlu", "Shai Bergman", "Ji Zhang"], "title": "GenPairX: A Hardware-Algorithm Co-Designed Accelerator for Paired-End Read Mapping", "categories": ["cs.AR", "q-bio.GN"], "comment": null, "summary": "Genome sequencing has become a central focus in computational biology. A genome study typically begins with sequencing, which produces millions to billions of short DNA fragments known as reads. Read mapping aligns these reads to a reference genome. Read mapping for short reads comes in two forms: single-end and paired-end, with the latter being more prevalent due to its higher accuracy and support for advanced analysis. Read mapping remains a major performance bottleneck in genome analysis due to expensive dynamic programming. Prior efforts have attempted to mitigate this cost by employing filters to identify and potentially discard computationally expensive matches and leveraging hardware accelerators to speed up the computations. While partially effective, these approaches have limitations. In particular, existing filters are often ineffective for paired-end reads, as they evaluate each read independently and exhibit relatively low filtering ratios. In this work, we propose GenPairX, a hardware-algorithm co-designed accelerator that efficiently minimizes the computational load of paired-end read mapping while enhancing the throughput of memory-intensive operations. GenPairX introduces: (1) a novel filtering algorithm that jointly considers both reads in a pair to improve filtering effectiveness, and a lightweight alignment algorithm to replace most of the computationally expensive dynamic programming operations, and (2) two specialized hardware mechanisms to support the proposed algorithms. Our evaluations show that GenPairX delivers substantial performance improvements over state-of-the-art solutions, achieving 1575x and 1.43x higher throughput per watt compared to leading CPU-based and accelerator-based read mappers, respectively, all without compromising accuracy."}
{"id": "2601.18818", "pdf": "https://arxiv.org/pdf/2601.18818", "abs": "https://arxiv.org/abs/2601.18818", "authors": ["Marc Grimson", "Joshua Fan", "Courtney L. Davis", "Dylan van Bramer", "Daniel Fink", "Carla P. Gomes"], "title": "LabelKAN -- Kolmogorov-Arnold Networks for Inter-Label Learning: Avian Community Learning", "categories": ["q-bio.QM", "cs.AI", "q-bio.PE"], "comment": null, "summary": "Global biodiversity loss is accelerating, prompting international efforts such as the Kunming-Montreal Global Biodiversity Framework (GBF) and the United Nations Sustainable Development Goals to direct resources toward halting species declines. A key challenge in achieving this goal is having access to robust methodologies to understand where species occur and how they relate to each other within broader ecological communities. Recent deep learning-based advances in joint species distribution modeling have shown improved predictive performance, but effectively incorporating community-level learning, taking into account species-species relationships in addition to species-environment relationships, remains an outstanding challenge. We introduce LabelKAN, a novel framework based on Kolmogorov-Arnold Networks (KANs) to learn inter-label connections from predictions of each label. When modeling avian species distributions, LabelKAN achieves substantial gains in predictive performance across the vast majority of species. In particular, our method demonstrates strong improvements for rare and difficult-to-predict species, which are often the most important when setting biodiversity targets under frameworks like GBF. These performance gains also translate to more confident predictions of the species spatial patterns as well as more confident predictions of community structure. We illustrate how the LabelKAN leads to qualitative and quantitative improvements with a focused application on the Great Blue Heron, an emblematic species in freshwater ecosystems that has experienced significant population declines across the United States in recent years. Using the LabelKAN framework, we are able to identify communities and species in New York that will be most sensitive to further declines in Great Blue Heron populations."}
{"id": "2601.18819", "pdf": "https://arxiv.org/pdf/2601.18819", "abs": "https://arxiv.org/abs/2601.18819", "authors": ["Jason A. Galvis", "Taylor B. Parker", "Cesar A. Corzo", "Juliana B. Ferreira", "Kelly A. Meiklejohn", "Gustavo Machado"], "title": "Descriptive and risk analysis of vehicle movements linked to porcine reproductive and respiratory syndrome and porcine epidemic diarrhea transmission in US commercial swine farms", "categories": ["q-bio.QM"], "comment": null, "summary": "Vehicle movements, including vehicle cabs and trailers, play a role in disseminating disease in swine production. However, there are many information gaps about vehicle movements patterns that increase the probability of disease transmission, which is crucial in developing better preventive strategies. In this study we described the movement pattern of vehicle cabs and trailers and identified risk factors for porcine reproductive and respiratory syndrome (PRRS) and porcine epidemic diarrhea (PED) farm's infectious status. We collected global positioning system (GPS) movement data from vehicle cabs and trailers for 18 months and basic information for 6621 farms in the U.S. For the vehicle movement data, we estimated 66 variables and evaluate their association with farms PRRS and PED status. Our univariate analysis showed that 56 variables were significant associated (p < 0.05) to PED and PRRS farm status. Within these variables, vehicle visit frequency and previous exposition to positive farms were the main risk factors for both diseases. Otherwise, increased vehicle cab and trailer loyalty for farm shipments and vehicle cleaning and disinfection events were protective factors. In the multivariate model, each additional weekly visit by a vehicle cab that had been exposed to a positive farm one day before the shipment was associated with a 234\\% and 243\\% increase in the odds of a farm testing PRRS- and PED-positive, respectively. Our analysis revealed that vehicle contact history play a crucial role in the transmission of PRRS and PED. These findings can provide insights to develop more target strategies aimed at reducing the transmission and outbreaks linked to vehicle movements in swine production."}
