{"id": "2601.03307", "pdf": "https://arxiv.org/pdf/2601.03307", "abs": "https://arxiv.org/abs/2601.03307", "authors": ["Simen Jacobs", "Julian B. Voits", "Nikita Frolov", "Ulrich S. Schwarz", "Lendert Gelens"], "title": "Understanding the temperature response of biological systems: Part II -- Network-level mechanisms and emergent dynamics", "categories": ["q-bio.MN", "cond-mat.soft", "cond-mat.stat-mech", "nlin.AO", "physics.bio-ph"], "comment": "9 pages, 2 figures", "summary": "Building on the phenomenological and microscopic models reviewed in Part I, this second part focuses on network-level mechanisms that generate emergent temperature response curves. We review deterministic models in which temperature modulates the kinetics of coupled biochemical reactions, as well as stochastic frameworks, such as Markov chains, that capture more complex multi-step processes. These approaches show how Arrhenius-like temperature dependence at the level of individual reactions is transformed into non-Arrhenius scaling, thermal limits, and temperature compensation at the system level. Together, network-level models provide a mechanistic bridge between empirical temperature response curves and the molecular organization of biological systems, giving us predictive insights into robustness, perturbations, and evolutionary constraints."}
{"id": "2601.04016", "pdf": "https://arxiv.org/pdf/2601.04016", "abs": "https://arxiv.org/abs/2601.04016", "authors": ["Ryan LeFebre", "Fabrisia Ambrosio", "Andrew Mugler"], "title": "Restoring information in aged gene regulatory networks by single knock-ins", "categories": ["q-bio.MN", "physics.bio-ph"], "comment": "7 pages, 6 figures", "summary": "A hallmark of aging is loss of information in gene regulatory networks. These networks are tightly connected, raising the question of whether information could be restored by perturbing single genes. We develop a simple theoretical framework for information transmission in gene regulatory networks that describes the information gained or lost when a gene is \"knocked in\" (exogenously expressed). Applying the framework to gene expression data from muscle cells in young and old mice, we find that single knock-ins can restore network information by up to 10%. Our work advances the study of information flow in networks and identifies potential gene targets for rejuvenation."}
{"id": "2601.03704", "pdf": "https://arxiv.org/pdf/2601.03704", "abs": "https://arxiv.org/abs/2601.03704", "authors": ["Wajid Arshad Abbasi", "Syed Ali Abbas", "Maryum Bibi", "Saiqa Andleeb", "Muhammad Naveed Akhtar"], "title": "Investigating Knowledge Distillation Through Neural Networks for Protein Binding Affinity Prediction", "categories": ["cs.LG", "cs.AI", "q-bio.BM", "q-bio.MN", "q-bio.QM"], "comment": null, "summary": "The trade-off between predictive accuracy and data availability makes it difficult to predict protein--protein binding affinity accurately. The lack of experimentally resolved protein structures limits the performance of structure-based machine learning models, which generally outperform sequence-based methods. In order to overcome this constraint, we suggest a regression framework based on knowledge distillation that uses protein structural data during training and only needs sequence data during inference. The suggested method uses binding affinity labels and intermediate feature representations to jointly supervise the training of a sequence-based student network under the guidance of a structure-informed teacher network. Leave-One-Complex-Out (LOCO) cross-validation was used to assess the framework on a non-redundant protein--protein binding affinity benchmark dataset. A maximum Pearson correlation coefficient (P_r) of 0.375 and an RMSE of 2.712 kcal/mol were obtained by sequence-only baseline models, whereas a P_r of 0.512 and an RMSE of 2.445 kcal/mol were obtained by structure-based models. With a P_r of 0.481 and an RMSE of 2.488 kcal/mol, the distillation-based student model greatly enhanced sequence-only performance. Improved agreement and decreased bias were further confirmed by thorough error analyses. With the potential to close the performance gap between sequence-based and structure-based models as larger datasets become available, these findings show that knowledge distillation is an efficient method for transferring structural knowledge to sequence-based predictors. The source code for running inference with the proposed distillation-based binding affinity predictor can be accessed at https://github.com/wajidarshad/ProteinAffinityKD."}
{"id": "2601.03308", "pdf": "https://arxiv.org/pdf/2601.03308", "abs": "https://arxiv.org/abs/2601.03308", "authors": ["Raphael Perez", "Valentin Torrelli", "Sandrine Roques", "Sébastien Devidal", "Clément Piel", "Damien Landais", "Merlin Ramel", "Thomas Arsouze", "Julien Lamour", "Jean-Pierre Caliman", "Rémi Vezy"], "title": "A Comprehensive Database of Leaf Temperature, Water, and CO 2 Fluxes in Young Oil Palm Plants Across Diverse Climate Scenarios", "categories": ["q-bio.QM"], "comment": "Data and code availability: The raw data and scripts used to generate the final database are detailed and accessible on Zenodo (Vezy et al., 2025), the code is also accessible via a Github repository (https://github.com/PalmStudio/Biophysics\\_database\\_palm), and we also provide a companion website (https://palmstudio.github.io/Biophysics\\_database\\_palm) showing how computations were made and the main results. The code to trigger the FLIR camera and for logging the precision scale data is also available on dedicated Zenodo repositories (Vezy, 2025a, 2025b)", "summary": "Functional-structural plant models (FSPM) replicate plants' responses to their environment and are useful for predicting behavior in a changing climate. However, they rely on detailed measurements of traits, which are difficult to collect consistently across scales, often limiting model parameterization and thorough evaluation, and thereby reducing confidence in model predictions. Here, we provided a comprehensive dataset of structural and biophysical measurements from four oil palm plants (Elaeis guinnensis) grown under multiple controlled environmental scenarios, including varying CO2 concentrations, light, temperature and humidity conditions. The dataset included detailed reconstructions of the three-dimensional plant structures derived from terrestrial LiDAR point clouds, and enabled the parametrization of biophysical processes at the leaf scale such as photosynthesis and stomatal conductance, as well as the collection of plant-scale measurements (gas exchange measurements of CO2 and H20), which can be compared with FSPM simulations. The tree-dimensional reconstructions effectively represented the architecture of the plants and showed strong correlation with the measured total leaf area. Hence, future comparisons between simulated and observed physiological traits could be used to evaluate the quality of the physiological formalisms independently. By bridging the scales from individual leaves to the entire plant, this database allows modellers to both calibrate their biophysical models at a fine spatial resolution and evaluate their predictive accuracy at the plant scale. The provided data will facilitate benchmarking of biophysical models, help identify sources of model uncertainty, and ultimately enhance model predictions, which can be applied in various fields, from cognitive studies to decision support applications."}
{"id": "2601.03299", "pdf": "https://arxiv.org/pdf/2601.03299", "abs": "https://arxiv.org/abs/2601.03299", "authors": ["Richik Chakraborty"], "title": "Progressive Bayesian Confidence Architectures for Cold-Start Personal Health Analytics: Formalizing Early Insight Through Posterior Contraction and Risk-Aware Interpretation", "categories": ["stat.ME", "math.ST", "q-bio.QM"], "comment": null, "summary": "Personal health analytics systems face a persistent cold-start dilemma: users expect meaningful insights early in data collection, while conventional statistical inference requires data volumes that often exceed engagement horizons. Existing approaches either delay inference until fixed statistical thresholds are met -- leading to user disengagement -- or surface heuristic insights without formal uncertainty quantification, risking false confidence. We propose a progressive Bayesian confidence architecture that formalizes early-stage inference through phased interpretation of posterior uncertainty. Drawing on Bayesian updating and epistemic strategies from financial risk modeling under sparse observations, we map posterior contraction to interpretable tiers of insight, ranging from exploratory directional evidence to robust associative inference. We demonstrate the framework's performance through controlled experimentation with synthetic N-of-1 health data, showing that calibrated early insights can be generated within 5--7 days while maintaining explicit epistemic humility. Compared to fixed-threshold baselines requiring 30+ days of data, the proposed approach yields earlier directional signals (mean: 5.3 vs 31.7 days, p<0.001) while controlling false discovery rates below 6% (5.9% at day 30) despite 26-day earlier detection, compared to 0% FDR for fixed-threshold baselines that delay insights by 30 days. In addition, we show strong uncertainty calibration (76% credible interval coverage for ground-truth correlations at day 90). This work contributes a methodological framework for uncertainty-aware early inference in personalized health analytics that bridges the gap between user engagement requirements and statistical rigor."}
{"id": "2601.03704", "pdf": "https://arxiv.org/pdf/2601.03704", "abs": "https://arxiv.org/abs/2601.03704", "authors": ["Wajid Arshad Abbasi", "Syed Ali Abbas", "Maryum Bibi", "Saiqa Andleeb", "Muhammad Naveed Akhtar"], "title": "Investigating Knowledge Distillation Through Neural Networks for Protein Binding Affinity Prediction", "categories": ["cs.LG", "cs.AI", "q-bio.BM", "q-bio.MN", "q-bio.QM"], "comment": null, "summary": "The trade-off between predictive accuracy and data availability makes it difficult to predict protein--protein binding affinity accurately. The lack of experimentally resolved protein structures limits the performance of structure-based machine learning models, which generally outperform sequence-based methods. In order to overcome this constraint, we suggest a regression framework based on knowledge distillation that uses protein structural data during training and only needs sequence data during inference. The suggested method uses binding affinity labels and intermediate feature representations to jointly supervise the training of a sequence-based student network under the guidance of a structure-informed teacher network. Leave-One-Complex-Out (LOCO) cross-validation was used to assess the framework on a non-redundant protein--protein binding affinity benchmark dataset. A maximum Pearson correlation coefficient (P_r) of 0.375 and an RMSE of 2.712 kcal/mol were obtained by sequence-only baseline models, whereas a P_r of 0.512 and an RMSE of 2.445 kcal/mol were obtained by structure-based models. With a P_r of 0.481 and an RMSE of 2.488 kcal/mol, the distillation-based student model greatly enhanced sequence-only performance. Improved agreement and decreased bias were further confirmed by thorough error analyses. With the potential to close the performance gap between sequence-based and structure-based models as larger datasets become available, these findings show that knowledge distillation is an efficient method for transferring structural knowledge to sequence-based predictors. The source code for running inference with the proposed distillation-based binding affinity predictor can be accessed at https://github.com/wajidarshad/ProteinAffinityKD."}
{"id": "2601.03877", "pdf": "https://arxiv.org/pdf/2601.03877", "abs": "https://arxiv.org/abs/2601.03877", "authors": ["Maxime Lucas", "Corentin Bisot", "Giovanni Petri", "Stéphane Declerck", "Timoteo Carletti"], "title": "Minimal branching and fusion morphogenesis approaches biological multi-objective optimality", "categories": ["nlin.AO", "physics.soc-ph", "q-bio.QM"], "comment": null, "summary": "Many biological networks grow by elongation of filaments that can branch and fuse -- typical examples include fungal mycelium or slime mold. These networks must simultaneously perform multiple tasks such as transport, exploration, and robustness under finite resources. Yet, how such multi-task architectures emerge from local growth processes remains poorly understood. Here, we introduce a minimal model of spatial network morphogenesis based solely on stochastic branching, fusion, and stopping, during elongation. Despite the absence of global optimization or feedback, the model generates a broad morphospace from tree-like, to loopy, as well as hybrid architectures. By quantifying multiple functional objectives, we show that (i) these synthetic structures occupy similar regions of performance space than evolved empirical fungal networks, and (ii) that their Pareto front of optimal trade-offs lies close to that of these same fungal networks. Our results show that biological architectures approaching multi-objective optimality can arise from simple local growth rules, and identify branching and fusion as fundamental ingredients shaping the architecture of living transport networks."}
