{"id": "2601.06360", "pdf": "https://arxiv.org/pdf/2601.06360", "abs": "https://arxiv.org/abs/2601.06360", "authors": ["Mara Pleasure", "Ekaterina Redekop", "Dhakshina Ilango", "Zichen Wang", "Vedrana Ivezic", "Kimberly Flores", "Israa Laklouk", "Jitin Makker", "Gregory Fishbein", "Anthony Sisk", "William Speier", "Corey W. Arnold"], "title": "Computational Mapping of Reactive Stroma in Prostate Cancer Yields Interpretable, Prognostic Biomarkers", "categories": ["q-bio.QM", "cs.LG"], "comment": null, "summary": "Current histopathological grading of prostate cancer relies primarily on glandular architecture, largely overlooking the tumor microenvironment. Here, we present PROTAS, a deep learning framework that quantifies reactive stroma (RS) in routine hematoxylin and eosin (H&E) slides and links stromal morphology to underlying biology. PROTAS-defined RS is characterized by nuclear enlargement, collagen disorganization, and transcriptomic enrichment of contractile pathways. PROTAS detects RS robustly in the external Prostate, Lung, Colorectal, and Ovarian (PLCO) dataset and, using domain-adversarial training, generalizes to diagnostic biopsies. In head-to-head comparisons, PROTAS outperforms pathologists for RS detection, and spatial RS features predict biochemical recurrence independently of established prognostic variables (c-index 0.80). By capturing subtle stromal phenotypes associated with tumor progression, PROTAS provides an interpretable, scalable biomarker to refine risk stratification."}
{"id": "2601.07691", "pdf": "https://arxiv.org/pdf/2601.07691", "abs": "https://arxiv.org/abs/2601.07691", "authors": ["Jonathan D. Socha", "Seyed F. Maroufi", "Dipankar Biswas", "Richard Um", "Aruna S. Rao", "Mark G. Luciano"], "title": "A Framework for Feature Discovery in Intracranial Pressure Monitoring Data Using Neural Network Attention", "categories": ["q-bio.QM", "cs.LG"], "comment": "12 pages, 18 figures", "summary": "We present a novel framework for analyzing intracranial pressure monitoring data by applying interpretability principles. Intracranial pressure monitoring data was collected from 60 patients at Johns Hopkins. The data was segmented into individual cardiac cycles. A convolutional neural network was trained to classify each cardiac cycle into one of seven body positions. Neural network attention was extracted and was used to identify regions of interest in the waveform. Further directions for exploration are identified. This framework provides an extensible method to further understand the physiological and clinical underpinnings of the intracranial pressure waveform, which could lead to better diagnostic capabilities for intracranial pressure monitoring."}
{"id": "2601.06214", "pdf": "https://arxiv.org/pdf/2601.06214", "abs": "https://arxiv.org/abs/2601.06214", "authors": ["Fang Wu", "Stan Z. Li"], "title": "Dynamics-inspired Structure Hallucination for Protein-protein Interaction Modeling", "categories": ["cs.LG", "cs.AI", "q-bio.QM"], "comment": null, "summary": "Protein-protein interaction (PPI) represents a central challenge within the biology field, and accurately predicting the consequences of mutations in this context is crucial for drug design and protein engineering. Deep learning (DL) has shown promise in forecasting the effects of such mutations, but is hindered by two primary constraints. First, the structures of mutant proteins are often elusive to acquire. Secondly, PPI takes place dynamically, which is rarely integrated into the DL architecture design. To address these obstacles, we present a novel framework named Refine-PPI with two key enhancements. First, we introduce a structure refinement module trained by a mask mutation modeling (MMM) task on available wild-type structures, which is then transferred to produce the inaccessible mutant structures. Second, we employ a new kind of geometric network, called the probability density cloud network (PDC-Net), to capture 3D dynamic variations and encode the atomic uncertainty associated with PPI. Comprehensive experiments on SKEMPI.v2 substantiate the superiority of Refine-PPI over all existing tools for predicting free energy change. These findings underscore the effectiveness of our hallucination strategy and the PDC module in addressing the absence of mutant protein structure and modeling geometric uncertainty."}
{"id": "2601.07261", "pdf": "https://arxiv.org/pdf/2601.07261", "abs": "https://arxiv.org/abs/2601.07261", "authors": ["Haomin Wu", "Zhiwei Nie", "Hongyu Zhang", "Zhixiang Ren"], "title": "Pseudodata-guided Invariant Representation Learning Boosts the Out-of-Distribution Generalization in Enzymatic Kinetic Parameter Prediction", "categories": ["cs.LG", "cs.AI", "q-bio.QM"], "comment": null, "summary": "Accurate prediction of enzyme kinetic parameters is essential for understanding catalytic mechanisms and guiding enzyme engineering.However, existing deep learning-based enzyme-substrate interaction (ESI) predictors often exhibit performance degradation on sequence-divergent, out-of-distribution (OOD) cases, limiting robustness under biologically relevant perturbations.We propose O$^2$DENet, a lightweight, plug-and-play module that enhances OOD generalization via biologically and chemically informed perturbation augmentation and invariant representation learning.O$^2$DENet introduces enzyme-substrate perturbations and enforces consistency between original and augmented enzyme-substrate-pair representations to encourage invariance to distributional shifts.When integrated with representative ESI models, O$^2$DENet consistently improves predictive performance for both $k_{cat}$ and $K_m$ across stringent sequence-identity-based OOD benchmarks, achieving state-of-the-art results among the evaluated methods in terms of accuracy and robustness metrics.Overall, O$^2$DENet provides a general and effective strategy to enhance the stability and deployability of data-driven enzyme kinetics predictors for real-world enzyme engineering applications."}
{"id": "2601.07826", "pdf": "https://arxiv.org/pdf/2601.07826", "abs": "https://arxiv.org/abs/2601.07826", "authors": ["Ninghui Hao", "Xinxing Yang", "Boshen Yan", "Dong Li", "Junzhou Huang", "Xintao Wu", "Emily S. Ruiz", "Arlene Ruiz de Luzuriaga", "Chen Zhao", "Guihong Wan"], "title": "Histopathology-centered Computational Evolution of Spatial Omics: Integration, Mapping, and Foundation Models", "categories": ["q-bio.GN"], "comment": "30 pages, 5 figures", "summary": "Spatial omics (SO) technologies enable spatially resolved molecular profiling, while hematoxylin and eosin (H&E) imaging remains the gold standard for morphological assessment in clinical pathology. Recent computational advances increasingly place H&E images at the center of SO analysis, bridging morphology with transcriptomic, proteomic, and other spatial molecular modalities, and pushing resolution toward the single-cell level. In this survey, we systematically review the computational evolution of SO from a histopathology-centered perspective and organize existing methods into three paradigms: integration, which jointly models paired multimodal data; mapping, which infers molecular profiles from H&E images; and foundation models, which learn generalizable representations from large-scale spatial datasets. We analyze how the role of H&E images evolves across these paradigms from spatial context to predictive anchor and ultimately to representation backbone in response to practical constraints such as limited paired data and increasing resolution demands. We further summarize actionable modeling directions enabled by current architectures and delineate persistent gaps driven by data, biology, and technology that are unlikely to be resolved by model design alone. Together, this survey provides a histopathology-centered roadmap for developing and applying computational frameworks in SO."}
{"id": "2601.07591", "pdf": "https://arxiv.org/pdf/2601.07591", "abs": "https://arxiv.org/abs/2601.07591", "authors": ["Johanna M. M. Bayer", "Augustijn A. A. de Boer", "Barbora Rehak-Bucova", "Charlotte J. Fraza", "Tobias Banaschewski", "Gareth J. Barker", "Arun L. W. Bokde", "Ruediger Bruehl", "Sylvane Desrivieres", "Herta Flor", "Hugh Garavan", "Penny Gowland", "Antoine Grigis", "Andreas Heinz", "Herve Lemaitre", "Jean-Luc Martinot", "Marie-Laure Paillere Martinot", "Eric Artigues", "Frauke Nees", "Dimitri Papadopoulos Orfanos", "Tomas Paus", "Luise Poustka", "Michael N. Smolka", "Nathalie Holz", "Nilakshi Vaidya", "Henrik Walter", "Robert Whelan", "Paul Wirsching", "Gunter Schumann", "Alzheimers Disease Neuroimaging Initiative", "Nina Kraguljac", "Christian F. Beckmann", "Andre F. Marquand"], "title": "Charting the velocity of brain growth and development", "categories": ["q-bio.NC", "q-bio.QM"], "comment": null, "summary": "Brain charts have emerged as a highly useful approach for understanding brain development and aging on the basis of brain imaging and have shown substantial utility in describing typical and atypical brain development with respect to a given reference model. However, all existing models are fundamentally cross-sectional and cannot capture change over time at the individual level. We address this using velocity centiles, which directly map change over time and can be overlaid onto cross-sectionally derived population centiles. We demonstrate this by modelling rates of change for 24062 scans from 10795 healthy individuals with up to 8 longitudinal measurements across the lifespan. We provide a method to detect individual deviations from a stable trajectory, generalising the notion of thrive lines, which are used in pediatric medicine to declare failure to thrive. Using this approach, we predict transition from mild cognitive impairment to dementia more accurately than by using either time point alone, replicated across two datasets. Last, by taking into account multiple time points, we improve the sensitivity of velocity models for predicting the future trajectory of brain change. This highlights the value of predicting change over time and makes a fundamental step towards precision medicine."}
{"id": "2601.06381", "pdf": "https://arxiv.org/pdf/2601.06381", "abs": "https://arxiv.org/abs/2601.06381", "authors": ["Thomas Vaitses Fontanari", "Mariana Recamonde-Mendoza"], "title": "Hierarchical Pooling and Explainability in Graph Neural Networks for Tumor and Tissue-of-Origin Classification Using RNA-seq Data", "categories": ["cs.LG", "q-bio.GN"], "comment": null, "summary": "This study explores the use of graph neural networks (GNNs) with hierarchical pooling and multiple convolution layers for cancer classification based on RNA-seq data. We combine gene expression data from The Cancer Genome Atlas (TCGA) with a precomputed STRING protein-protein interaction network to classify tissue origin and distinguish between normal and tumor samples. The model employs Chebyshev graph convolutions (K=2) and weighted pooling layers, aggregating gene clusters into 'supernodes' across multiple coarsening levels. This approach enables dimensionality reduction while preserving meaningful interactions. Saliency methods were applied to interpret the model by identifying key genes and biological processes relevant to cancer. Our findings reveal that increasing the number of convolution and pooling layers did not enhance classification performance. The highest F1-macro score (0.978) was achieved with a single pooling layer. However, adding more layers resulted in over-smoothing and performance degradation. However, the model proved highly interpretable through gradient methods, identifying known cancer-related genes and highlighting enriched biological processes, and its hierarchical structure can be used to develop new explainable architectures. Overall, while deeper GNN architectures did not improve performance, the hierarchical pooling structure provided valuable insights into tumor biology, making GNNs a promising tool for cancer biomarker discovery and interpretation"}
{"id": "2601.07546", "pdf": "https://arxiv.org/pdf/2601.07546", "abs": "https://arxiv.org/abs/2601.07546", "authors": ["Shiv Pratap Singh Rathore", "Navin Kashyap"], "title": "Estimators for Substitution Rates in Genomes from Read Data", "categories": ["cs.IT", "q-bio.GN"], "comment": null, "summary": "We study the problem of estimating the mutation rate between two sequences from noisy sequencing reads. Existing alignment-free methods typically assume direct access to the full sequences. We extend these methods to the sequencing framework, where only noisy reads from the sequences are observed. We use a simple model in which both mutations and sequencing errors are substitutions. We propose multiple estimators, provide theoretical guarantees for one of them, and evaluate the others through simulations."}
