{"id": "2601.22203", "pdf": "https://arxiv.org/pdf/2601.22203", "abs": "https://arxiv.org/abs/2601.22203", "authors": ["Huinan Xu", "Xuyang Feng", "Junhong Chen", "Junchen Liu", "Kaiwen Deng", "Kai Ding", "Shengning Long", "Jiaxue Shuai", "Zhaorong Li", "Shiping Liu", "Guirong Xue", "Zhan Xiao"], "title": "Beyond Conditional Computation: Retrieval-Augmented Genomic Foundation Models with Gengram", "categories": ["q-bio.GN", "cs.AI"], "comment": null, "summary": "Current genomic foundation models (GFMs) rely on extensive neural computation to implicitly approximate conserved biological motifs from single-nucleotide inputs. We propose Gengram, a conditional memory module that introduces an explicit and highly efficient lookup primitive for multi-base motifs via a genomic-specific hashing scheme, establishing genomic \"syntax\". Integrated into the backbone of state-of-the-art GFMs, Gengram achieves substantial gains (up to 14%) across several functional genomics tasks. The module demonstrates robust architectural generalization, while further inspection of Gengram's latent space reveals the emergence of meaningful representations that align closely with fundamental biological knowledge. By establishing structured motif memory as a modeling primitive, Gengram simultaneously boosts empirical performance and mechanistic interpretability, providing a scalable and biology-aligned pathway for the next generation of GFMs. The code is available at https://github.com/zhejianglab/Genos, and the model checkpoint is available at https://huggingface.co/ZhejiangLab/Gengram."}
{"id": "2601.22866", "pdf": "https://arxiv.org/pdf/2601.22866", "abs": "https://arxiv.org/abs/2601.22866", "authors": ["Bo Jing", "Yu-Han Huang", "Hong-Li Zeng", "Erik Aurell"], "title": "Classification of SARS-CoV-2 Variants through The Epistatical Circos Plots with Convolutional Neural Networks", "categories": ["q-bio.GN"], "comment": null, "summary": "The COVID-19 pandemic has profoundly affected global health, driven by the remarkable transmissibility and mutational adaptability of the SARS-CoV-2 virus. Five major variants of concern, Alpha, Beta, Gamma, Delta, and Omicron, have been identified. By August 2022, over 12.95 million full-length SARS-CoV-2 genome sequences had been deposited in the Global Initiative on Sharing Avian Influenza Data (GISAID) database, offering an unprecedented opportunity to investigate viral evolution and epistatic interactions. Recent advances in epistatic inference, exemplified by Direct Coupling Analysis (DCA) (Zeng et al., Phys. Rev. E, 2022), have generated numerous Circos plots illustrating genetic inter-dependencies. In this study, we constructed a dataset of 1,984 Circos plots and developed a convolutional neural network (CNN) framework to classify and identify the corresponding genomic variants. The CNN effectively captured complex epistatic features, achieving an accuracy of 99.26\\%. These findings demonstrate that CNN-based models can serve as powerful tools for exploring higher-order genetic dependencies, providing deeper insights into the evolutionary dynamics and adaptive mechanisms of SARS-CoV-2."}
{"id": "2601.22918", "pdf": "https://arxiv.org/pdf/2601.22918", "abs": "https://arxiv.org/abs/2601.22918", "authors": ["Rubén Calvo", "Adrián Roig", "Roberto Corral López", "José Camacho-Mateu", "José A. Cuesta", "Miguel A. Muñoz"], "title": "Microbiome association diversity reflects proximity to the edge of instability", "categories": ["q-bio.PE", "q-bio.QM"], "comment": null, "summary": "Recent advances in metagenomics have revealed macroecological patterns or \"laws\" describing robust statistical regularities across microbial communities. Stochastic logistic models (SLMs), which treat species as independent -- akin to ideal gases in physics -- and incorporate environmental noise, reproduce many single-species patterns but cannot account for the pairwise covariation observed in microbiome data. Here we introduce an interacting stochastic logistic model (ISLM) that minimally extends the SLM by sampling an ensemble of random interaction networks chosen to preserve these single-species laws. Using dynamical mean-field theory, we map the model's phase diagram -- stable, chaotic, and unbounded-growth regimes -- where the transition from stable fixed-point to chaos is controlled by network sparsity and interaction heterogeneity via a May-like instability line. Going beyond mean-field theory to account for finite communities, we derive an estimator of an effective stability parameter that quantifies distance to the edge of instability and can be inferred from the width of the distribution of pairwise covariances in empirical species-abundance data. Applying this framework to synthetic data, environmental microbiomes, and human gut cohorts indicates that these communities tend to operate near the edge of instability. Moreover, gut communities from healthy individuals cluster closer to this edge and exhibit broader, more heterogeneous associations, whereas dysbiosis-associated states shift toward more stable regimes -- enabling discrimination across conditions such as Crohn's disease, inflammatory bowel syndrome, and colorectal cancer. Together, our results connect macroecological laws, interaction-network ensembles, and May's stability theory, suggesting that complex communities may benefit from operating near a dynamical phase transition."}
{"id": "2601.22684", "pdf": "https://arxiv.org/pdf/2601.22684", "abs": "https://arxiv.org/abs/2601.22684", "authors": ["Bhavyahshree Navaneetha Krishnan", "Adel Heydarabadipour", "Herbert Sauro"], "title": "BioModelsRAG: A Biological Modeling Assistant Using RAG (Retrieval Augmented Generation)", "categories": ["q-bio.MN"], "comment": null, "summary": "The BioModels database is one of the premier databases for computational models in systems biology. The database contains over 1000 curated models and an even larger number of non-curated models. All the models are stored in the machine-readable format, SBML. Although SBML can be translated into the human readable Antimony format, analyzing the models can still be time consuming. In order to bridge this gap, a LLM (large language model) assistant was created to analyze the BioModels and allow interaction between the user and the model using natural language. By doing so, a user can easily and rapidly extract the salient points in a given model. Our analysis workflow involved 'chunking' BioModels and converting them to plain text using llama3, and then embedding them in a ChromaDB database. The user-provided query was also embedded, and a similarity search was performed between the query and the BioModels in ChromaDB to extract the most relevant BioModels. The BioModels were then used as context to create the most accurate output in the chat between the user and the LLM. This approach greatly minimized the chance of hallucination and kept the LLM focused on the problem at hand."}
{"id": "2601.22971", "pdf": "https://arxiv.org/pdf/2601.22971", "abs": "https://arxiv.org/abs/2601.22971", "authors": ["Julian Wäsche", "Romina Ludwig", "Irmela Jeremias", "Christiane Fuchs"], "title": "Dynamic modelling and evaluation of preclinical trials in acute leukaemia", "categories": ["stat.ME", "q-bio.QM"], "comment": null, "summary": "Dynamic models are widely used to mathematically describe biological phenomena that evolve over time. One important area of application is leukaemia research, where leukaemia cells are genetically modified in preclinical studies to explore new therapeutic targets for reducing leukaemic burden. In advanced experiments, these studies are often conducted in mice and generate time-resolved data, the analysis of which may reveal growth-inhibiting effects of the investigated gene modifications. However, the experimental data is often times evaluated using statistical tests which compare measurements from only two different time points. This approach does not only reduce the time series to two instances but also neglects biological knowledge about cell mechanisms. Such knowledge, translated into mathematical models, expands the power to investigate and understand effects of modifications on underlying mechanisms based on experimental data. We utilise two population growth models -- an exponential and a logistic growth model -- to capture cell dynamics over the whole experimental time horizon and to consider all measurement times jointly. This approach enables us to derive modification effects from estimated model parameters. We demonstrate that the exponential growth model recognises simulated scenarios more reliably than the other candidate model and than a statistical test. Moreover, we apply the population growth models to evaluate the efficacy of candidate gene knockouts in patient-derived xenograft (PDX) models of acute leukaemia."}
{"id": "2601.23090", "pdf": "https://arxiv.org/pdf/2601.23090", "abs": "https://arxiv.org/abs/2601.23090", "authors": ["Mo Wang", "Wenhao Ye", "Junfeng Xia", "Junxiang Zhang", "Xuanye Pan", "Minghao Xu", "Haotian Deng", "Hongkai Wen", "Quanying Liu"], "title": "Omni-fMRI: A Universal Atlas-Free fMRI Foundation Model", "categories": ["cs.CE", "q-bio.QM"], "comment": null, "summary": "Self-supervised fMRI foundation models have shown promising transfer performance, yet most rely on predefined region-level parcellations that discard fine-grained voxel information and introduce atlas-dependent biases. We propose Omni-fMRI, an atlas-free foundation model that operates directly on voxel-level signals. To enable scalable pretraining on 49,497 fMRI sessions across nine datasets, Omni-fMRI introduces a dynamic patching mechanism that substantially reduces computational cost while preserving informative spatial structure. To support reproducibility and fair comparison, we establish a comprehensive benchmark suite spanning 11 datasets and a diverse set of resting-state and task-based fMRI tasks. Experimental results demonstrate that Omni-fMRI consistently outperforms existing foundation models, providing a scalable and reproducible framework for atlas-free brain representation learning. Code and logs are available."}
