{"id": "2602.16728", "pdf": "https://arxiv.org/pdf/2602.16728", "abs": "https://arxiv.org/abs/2602.16728", "authors": ["Henrique RM Antoniolli", "Lívia Kmetzsch", "Charley C Staats"], "title": "FUNGAR: a pipeline for detecting antifungal resistance mutations directly from metagenomic short reads", "categories": ["q-bio.GN"], "comment": null, "summary": "Motivation: Antifungal resistance has become an increasing global concern in both clinical and environmental health. Detecting known resistance mutations directly from sequencing reads, in special metagenomic samples, remains a major challenge. As fungal pathogens are often neglected compared with bacterial pathogens, most available tools are designed for bacterial taxa, whereas tools targeting fungi typically require assembled genomes. In metagenomic datasets, assembly-based strategies may result in substantial information loss due to genome fragmentation, low-abundance species, or incomplete recovery of resistance loci. Results: Here, we present FUNGAR, an open-source pipeline for the rapid identification of antifungal resistance genes and mutations directly from short-read data. FUNGAR employs translated alignments with DIAMOND and curated data from the FungAMR database to detect amino acid substitutions across all six open reading frames. The pipeline produces structured, reproducible reports linking detected variants to their associated antifungal drugs and can be easily customized for new species or databases."}
{"id": "2602.17532", "pdf": "https://arxiv.org/pdf/2602.17532", "abs": "https://arxiv.org/abs/2602.17532", "authors": ["Ihor Kendiukhov"], "title": "Systematic Evaluation of Single-Cell Foundation Model Interpretability Reveals Attention Captures Co-Expression Rather Than Unique Regulatory Signal", "categories": ["q-bio.GN", "cs.AI"], "comment": null, "summary": "We present a systematic evaluation framework - thirty-seven analyses, 153 statistical tests, four cell types, two perturbation modalities - for assessing mechanistic interpretability in single-cell foundation models. Applying this framework to scGPT and Geneformer, we find that attention patterns encode structured biological information with layer-specific organisation - protein-protein interactions in early layers, transcriptional regulation in late layers - but this structure provides no incremental value for perturbation prediction: trivial gene-level baselines outperform both attention and correlation edges (AUROC 0.81-0.88 versus 0.70), pairwise edge scores add zero predictive contribution, and causal ablation of regulatory heads produces no degradation. These findings generalise from K562 to RPE1 cells; the attention-correlation relationship is context-dependent, but gene-level dominance is universal. Cell-State Stratified Interpretability (CSSI) addresses an attention-specific scaling failure, improving GRN recovery up to 1.85x. The framework establishes reusable quality-control standards for the field."}
{"id": "2602.17162", "pdf": "https://arxiv.org/pdf/2602.17162", "abs": "https://arxiv.org/abs/2602.17162", "authors": ["Ariel Larey", "Elay Dahan", "Amit Bleiweiss", "Raizy Kellerman", "Guy Leib", "Omri Nayshool", "Dan Ofer", "Tal Zinger", "Dan Dominissini", "Gideon Rechavi", "Nicole Bussola", "Simon Lee", "Shane O'Connell", "Dung Hoang", "Marissa Wirth", "Alexander W. Charney", "Nati Daniel", "Yoli Shavit"], "title": "JEPA-DNA: Grounding Genomic Foundation Models through Joint-Embedding Predictive Architectures", "categories": ["cs.AI", "q-bio.GN"], "comment": null, "summary": "Genomic Foundation Models (GFMs) have largely relied on Masked Language Modeling (MLM) or Next Token Prediction (NTP) to learn the language of life. While these paradigms excel at capturing local genomic syntax and fine-grained motif patterns, they often fail to capture the broader functional context, resulting in representations that lack a global biological perspective. We introduce JEPA-DNA, a novel pre-training framework that integrates the Joint-Embedding Predictive Architecture (JEPA) with traditional generative objectives. JEPA-DNA introduces latent grounding by coupling token-level recovery with a predictive objective in the latent space by supervising a CLS token. This forces the model to predict the high-level functional embeddings of masked genomic segments rather than focusing solely on individual nucleotides. JEPA-DNA extends both NTP and MLM paradigms and can be deployed either as a standalone from-scratch objective or as a continual pre-training enhancement for existing GFMs. Our evaluations across a diverse suite of genomic benchmarks demonstrate that JEPA-DNA consistently yields superior performance in supervised and zero-shot tasks compared to generative-only baselines. By providing a more robust and biologically grounded representation, JEPA-DNA offers a scalable path toward foundation models that understand not only the genomic alphabet, but also the underlying functional logic of the sequence."}
{"id": "2602.16724", "pdf": "https://arxiv.org/pdf/2602.16724", "abs": "https://arxiv.org/abs/2602.16724", "authors": ["Gustavo Caetano-Anollés", "M. Fayez Aziz", "Fizza Mughal", "Derek Caetano-Anollés"], "title": "Tracing protein and proteome history with chronologies and networks: folding recapitulates evolution", "categories": ["q-bio.QM"], "comment": "This is an accepted manuscript of an article published by Taylor & Francis in Expert Review of Proteomics on November 22, 2021, available online", "summary": "Introduction: While the origin and evolution of proteins remain mysterious, advances in evolutionary genomics and systems biology are facilitating the historical exploration of the structure, function and organization of proteins and proteomes. Molecular chronologies are series of time events describing the history of biological systems and subsystems and the rise of biological innovations. Together with time-varying networks, these chronologies provide a window into the past. Areas covered: Here, we review molecular chronologies and networks built with modern methods of phylogeny reconstruction. We discuss how chronologies of structural domain families uncover the explosive emergence of metabolism, the late rise of translation, the co-evolution of ribosomal proteins and rRNA, and the late development of the ribosomal exit tunnel; events that coincided with a tendency to shorten folding time. Evolving networks described the early emergence of domains and a late big bang of domain combinations. Expert opinion: Two processes, folding and recruitment appear central to the evolutionary progression. The former increases protein persistence. The later fosters diversity. Chronologically, protein evolution mirrors folding by combining supersecondary structures into domains, developing translation machinery to facilitate folding speed and stability, and enhancing structural complexity by establishing long-distance interactions in novel structural and architectural designs."}
{"id": "2602.16737", "pdf": "https://arxiv.org/pdf/2602.16737", "abs": "https://arxiv.org/abs/2602.16737", "authors": ["Chang Liu", "Jieshi Chen", "Alexander J. Sundermann", "Kathleen Shutt", "Marissa P. Griffith", "Lora Lee Pless", "Lee H. Harrison", "Artur W. Dubrawski"], "title": "Exploring the Utility of MALDI-TOF Mass Spectrometry and Antimicrobial Resistance in Hospital Outbreak Detection", "categories": ["q-bio.QM", "cs.LG"], "comment": null, "summary": "Accurate and timely identification of hospital outbreak clusters is crucial for preventing the spread of infections that have epidemic potential. While assessing pathogen similarity through whole genome sequencing (WGS) is considered the gold standard for outbreak detection, its high cost and lengthy turnaround time preclude routine implementation in clinical laboratories. We explore the utility of two rapid and cost-effective alternatives to WGS, matrix-assisted laser desorption ionization-time of flight (MALDI-TOF) mass spectrometry and antimicrobial resistance (AR) patterns. We develop a machine learning framework that extracts informative representations from MALDI-TOF spectra and AR patterns for outbreak detection and explore their fusion. Through multi-species analyses, we demonstrate that in some cases MALDI-TOF and AR have the potential to reduce reliance on WGS, enabling more accessible and rapid outbreak surveillance."}
{"id": "2602.16749", "pdf": "https://arxiv.org/pdf/2602.16749", "abs": "https://arxiv.org/abs/2602.16749", "authors": ["Romiyal George", "Sathiyamohan Nishankar", "Selvarajah Thuseethan", "Chathrie Wimalasooriya", "Yakub Sebastian", "Roshan G. Ragel", "Zhongwei Liang"], "title": "U-FedTomAtt: Ultra-lightweight Federated Learning with Attention for Tomato Disease Recognition", "categories": ["q-bio.QM", "cs.LG"], "comment": "10 pages and 4 figures", "summary": "Federated learning has emerged as a privacy-preserving and efficient approach for deploying intelligent agricultural solutions. Accurate edge-based diagnosis across geographically dispersed farms is crucial for recognising tomato diseases in sustainable farming. Traditional centralised training aggregates raw data on a central server, leading to communication overhead, privacy risks and latency. Meanwhile, edge devices require lightweight networks to operate effectively within limited resources. In this paper, we propose U-FedTomAtt, an ultra-lightweight federated learning framework with attention for tomato disease recognition in resource-constrained and distributed environments. The model comprises only 245.34K parameters and 71.41 MFLOPS. First, we propose an ultra-lightweight neural network with dilated bottleneck (DBNeck) modules and a linear transformer to minimise computational and memory overhead. To mitigate potential accuracy loss, a novel local-global residual attention (LoGRA) module is incorporated. Second, we propose the federated dual adaptive weight aggregation (FedDAWA) algorithm that enhances global model accuracy. Third, our framework is validated using three benchmark datasets for tomato diseases under simulated federated settings. Experimental results show that the proposed method achieves 0.9910% and 0.9915% Top-1 accuracy and 0.9923% and 0.9897% F1-scores on SLIF-Tomato and PlantVillage tomato datasets, respectively."}
