{"id": "2601.11941", "pdf": "https://arxiv.org/pdf/2601.11941", "abs": "https://arxiv.org/abs/2601.11941", "authors": ["Tatsuaki Tsuruyama"], "title": "Fluctuation Theorems from a Continuous-Time Markov Model of Information-Thermodynamic Capacity in Biochemical Signal Cascades", "categories": ["q-bio.MN"], "comment": null, "summary": "Biochemical signaling cascades transmit intracellular information while dissipating energy under nonequilibrium conditions. We model a cascade as a code string and apply information-entropy ideas to quantify an optimal transmission rate. A time-normalized entropy functional is maximized to define a capacity-like quantity governed by a conserved multiplier. To place the theory on a rigorous stochastic-thermodynamic footing, we formulate stepwise signaling as a continuous-time Markov jump process with forward and reverse competing rates. The embedded jump chain yields well-defined transition probabilities that justify time-scale-based expressions. Under local detailed balance, the log ratio of forward and reverse rates can be interpreted as entropy production per event, enabling a trajectory-level derivation of detailed and integral fluctuation theorems. We further connect the information-theoretic capacity to the mean dissipation rate and outline finite-time fluctuation structure via the scaled cumulant generating function (SCGF) and Gallavotti--Cohen symmetry, including a worked example using MAPK/ERK timescales."}
{"id": "2601.12854", "pdf": "https://arxiv.org/pdf/2601.12854", "abs": "https://arxiv.org/abs/2601.12854", "authors": ["Xiangting Li", "Tom Chou"], "title": "A generalized work theorem for stopped stochastic chemical reaction networks", "categories": ["cond-mat.stat-mech", "q-bio.MN"], "comment": "12 pp, 4 figures", "summary": "We establish a generalized work theorem for stochastic chemical reaction networks (CRNs). By using a compensated Poisson jump process, we identify a martingale structure in a generalized entropy defined relative to an auxiliary backward process and extend nonequilibrium work relations to processes stopped at bounded arbitrary times. Our results apply to discrete, mesoscopic chemical reaction networks and remain valid for singular initial conditions and state-dependent termination events. We show how martingale properties emerge directly from the structure of reaction propensities without assuming detailed balance. Stochastic simulations of a simple chemical kinetic proofreading network are used to explore the dependence of the exponentiated entropy production on initial conditions and model parameters, validating our new work theorem relationships. Our results provide new quantitative tools for analyzing biological circuits ranging from metabolic to gene regulation pathways."}
{"id": "2601.12805", "pdf": "https://arxiv.org/pdf/2601.12805", "abs": "https://arxiv.org/abs/2601.12805", "authors": ["Xiaohan Huang", "Meng Xiao", "Chuan Qin", "Qingqing Long", "Jinmiao Chen", "Yuanchun Zhou", "Hengshu Zhu"], "title": "SciHorizon-GENE: Benchmarking LLM for Life Sciences Inference from Gene Knowledge to Functional Understanding", "categories": ["q-bio.GN", "cs.AI", "cs.CL"], "comment": "16 pages", "summary": "Large language models (LLMs) have shown growing promise in biomedical research, particularly for knowledge-driven interpretation tasks. However, their ability to reliably reason from gene-level knowledge to functional understanding, However, their ability to reliably reason from gene-level knowledge to functional understanding, a core requirement for knowledge-enhanced cell atlas interpretation, remains largely underexplored. To address this gap, we introduce SciHorizon-GENE, a large-scale gene-centric benchmark constructed from authoritative biological databases. The benchmark integrates curated knowledge for over 190K human genes and comprises more than 540K questions covering diverse gene-to-function reasoning scenarios relevant to cell type annotation, functional interpretation, and mechanism-oriented analysis. Motivated by behavioral patterns observed in preliminary examinations, SciHorizon-GENE evaluates LLMs along four biologically critical perspectives: research attention sensitivity, hallucination tendency, answer completeness, and literature influence, explicitly targeting failure modes that limit the safe adoption of LLMs in biological interpretation pipelines. We systematically evaluate a wide range of state-of-the-art general-purpose and biomedical LLMs, revealing substantial heterogeneity in gene-level reasoning capabilities and persistent challenges in generating faithful, complete, and literature-grounded functional interpretations. Our benchmark establishes a systematic foundation for analyzing LLM behavior at the gene scale and offers insights for model selection and development, with direct relevance to knowledge-enhanced biological interpretation."}
{"id": "2601.11833", "pdf": "https://arxiv.org/pdf/2601.11833", "abs": "https://arxiv.org/abs/2601.11833", "authors": ["Anthony Hur"], "title": "Karhunen-Loève Expansion-Based Residual Anomaly Map for Resource-Efficient Glioma MRI Segmentation", "categories": ["q-bio.QM", "cs.CV", "cs.LG", "eess.IV"], "comment": null, "summary": "Accurate segmentation of brain tumors is essential for clinical diagnosis and treatment planning. Deep learning is currently the state-of-the-art for brain tumor segmentation, yet it requires either large datasets or extensive computational resources that are inaccessible in most areas. This makes the problem increasingly difficult: state-of-the-art models use thousands of training cases and vast computational power, where performance drops sharply when either is limited. The top performer in the Brats GLI 2023 competition relied on supercomputers trained on over 92,000 augmented MRI scans using an AMD EPYC 7402 CPU, six NVIDIA RTX 6000 GPUs (48GB VRAM each), and 1024GB of RAM over multiple weeks. To address this, the Karhunen--Loève Expansion (KLE) was implemented as a feature extraction step on downsampled, z-score normalized MRI volumes. Each 240$\\times$240$\\times$155 multi-modal scan is reduced to four $48^3$ channels and compressed into 32 KL coefficients. The resulting approximate reconstruction enables a residual-based anomaly map, which is upsampled and added as a fifth channel to a compact 3D U-Net. All experiments were run on a consumer workstation (AMD Ryzen 5 7600X CPU, RTX 4060Ti (8GB VRAM), and 64GB RAM while using far fewer training cases. This model achieves post-processed Dice scores of 0.929 (WT), 0.856 (TC), and 0.821 (ET), with HD95 distances of 2.93, 6.78, and 10.35 voxels. These results are significantly better than the winning BraTS 2023 methodology for HD95 distances and WT dice scores. This demonstrates that a KLE-based residual anomaly map can dramatically reduce computational cost and data requirements while retaining state-of-the-art performance."}
{"id": "2601.12381", "pdf": "https://arxiv.org/pdf/2601.12381", "abs": "https://arxiv.org/abs/2601.12381", "authors": ["Esra Busra Isik", "Yusuf Hakan Usta", "Haozhe Liu", "Maryam Riazi", "William Roach", "Hongpeng Zhou", "Magnus Rattray", "Sokratia Georgaka"], "title": "Multimodal Spatial Omics: From Data Acquisition to Computational Integration", "categories": ["q-bio.QM", "q-bio.BM", "q-bio.GN"], "comment": null, "summary": "Recent developments in spatial omics technologies have enabled the generation of high dimensional molecular data, such as transcriptomes, proteomes, and epigenomes, within their spatial tissue context, either through coprofiling on the same slice or through serial tissue sections. These datasets, which are often complemented by images, have given rise to multimodal frameworks that capture both the cellular and architectural complexity of tissues across multiple molecular layers. Integration in such multimodal data poses significant computational challenges due to differences in scale, resolution, and data modality. In this review, we present a comprehensive overview of computational methods developed to integrate multimodal spatial omics and imaging datasets. We highlight key algorithmic principles underlying these methods, ranging from probabilistic to the latest deep learning approaches."}
{"id": "2601.12101", "pdf": "https://arxiv.org/pdf/2601.12101", "abs": "https://arxiv.org/abs/2601.12101", "authors": ["Pierre Gaspard"], "title": "Chargaff's second parity rule and the kinetics of DNA replication", "categories": ["q-bio.QM"], "comment": null, "summary": "A model of DNA replication is investigated, which is based on the biochemical kinetics of DNA polymerases, copying a DNA strand into its complement, except for rare point-like mutations due to nucleotide substitutions. Numerical simulations of many successive replications starting from an initial DNA sequence show that the fractions of mono- and oligonucleotides converge toward compliance with Chargaff's second parity rule. The theory of this multireplication process reveals that the approximate equalities between the fractions of complementary nucleotides are the consequence of (1) the dominant role of complementarity in the DNA replication kinetic process and (2) the smallness of the polymerase error probability. These two features lead to a robust mechanism underlying Chargaff's second parity rule."}
{"id": "2601.12381", "pdf": "https://arxiv.org/pdf/2601.12381", "abs": "https://arxiv.org/abs/2601.12381", "authors": ["Esra Busra Isik", "Yusuf Hakan Usta", "Haozhe Liu", "Maryam Riazi", "William Roach", "Hongpeng Zhou", "Magnus Rattray", "Sokratia Georgaka"], "title": "Multimodal Spatial Omics: From Data Acquisition to Computational Integration", "categories": ["q-bio.QM", "q-bio.BM", "q-bio.GN"], "comment": null, "summary": "Recent developments in spatial omics technologies have enabled the generation of high dimensional molecular data, such as transcriptomes, proteomes, and epigenomes, within their spatial tissue context, either through coprofiling on the same slice or through serial tissue sections. These datasets, which are often complemented by images, have given rise to multimodal frameworks that capture both the cellular and architectural complexity of tissues across multiple molecular layers. Integration in such multimodal data poses significant computational challenges due to differences in scale, resolution, and data modality. In this review, we present a comprehensive overview of computational methods developed to integrate multimodal spatial omics and imaging datasets. We highlight key algorithmic principles underlying these methods, ranging from probabilistic to the latest deep learning approaches."}
{"id": "2601.12455", "pdf": "https://arxiv.org/pdf/2601.12455", "abs": "https://arxiv.org/abs/2601.12455", "authors": ["Kyle Adams", "Julia Bruner", "Salma Ameziane", "Ashley Brown", "Mohammed Gbadamosi", "Helen Moore"], "title": "Identifying Therapeutic Targets for Triple-Negative Breast Cancer using a Novel Mathematical Model of the Tumor Microenvironment", "categories": ["q-bio.QM"], "comment": "39 pages, 7 figures", "summary": "Triple-negative breast cancer (TNBC) is an aggressive disease with high mortality and limited treatment options, due to its lack of receptors that have targeted therapies available. The tumor microenvironment (TME) plays a critical role in TNBC progression and therapeutic resistance. In this work, we developed a novel mathematical model to describe key cellular interactions within the TNBC TME, informed by current literature and expert input. Our model consists of a system of ordinary differential equations representing five interacting cell populations: M2 macrophages, cancer-associated fibroblasts, TNBC tumor cells, cytotoxic T lymphocytes, and regulatory T cells. We performed global sensitivity analysis to determine which model parameters most strongly influence tumor burden over a clinically-relevant treatment timeframe. The pathways associated with the most-influential parameters correspond to biological mechanisms that are consistent with known and emerging therapeutic strategies in TNBC, including stromal-mediated tumor support. These results highlight key regulatory interactions within the TNBC TME and provide a quantitative framework for hypothesis generation and future investigation of combination treatment strategies."}
{"id": "2601.12801", "pdf": "https://arxiv.org/pdf/2601.12801", "abs": "https://arxiv.org/abs/2601.12801", "authors": ["Pranali Roy Chowdhury", "Tian Xu Wang", "Abbey MacDonald", "Keith B. Tierney", "Hao Wang"], "title": "Pollutant-induced changes in fish pigmentation and spatial patterns", "categories": ["q-bio.QM", "math.AP", "physics.bio-ph"], "comment": "25", "summary": "Pigmentation abnormalities, ranging from hypo- to hyperpigmentation, can serve as biomarkers of developmental disruption in fish exposed to environmental contaminants. However, the mechanistic pathways underlying these alterations remain poorly understood. Studies have shown that pattern formation in fish development requires specific pigment cell interactions. Motivated by experimental observations of pigmentation alterations following contaminant exposure, we investigate how pollutants influence pigment cell self-organization using a continuum reaction-diffusion-advection framework. The model incorporates nonlocal Morse-type kernels to describe short- and long-range interactions among melanophores and xanthophores. Our results show that perturbations to the strengths of adhesion or repulsion can drive transitions between stripes, spots, and mixed patterns, reproducing phenotypes characteristic of fish pigmentation mutants. In particular, homotypic interactions are sensitive to contamination, leading to pronounced changes in melanophore density and resulting pigmentation patterns. Time-dependent simulations indicate that pigment changes from early short-term contaminant exposure may be recoverable, whereas prolonged exposure can lead to sustained pigment loss. In a growing fish, contaminant-induced changes in cell-cell interactions directly influence stripe formation rate, stripe number, and pigmentation levels. Overall, our study provides insight into the mechanistic link between experimentally observed pigmentation alterations and the changes in spatial patterns of adult fish."}
{"id": "2601.13211", "pdf": "https://arxiv.org/pdf/2601.13211", "abs": "https://arxiv.org/abs/2601.13211", "authors": ["James N. Cobley"], "title": "A tropical geometry for bounded biochemical state spaces", "categories": ["q-bio.QM"], "comment": "15 pages, 2 figures", "summary": "Many biochemical measurements define state spaces that are bounded, absorbing, and physically irreversible, yet are routinely analysed using linear and Euclidean frameworks that assume global invertibility, symmetry, and translation invariance. This mismatch can irretrievably obscure biological structure, independent of data quality, scale, or preprocessing. This work formalises the structure of bounded biochemical state spaces using cysteine redox regulation as a representative example and identify the minimal algebraic properties required for categorically correct representation. Hard boundaries, absorbing states, and irreversible ensemble dynamics render linear algebra incompatible with these objects. This work demonstrates that tropical algebra provides a natural realisation of the required properties by replacing additive linear structure with order-based, piecewise-linear operations that encode dominance, saturation, and path dependence without contradiction. By making non-invertibility and absorption explicit rather than implicit, this framework resolves a fundamental algebraic mismatch and establishes a principled foundation for the representation and analysis of bounded biochemical data."}
{"id": "2601.13370", "pdf": "https://arxiv.org/pdf/2601.13370", "abs": "https://arxiv.org/abs/2601.13370", "authors": ["Logan Thrasher Collins"], "title": "A First Step for Expansion X-Ray Microscopy: Achieving Contrast in Expanded Tissues Sufficient to Reveal Cell Bodies", "categories": ["q-bio.QM", "q-bio.NC"], "comment": null, "summary": "Existing methods in nanoscale connectomics are at present too slow to map entire mammalian brains. As an emerging approach, expansion microscopy (ExM) has enormous promise, yet it still suffers from throughput limitations. Mapping the human brain and even mapping nonhuman primate brains therefore remain distant goals. While ExM increases effective resolution linearly, it enlarges tissue volume cubically, which dramatically increases imaging time. As a rapid tomographic technique, X-ray microscopy has potential for drastically speeding up large-volume connectomics. But to the best of my knowledge, no group has so far imaged cellular features within expanded tissue using X-ray microscopy. I herein present an early-stage report featuring the first demonstration of X-ray microscopy reconstruction of cell bodies within expanded tissue. This was achieved by combining a modified enzymatic Unclearing technique with a metallic gold stain and imaging using a laboratory X-ray microscope. I emphasize that a great deal of work remains to develop \"expansion X-ray microscopy\" (ExXRM) to the point where it can be useful for connectomics since the current iteration of ExXRM only resolves cell bodies and not neurites due to extensive off-target staining. Additionally, the current method must be modified to accommodate for the challenges of synchrotron X-ray microscopy, a vastly speedier approach than laboratory X-ray microscopy. Nonetheless, achieving X-ray contrast in expanded tissues represents a significant first step towards realizing ExXRM as a connectomics imaging modality."}
{"id": "2601.13407", "pdf": "https://arxiv.org/pdf/2601.13407", "abs": "https://arxiv.org/abs/2601.13407", "authors": ["Mengman Wei", "Stanislav Listopad", "Qian Peng"], "title": "A Joint Survival Modeling and Therapy Knowledge Graph Framework to Characterize Opioid Use Disorder Trajectories", "categories": ["q-bio.QM"], "comment": null, "summary": "Motivation: Opioid use disorder (OUD) often arises after prescription opioid exposure and follows transitions among onset, remission, and relapse. Linked EHR-survey resources such as the All of Us Research Program enable stage-specific risk modeling and connection to intervention options. Results: We built a multi-stage framework to model time-to-onset, time-to-remission, and time-to-relapse after remission using All of Us EHR and survey data. For each participant we derived longitudinal predictors from clinical conditions and survey concepts, including recent (1/3/12-month) event counts, cumulative exposures, and time since last event. We fit regularized Cox models for each transition and aggregated selection frequencies and hazard ratios to identify a compact set of high-confidence predictors. Pain, mental health, and polysubstance use contributed across stages: chronic pain syndromes, tobacco/nicotine dependence, anxiety and depressive disorders, and cannabis dependence prominently predicted onset and relapse, whereas tobacco dependence during remission and other remission-coded conditions were strongly associated with transition to remission. To support therapeutic prioritization, we constructed a therapy knowledge graph integrating genetic targets, biological pathways, and published evidence to map identified risk factors to candidate treatments in recent OUD studies and clinical guidelines."}
{"id": "2601.13926", "pdf": "https://arxiv.org/pdf/2601.13926", "abs": "https://arxiv.org/abs/2601.13926", "authors": ["Peter Golenderov", "Yaroslav Matushenko", "Anastasia Tushina", "Michal Barodkin"], "title": "SCG With Your Phone: Diagnosis of Rhythmic Spectrum Disorders in Field Conditions", "categories": ["q-bio.QM", "cs.LG", "eess.SP"], "comment": null, "summary": "Aortic valve opening (AO) events are crucial for detecting frequency and rhythm disorders, especially in real-world settings where seismocardiography (SCG) signals collected via consumer smartphones are subject to noise, motion artifacts, and variability caused by device heterogeneity. In this work, we present a robust deep-learning framework for SCG segmentation and rhythm analysis using accelerometer recordings obtained with consumer smartphones. We develop an enhanced U-Net v3 architecture that integrates multi-scale convolutions, residual connections, and attention gates, enabling reliable segmentation of noisy SCG signals. A dedicated post-processing pipeline converts probability masks into precise AO timestamps, whereas a novel adaptive 3D-to-1D projection method ensures robustness to arbitrary smartphone orientation. Experimental results demonstrate that the proposed method achieves consistently high accuracy and robustness across various device types and unsupervised data-collection conditions. Our approach enables practical, low-cost, and automated cardiac-rhythm monitoring using everyday mobile devices, paving the way for scalable, field-deployable cardiovascular assessment and future multimodal diagnostic systems."}
{"id": "2601.11691", "pdf": "https://arxiv.org/pdf/2601.11691", "abs": "https://arxiv.org/abs/2601.11691", "authors": ["Jan-Philipp Redlich", "Friedrich Feuerhake", "Stefan Nikolin", "Nadine Sarah Schaadt", "Sarah Teuber-Hanselmann", "Joachim Weis", "Sabine Luttmann", "Andrea Eberle", "Christoph Buck", "Timm Intemann", "Pascal Birnstill", "Klaus Kraywinkel", "Jonas Ort", "Peter Boor", "André Homeyer"], "title": "Explainable histomorphology-based survival prediction of glioblastoma, IDH-wildtype", "categories": ["eess.IV", "cs.LG", "q-bio.QM"], "comment": null, "summary": "Glioblastoma, IDH-wildtype (GBM-IDHwt) is the most common malignant brain tumor. Histomorphology is a crucial component of the integrated diagnosis of GBM-IDHwt. Artificial intelligence (AI) methods have shown promise to extract additional prognostic information from histological whole-slide images (WSI) of hematoxylin and eosin-stained glioblastoma tissue. Here, we present an explainable AI-based method to support systematic interpretation of histomorphological features associated with survival. It combines an explainable multiple instance learning (MIL) architecture with a sparse autoencoder (SAE) to relate human-interpretable visual patterns of tissue to survival. The MIL architecture directly identifies prognosis-relevant image tiles and the SAE maps these tiles post-hoc to visual patterns. The MIL method was trained and evaluated using a new real-world dataset that comprised 720 GBM-IDHwt cases from three hospitals and four cancer registries in Germany. The SAE was trained using 1878 WSIs of glioblastoma from five independent public data collections. Despite the many factors influencing survival time, our method showed some ability to discriminate between patients living less than 180 days or more than 360 days solely based on histomorphology (AUC: 0.67; 95% CI: 0.63-0.72). Cox proportional hazards regression confirmed a significant difference in survival time between the predicted groups after adjustment for established prognostic factors (hazard ratio: 1.47; 95% CI: 1.26-1.72). Our method identified multiple interpretable visual patterns associated with survival. Three neuropathologists separately found that 21 of the 24 most strongly associated patterns could be clearly attributed to seven histomorphological categories. Necrosis and hemorrhage appeared to be associated with shorter survival while highly cellular tumor areas were associated with longer survival."}
{"id": "2601.11878", "pdf": "https://arxiv.org/pdf/2601.11878", "abs": "https://arxiv.org/abs/2601.11878", "authors": ["Xi Peng"], "title": "Accelerated MR Elastography Using Learned Neural Network Representation", "categories": ["eess.SP", "cs.CV", "cs.LG", "q-bio.QM"], "comment": null, "summary": "To develop a deep-learning method for achieving fast high-resolution MR elastography from highly undersampled data without the need of high-quality training dataset. We first framed the deep neural network representation as a nonlinear extension of the linear subspace model, then used it to represent and reconstruct MRE image repetitions from undersampled k-space data. The network weights were learned using a multi-level k-space consistent loss in a self-supervised manner. To further enhance reconstruction quality, phase-contrast specific magnitude and phase priors were incorporated, including the similarity of anatomical structures and smoothness of wave-induced harmonic displacement. Experiments were conducted using both 3D gradient-echo spiral and multi-slice spin-echo spiral MRE datasets. Compared to the conventional linear subspace-based approaches, the nonlinear network representation method was able to produce superior image reconstruction with suppressed noise and artifacts from a single in-plane spiral arm per MRE repetition (e.g., total R=10), yielding comparable stiffness estimation to the fully sampled data. This work demonstrated the feasibility of using deep network representations to model and reconstruct MRE images from highly-undersampled data, a nonlinear extension of the subspace-based approaches."}
{"id": "2601.12219", "pdf": "https://arxiv.org/pdf/2601.12219", "abs": "https://arxiv.org/abs/2601.12219", "authors": ["Yiming Ren", "Junjie Wee", "Xi Chen", "Grace Qian", "Guo-Wei Wei"], "title": "Persistent Sheaf Laplacian Analysis of Protein Stability and Solubility Changes upon Mutation", "categories": ["math.SP", "cs.LG", "q-bio.QM"], "comment": null, "summary": "Genetic mutations frequently disrupt protein structure, stability, and solubility, acting as primary drivers for a wide spectrum of diseases. Despite the critical importance of these molecular alterations, existing computational models often lack interpretability, and fail to integrate essential physicochemical interaction. To overcome these limitations, we propose SheafLapNet, a unified predictive framework grounded in the mathematical theory of Topological Deep Learning (TDL) and Persistent Sheaf Laplacian (PSL). Unlike standard Topological Data Analysis (TDA) tools such as persistent homology, which are often insensitive to heterogeneous information, PSL explicitly encodes specific physical and chemical information such as partial charges directly into the topological analysis. SheafLapNet synergizes these sheaf-theoretic invariants with advanced protein transformer features and auxiliary physical descriptors to capture intrinsic molecular interactions in a multiscale and mechanistic manner. To validate our framework, we employ rigorous benchmarks for both regression and classification tasks. For stability prediction, we utilize the comprehensive S2648 and S350 datasets. For solubility prediction, we employ the PON-Sol2 dataset, which provides annotations for increased, decreased, or neutral solubility changes. By integrating these multi-perspective features, SheafLapNet achieves state-of-the-art performance across these diverse benchmarks, demonstrating that sheaf-theoretic modeling significantly enhances both interpretability and generalizability in predicting mutation-induced structural and functional changes."}
{"id": "2601.12637", "pdf": "https://arxiv.org/pdf/2601.12637", "abs": "https://arxiv.org/abs/2601.12637", "authors": ["Long D. Nguyen", "Kelin Xia", "Binh P. Nguyen"], "title": "Topology-Aware Multiscale Mixture of Experts for Efficient Molecular Property Prediction", "categories": ["cs.LG", "cs.AI", "q-bio.QM"], "comment": null, "summary": "Many molecular properties depend on 3D geometry, where non-covalent interactions, stereochemical effects, and medium- to long-range forces are determined by spatial distances and angles that cannot be uniquely captured by a 2D bond graph. Yet most 3D molecular graph neural networks still rely on globally fixed neighborhood heuristics, typically defined by distance cutoffs and maximum neighbor limits, to define local message-passing neighborhoods, leading to rigid, data-agnostic interaction budgets. We propose Multiscale Interaction Mixture of Experts (MI-MoE) to adapt interaction modeling across geometric regimes. Our contributions are threefold: (1) we introduce a distance-cutoff expert ensemble that explicitly captures short-, mid-, and long-range interactions without committing to a single cutoff; (2) we design a topological gating encoder that routes inputs to experts using filtration-based descriptors, including persistent homology features, summarizing how connectivity evolves across radii; and (3) we show that MI-MoE is a plug-in module that consistently improves multiple strong 3D molecular backbones across diverse molecular and polymer property prediction benchmark datasets, covering both regression and classification tasks. These results highlight topology-aware multiscale routing as an effective principle for 3D molecular graph learning."}
{"id": "2601.12928", "pdf": "https://arxiv.org/pdf/2601.12928", "abs": "https://arxiv.org/abs/2601.12928", "authors": ["Yaima Paz Soto", "Silena Herold Garcia", "Ximo Gual-Arnau", "Antoni Jaume-i-Capó", "Manuel González-Hidalgo"], "title": "An efficient heuristic for geometric analysis of cell deformations", "categories": ["cs.LG", "q-bio.QM"], "comment": null, "summary": "Sickle cell disease causes erythrocytes to become sickle-shaped, affecting their movement in the bloodstream and reducing oxygen delivery. It has a high global prevalence and places a significant burden on healthcare systems, especially in resource-limited regions. Automated classification of sickle cells in blood images is crucial, allowing the specialist to reduce the effort required and avoid errors when quantifying the deformed cells and assessing the severity of a crisis. Recent studies have proposed various erythrocyte representation and classification methods. Since classification depends solely on cell shape, a suitable approach models erythrocytes as closed planar curves in shape space. This approach employs elastic distances between shapes, which are invariant under rotations, translations, scaling, and reparameterizations, ensuring consistent distance measurements regardless of the curves' position, starting point, or traversal speed. While previous methods exploiting shape space distances had achieved high accuracy, we refined the model by considering the geometric characteristics of healthy and sickled erythrocytes. Our method proposes (1) to employ a fixed parameterization based on the major axis of each cell to compute distances and (2) to align each cell with two templates using this parameterization before computing distances. Aligning shapes to templates before distance computation, a concept successfully applied in areas such as molecular dynamics, and using a fixed parameterization, instead of minimizing distances across all possible parameterizations, simplifies calculations. This strategy achieves 96.03\\% accuracy rate in both supervised classification and unsupervised clustering. Our method ensures efficient erythrocyte classification, maintaining or improving accuracy over shape space models while significantly reducing computational costs."}
{"id": "2601.14183", "pdf": "https://arxiv.org/pdf/2601.14183", "abs": "https://arxiv.org/abs/2601.14183", "authors": ["Francesco Mottes", "Qian-Ze Zhu", "Michael P. Brenner"], "title": "Gradient-based optimization of exact stochastic kinetic models", "categories": ["physics.comp-ph", "cond-mat.stat-mech", "q-bio.QM"], "comment": "9 pages, 4 figures, Supplementary Information", "summary": "Stochastic kinetic models describe systems across biology, chemistry, and physics where discrete events and small populations render deterministic approximations inadequate. Parameter inference and inverse design in these systems require optimizing over trajectories generated by the Stochastic Simulation Algorithm, but the discrete reaction events involved are inherently non-differentiable. We present an approach based on straight-through Gumbel-Softmax estimation that maintains exact stochastic simulations in the forward pass while approximating gradients through a continuous relaxation applied only in the backward pass. We demonstrate robust performance on parameter inference in stochastic gene expression, accurately recovering kinetic rates of telegraph promoter models from both moment statistics and full steady-state distributions across diverse and challenging parameter regimes. We further demonstrate the method's applicability to inverse design problems in stochastic thermodynamics, characterizing Pareto-optimal trade-offs between non-equilibrium currents and entropy production. The ability to efficiently differentiate through exact stochastic simulations provides a foundation for systematic inference and rational design across the many domains governed by continuous-time Markov dynamics."}
{"id": "2601.14205", "pdf": "https://arxiv.org/pdf/2601.14205", "abs": "https://arxiv.org/abs/2601.14205", "authors": ["J. Staforelli-Vivanco", "V. Salamanca-Levi", "R. Jofré-Cerda", "M. Rondanelli-Reyes", "I. Lamas"], "title": "Three-Dimensional Volumetric Reconstruction of Native Chilean Pollen via Lens-Free Digital In-line Holographic Microscopy", "categories": ["physics.optics", "q-bio.QM"], "comment": "5 pages, pre-print article", "summary": "This study presents a robust methodology for the 3D volumetric reconstruction of native Chileanpollen grains, specifically Gevuina avellana (hazel),Conium maculatum (hemloc) and Anthemis cotula (chamomile). Using a lens-free Digital In-line Holographic Microscopy (DLHM) system, we capture complex interference patterns that are numerically reconstructed using the Kirchhoff-Helmholtz transform. Our results demonstrate that this label-free approach provides high-fidelity morphological characterization and nanometric precision in biophysical parameter extraction, offering a scalable alternative for automated melissopalynology and environmental monitoring."}
