{"id": "2602.07648", "pdf": "https://arxiv.org/pdf/2602.07648", "abs": "https://arxiv.org/abs/2602.07648", "authors": ["Zihan Zhu", "Dipankar Biswas", "Michael Meggyesy", "Di Cao", "Gwendolyn Williams", "Richard Um", "Farzad Maroufi", "Ryan P. Lee", "Jun Hua", "Liangliang Zhang", "Jeffrey Capadona", "Horst V. Recum", "Mark G. Luciano"], "title": "Alteration of the Brains Microbiome and Neuroinflammation Associated with Ventricular Catheters", "categories": ["q-bio.GN"], "comment": "24 pages, 10 figures", "summary": "Background and Objectives: Proximal catheter obstruction is the leading cause of ventriculoperitoneal shunt failure, yet the biological triggers of peri-catheter inflammation and tissue ingrowth remain poorly defined. Evidence of bacterial ribosomal RNA in human brain tissue suggests that low-biomass microbial exposure may influence the inflammatory microenvironment surrounding implants. This study examined if microbial signal is detectable in unaltered brain tissue and if catheter implantation produces microbial shifts relevant to shunt dysfunction. Methods: Twenty-nine female mice were assigned to unaltered control (UC), trauma control (TC), plain silicone catheter (PSC), or antibiotic-impregnated catheter (AIC) groups. Brain and cecum tissues were harvested at postoperative days 7 and 28 for 16S rRNA sequencing. Microbial composition and predicted functional pathways were analyzed. A separate cohort underwent longitudinal MRI to assess edema, glial scar formation, and macrophage-associated susceptibility signal. Results: Low-level microbial signal was detected in unaltered brain tissue. Catheter implantation induced material-dependent shifts in brain-associated microbial composition. PSC was associated with enrichment of pro-inflammatory taxa, whereas AIC favored immune-regulatory taxa. Predicted short-chain fatty acid biosynthesis was highest in AIC and lowest in PSC, while predicted lipopolysaccharide biosynthesis trended higher in PSC. MRI showed similar edema resolution but higher macrophage-associated susceptibility signal in PSC animals. Conclusion: Intracranial catheter implantation produces material-dependent shifts in low-biomass brain-associated microbial signal that parallel differential neuroimmune activation. These findings suggest catheter material may shape a biologically relevant peri-catheter niche with implications for chronic gliosis and proximal shunt obstruction."}
{"id": "2602.07805", "pdf": "https://arxiv.org/pdf/2602.07805", "abs": "https://arxiv.org/abs/2602.07805", "authors": ["Parker Hicks", "Lydia E Valtadoros", "Christopher A Mancuso", "Faisal Alquadoomi", "Kayla A Johnson", "Sneha Sundar", "Arjun Krishnan"], "title": "MetaHQ: Harmonized, high-quality metadata annotations of public omics samples and studies", "categories": ["q-bio.GN"], "comment": "7 pages main text, 4 pages Supplemental Figures, 1 page Supplemental Table, 1 page Supplemental File", "summary": "Public omics databases like the Gene Expression Omnibus and the Sequence Read Archive offer substantial opportunities for data reuse to address novel biomedical questions. However, it is still difficult to find samples and studies of interest since they are described by free-text metadata and lack standardized annotations. To address this issue, multiple research groups have undertaken curation efforts to add standardized annotations to large collections of these data, but these annotations are fragmented across online resources and are stored in different formats subject to varying standardization criteria, hindering the integration of annotations across sources. We developed MetaHQ to harmonize and distribute standardized metadata for public omics samples. MetaHQ comprises a database with nearly 200,000 annotations from 13 sources and a user-friendly command-line interface (CLI) to query the database and retrieve annotations. The MetaHQ CLI is deployed as a Python Package on PyPI at https://pypi.org/project/metahq-cli that accesses the MetaHQ database available at https://doi.org/10.5281/zenodo.18462463. Project source code and documentation are available at https://github.com/krishnanlab/meta-hq."}
{"id": "2602.08280", "pdf": "https://arxiv.org/pdf/2602.08280", "abs": "https://arxiv.org/abs/2602.08280", "authors": ["Osho Rawal", "Rex Lu", "Edgar Gonzalez-Kozlova", "Sacha Gnjatic", "Zeynep H. Gümüş"], "title": "ClusterChirp: A GPU-accelerated Web Server for Natural Language-Guided Interactive Visualization and Analysis of Large Omics Data", "categories": ["q-bio.GN"], "comment": null, "summary": "Tabular datasets are commonly visualized as heatmaps, where data values are represented as color intensities in a matrix to reveal patterns and correlations. However, modern omics technologies increasingly generate matrices so large that existing visual exploration tools require downsampling or filtering, risking loss of biologically important patterns. Additional barriers arise from tools that require command-line expertise, or fragmented workflows for downstream biological interpretation. We present ClusterChirp, a web-based platform for real-time, interactive exploration of large-scale data matrices enabled by GPU-accelerated rendering and parallelized hierarchical clustering using multiple CPU cores. Built on deck.gl and multi-threaded clustering algorithms, ClusterChirp supports on-the-fly clustering, multi-metric sorting, feature search, and adjustable visualization parameters for interactive explorations. Uniquely, a natural language interface powered by a Large Language Model helps users perform complex operations and build reproducible workflows from conversational commands. Furthermore, users can select clusters to explore interactive within-cluster correlation networks in 2D or 3D, or perform functional enrichment through biological knowledge bases. Developed with iterative user feedback and adhering to FAIR4S principles, ClusterChirp empowers researchers to extract insights from high-dimensional omics data with unprecedented ease and speed. This website is freely available at clusterchirp.mssm.edu, with no login required."}
{"id": "2602.07475", "pdf": "https://arxiv.org/pdf/2602.07475", "abs": "https://arxiv.org/abs/2602.07475", "authors": ["Zhuomin Liang", "Liang Bai", "Xian Yang"], "title": "Bipartite Graph Attention-based Clustering for Large-scale scRNA-seq Data", "categories": ["cs.LG", "q-bio.GN"], "comment": null, "summary": "scRNA-seq clustering is a critical task for analyzing single-cell RNA sequencing (scRNA-seq) data, as it groups cells with similar gene expression profiles. Transformers, as powerful foundational models, have been applied to scRNA-seq clustering. Their self-attention mechanism automatically assigns higher attention weights to cells within the same cluster, enhancing the distinction between clusters. Existing methods for scRNA-seq clustering, such as graph transformer-based models, treat each cell as a token in a sequence. Their computational and space complexities are $\\mathcal{O}(n^2)$ with respect to the number of cells, limiting their applicability to large-scale scRNA-seq datasets.To address this challenge, we propose a Bipartite Graph Transformer-based clustering model (BGFormer) for scRNA-seq data. We introduce a set of learnable anchor tokens as shared reference points to represent the entire dataset. A bipartite graph attention mechanism is introduced to learn the similarity between cells and anchor tokens, bringing cells of the same class closer together in the embedding space. BGFormer achieves linear computational complexity with respect to the number of cells, making it scalable to large datasets. Experimental results on multiple large-scale scRNA-seq datasets demonstrate the effectiveness and scalability of BGFormer."}
{"id": "2602.07084", "pdf": "https://arxiv.org/pdf/2602.07084", "abs": "https://arxiv.org/abs/2602.07084", "authors": ["Wenda Wang", "Yang Zhang", "Zhewei Wei", "Wenbing Huang"], "title": "AbFlow : End-to-end Paratope-Centric Antibody Design by Interaction Enhanced Flow Matching", "categories": ["q-bio.QM", "cs.AI", "cs.CE"], "comment": null, "summary": "Antigen-antibody binding is a critical process in the immune response. Although recent progress has advanced antibody design, current methods lack a generative framework for end-to-end modeling of full-atom antibody structures and struggle to fully exploit antigen-specific geometric information for optimizing local binding interfaces and global structures. To overcome these limitations, we introduce AbFlow, a flow-matching framework that leverages optimal transport to design full-atom antibodies end-to-end. AbFlow incorporates an extended velocity field network featuring an equivariant Surface Multi-channel Encoder, which uses surface-level antigen interaction data to refine the antibody structure, particularly the CDR-H3 region. Extensive experiments in paratoep-centric antibody design, multi-CDRs and full-atom antibody design, binding affinity optimization, and complex structure prediction show that AbFlow produces superior antigen-antibody complexes, especially at the contact interface, and markedly improves the binding affinity of generated antibodies."}
{"id": "2602.07103", "pdf": "https://arxiv.org/pdf/2602.07103", "abs": "https://arxiv.org/abs/2602.07103", "authors": ["Chenglei Yu", "Chuanrui Wang", "Bangyan Liao", "Tailin Wu"], "title": "scDFM: Distributional Flow Matching Model for Robust Single-Cell Perturbation Prediction", "categories": ["q-bio.QM", "cs.AI"], "comment": "ICLR 2026 poster, 25 pages, 8 figures", "summary": "A central goal in systems biology and drug discovery is to predict the transcriptional response of cells to perturbations. This task is challenging due to the noisy and sparse nature of single-cell measurements, as well as the fact that perturbations often induce population-level shifts rather than changes in individual cells. Existing deep learning methods typically assume cell-level correspondences, limiting their ability to capture such global effects. We present scDFM, a generative framework based on conditional flow matching that models the full distribution of perturbed cells conditioned on control states. By incorporating a maximum mean discrepancy (MMD) objective, our method aligns perturbed and control populations beyond cell-level correspondences. To further improve robustness to sparsity and noise, we introduce the Perturbation-Aware Differential Transformer (PAD-Transformer), a backbone architecture that leverages gene interaction graphs and differential attention to capture context-specific expression changes. Across multiple genetic and drug perturbation benchmarks, scDFM consistently outperforms prior methods, demonstrating strong generalization in both unseen and combinatorial settings. In the combinatorial setting, it reduces mean squared error by 19.6% relative to the strongest baseline. These results highlight the importance of distribution-level generative modeling for robust in silico perturbation prediction. The code is available at https://github.com/AI4Science-WestlakeU/scDFM"}
{"id": "2602.07709", "pdf": "https://arxiv.org/pdf/2602.07709", "abs": "https://arxiv.org/abs/2602.07709", "authors": ["Mrunali Manjrekar", "Runzhong Wang", "Samuel Goldman", "Jenna C. Fromer", "Connor W. Coley"], "title": "Generative structural elucidation from mass spectra as an iterative optimization problem", "categories": ["q-bio.QM", "cs.NE"], "comment": null, "summary": "Liquid chromatography tandem mass spectrometry (LC-MS/MS) is a critical analytical technique for molecular identification across metabolomics, environmental chemistry, and chemical forensics. A variety of computational methods have emerged for structural annotation of spectral features of interest, but many of these features cannot be confidently annotated with reference structures or spectra. Here, we introduce FOAM (Formula-constrained Optimization for Annotating Metabolites), a computational workflow that poses structure elucidation from LC-MS/MS as an iterative optimization problem. FOAM couples a formula-constrained graph genetic algorithm with spectral simulation to explore candidate annotations given an experimental spectrum. We demonstrate FOAM's performance on the NIST'20 and MassSpecGym datasets as both a standalone elucidation pipeline and as a complement to existing inverse models. This work establishes iterative optimization as an effective and extensible paradigm for structural elucidation."}
{"id": "2602.08832", "pdf": "https://arxiv.org/pdf/2602.08832", "abs": "https://arxiv.org/abs/2602.08832", "authors": ["James N. Cobley"], "title": "Oxi-Shapes: Tropical geometric analysis of bounded redox proteomic state spaces", "categories": ["q-bio.QM"], "comment": "24 pages, 4 figures", "summary": "Redox proteomics generates bounded biochemical measurements that are categorically mismatched to conventional linear algebraic formalisms. This work introduces Oxi-Shapes, a tropical geometric framework for the measurement-native analysis of bounded redox proteomic data. Oxi-Shapes represents cysteine oxidation as a scalar field over a discrete lattice, enabling global and site-wise analysis without rescaling, interpolation, or kinetic assumptions. At the global level, the framework yields internal redox entropy, lattice curvature, and derived energy functionals that characterise the geometric structure of the redox proteome. At the site level, Oxi-Shapes defines a bounded change space that makes explicit hard geometric constraints on admissible redox transitions and enables a normalised signed representation of site-wise change as a fraction of available redox freedom. Applied to an ageing mouse brain dataset, Oxi-Shapes reveals that a small decrease in mean oxidation arises from a profound redistribution of site-wise redox states, with thousands of residues shifting toward the reduced absorbing boundary. These results demonstrate that categorically correct algebraic representations expose structure in proteomic data that is inaccessible to mean-centric or unbounded analyses."}
{"id": "2602.03824", "pdf": "https://arxiv.org/pdf/2602.03824", "abs": "https://arxiv.org/abs/2602.03824", "authors": ["Jiao Sun"], "title": "Deep-learning-based pan-phenomic data reveals the explosive evolution of avian visual disparity", "categories": ["q-bio.PE", "cs.CV", "q-bio.QM"], "comment": "Readers from the field of computer science may be interested in section 2.1, 2.2, 3.1, 4.1, 4.2. These sections discussed the interpretability and representation learning, especially the texture vs shape problem, highlighting our model's ability of overcoming the texture biases and capturing overall shape features. (Although they're put here to prove the biological validity of the model.)", "summary": "The evolution of biological morphology is critical for understanding the diversity of the natural world, yet traditional analyses often involve subjective biases in the selection and coding of morphological traits. This study employs deep learning techniques, utilising a ResNet34 model capable of recognising over 10,000 bird species, to explore avian morphological evolution. We extract weights from the model's final fully connected (fc) layer and investigate the semantic alignment between the high-dimensional embedding space learned by the model and biological phenotypes. The results demonstrate that the high-dimensional embedding space encodes phenotypic convergence. Subsequently, we assess the morphological disparity among various taxa and evaluate the association between morphological disparity and species richness, demonstrating that species richness is the primary driver of morphospace expansion. Moreover, the disparity-through-time analysis reveals a visual \"early burst\" after the K-Pg extinction.\n  While mainly aimed at evolutionary analysis, this study also provides insights into the interpretability of Deep Neural Networks. We demonstrate that hierarchical semantic structures (biological taxonomy) emerged in the high-dimensional embedding space despite being trained on flat labels. Furthermore, through adversarial examples, we provide evidence that our model in this task can overcome texture bias and learn holistic shape representations (body plans), challenging the prevailing view that CNNs rely primarily on local textures."}
{"id": "2602.08213", "pdf": "https://arxiv.org/pdf/2602.08213", "abs": "https://arxiv.org/abs/2602.08213", "authors": ["Haoran Liu", "Zheni Zeng", "Yukun Yan", "Yuxuan Chen", "Yunduo Xiao"], "title": "DrugR: Optimizing Molecular Drugs through LLM-based Explicit Reasoning", "categories": ["cs.LG", "cs.AI", "cs.CL", "q-bio.QM"], "comment": null, "summary": "Molecule generation and optimization is a fundamental task in chemical domain. The rapid development of intelligent tools, especially large language models (LLMs) with powerful knowledge reserves and interactive capabilities, has provided new paradigms for it. Nevertheless, the intrinsic challenge for LLMs lies in the complex implicit relationship between molecular structure and pharmacological properties and the lack of corresponding labeled data. To bridge this gap, we propose DrugR, an LLM-based method that introduces explicit, step-by-step pharmacological reasoning into the optimization process. Our approach integrates domain-specific continual pretraining, supervised fine-tuning via reverse data engineering, and self-balanced multi-granular reinforcement learning. This framework enables DrugR to effectively improve key ADMET properties while preserving the original molecule's core efficacy. Experimental results demonstrate that DrugR achieves comprehensive enhancement across multiple properties without compromising structural similarity or target binding affinity. Importantly, its explicit reasoning process provides clear, interpretable rationales for each optimization step, yielding actionable design insights and advancing toward automated, knowledge-driven scientific discovery. Our code and model checkpoints are open-sourced to foster future research."}
{"id": "2602.08751", "pdf": "https://arxiv.org/pdf/2602.08751", "abs": "https://arxiv.org/abs/2602.08751", "authors": ["Nobuyuki Ota"], "title": "Central Dogma Transformer II: An AI Microscope for Understanding Cellular Regulatory Mechanisms", "categories": ["cs.LG", "q-bio.QM"], "comment": "20 pages, 6 figures", "summary": "Current biological AI models lack interpretability -- their internal representations do not correspond to biological relationships that\n  researchers can examine. Here we present CDT-II, an \"AI microscope\" whose attention maps are directly interpretable as regulatory structure.\n  By mirroring the central dogma in its architecture, each attention mechanism corresponds to a specific biological relationship: DNA\n  self-attention for genomic relationships, RNA self-attention for gene co-regulation, and DNA-to-RNA cross-attention for transcriptional\n  control. Using only genomic embeddings and raw per-cell expression, CDT-II enables experimental biologists to observe regulatory networks in\n  their own data. Applied to K562 CRISPRi data, CDT-II predicts perturbation effects (per-gene mean $r = 0.84$) and recovers the GFI1B\n  regulatory network without supervision (6.6-fold enrichment, $P = 3.5 \\times 10^{-17}$). Two distinct attention mechanisms converge on an RNA\n  processing module ($P = 1 \\times 10^{-16}$). CDT-II establishes mechanism-oriented AI as an alternative to task-oriented approaches, revealing\n  regulatory structure rather than merely optimizing predictions."}
