{"id": "2602.13346", "pdf": "https://arxiv.org/pdf/2602.13346", "abs": "https://arxiv.org/abs/2602.13346", "authors": ["Zhen Wang", "Yiming Gao", "Jieyuan Liu", "Enze Ma", "Jefferson Chen", "Mark Antkowiak", "Mengzhou Hu", "JungHo Kong", "Dexter Pratt", "Zhiting Hu", "Wei Wang", "Trey Ideker", "Eric P. Xing"], "title": "CellMaster: Collaborative Cell Type Annotation in Single-Cell Analysis", "categories": ["q-bio.GN", "cs.AI", "cs.CV"], "comment": "Preprint", "summary": "Single-cell RNA-seq (scRNA-seq) enables atlas-scale profiling of complex tissues, revealing rare lineages and transient states. Yet, assigning biologically valid cell identities remains a bottleneck because markers are tissue- and state-dependent, and novel states lack references. We present CellMaster, an AI agent that mimics expert practice for zero-shot cell-type annotation. Unlike existing automated tools, CellMaster leverages LLM-encoded knowledge (e.g., GPT-4o) to perform on-the-fly annotation with interpretable rationales, without pre-training or fixed marker databases. Across 9 datasets spanning 8 tissues, CellMaster improved accuracy by 7.1% over best-performing baselines (including CellTypist and scTab) in automatic mode. With human-in-the-loop refinement, this advantage increased to 18.6%, with a 22.1% gain on subtype populations. The system demonstrates particular strength in rare and novel cell states where baselines often fail. Source code and the web application are available at \\href{https://github.com/AnonymousGym/CellMaster}{https://github.com/AnonymousGym/CellMaster}."}
{"id": "2602.13419", "pdf": "https://arxiv.org/pdf/2602.13419", "abs": "https://arxiv.org/abs/2602.13419", "authors": ["Shreyas Vinaya Sathyanarayana", "Shah Rahil Kirankumar", "Sharanabasava D. Hiremath", "Bharath Ramsundar"], "title": "Protect$^*$: Steerable Retrosynthesis through Neuro-Symbolic State Encoding", "categories": ["q-bio.QM", "cs.AI", "cs.CL", "cs.LG", "q-bio.BM"], "comment": null, "summary": "Large Language Models (LLMs) have shown remarkable potential in scientific domains like retrosynthesis; yet, they often lack the fine-grained control necessary to navigate complex problem spaces without error. A critical challenge is directing an LLM to avoid specific, chemically sensitive sites on a molecule - a task where unconstrained generation can lead to invalid or undesirable synthetic pathways. In this work, we introduce Protect$^*$, a neuro-symbolic framework that grounds the generative capabilities of Large Language Models (LLMs) in rigorous chemical logic. Our approach combines automated rule-based reasoning - using a comprehensive database of 55+ SMARTS patterns and 40+ characterized protecting groups - with the generative intuition of neural models. The system operates via a hybrid architecture: an ``automatic mode'' where symbolic logic deterministically identifies and guards reactive sites, and a ``human-in-the-loop mode'' that integrates expert strategic constraints. Through ``active state tracking,'' we inject hard symbolic constraints into the neural inference process via a dedicated protection state linked to canonical atom maps. We demonstrate this neuro-symbolic approach through case studies on complex natural products, including the discovery of a novel synthetic pathway for Erythromycin B, showing that grounding neural generation in symbolic logic enables reliable, expert-level autonomy."}
{"id": "2602.14828", "pdf": "https://arxiv.org/pdf/2602.14828", "abs": "https://arxiv.org/abs/2602.14828", "authors": ["Ana F. Rodrigues", "Lucas Ferraz", "Laura Balbi", "Pedro Giesteira Cotovio", "Catia Pesquita"], "title": "Exploring the limits of pre-trained embeddings in machine-guided protein design: a case study on predicting AAV vector viability", "categories": ["q-bio.QM", "cs.LG"], "comment": null, "summary": "Effective representations of protein sequences are widely recognized as a cornerstone of machine learning-based protein design. Yet, protein bioengineering poses unique challenges for sequence representation, as experimental datasets typically feature few mutations, which are either sparsely distributed across the entire sequence or densely concentrated within localized regions. This limits the ability of sequence-level representations to extract functionally meaningful signals. In addition, comprehensive comparative studies remain scarce, despite their crucial role in clarifying which representations best encode relevant information and ultimately support superior predictive performance. In this study, we systematically evaluate multiple ProtBERT and ESM2 embedding variants as sequence representations, using the adeno-associated virus capsid as a case study and prototypical example of bioengineering, where functional optimization is targeted through highly localized sequence variation within an otherwise large protein. Our results reveal that, prior to fine-tuning, amino acid-level embeddings outperform sequence-level representations in supervised predictive tasks, whereas the latter tend to be more effective in unsupervised settings. However, optimal performance is only achieved when embeddings are fine-tuned with task-specific labels, with sequence-level representations providing the best performance. Moreover, our findings indicate that the extent of sequence variation required to produce notable shifts in sequence representations exceeds what is typically explored in bioengineering studies, showing the need for fine-tuning in datasets characterized by sparse or highly localized mutations."}
{"id": "2602.13398", "pdf": "https://arxiv.org/pdf/2602.13398", "abs": "https://arxiv.org/abs/2602.13398", "authors": ["Daniel Emerson", "Nora Gaby-Biegel", "Purva Joshi", "Yoed Rabin", "Rebecca D. Sandlin", "Levent Burak Kara"], "title": "Accelerated Discovery of Cryoprotectant Cocktails via Multi-Objective Bayesian Optimization", "categories": ["cs.LG", "q-bio.QM"], "comment": null, "summary": "Designing cryoprotectant agent (CPA) cocktails for vitrification is challenging because formulations must be concentrated enough to suppress ice formation yet non-toxic enough to preserve cell viability. This tradeoff creates a large, multi-objective design space in which traditional discovery is slow, often relying on expert intuition or exhaustive experimentation. We present a data-efficient framework that accelerates CPA cocktail design by combining high-throughput screening with an active-learning loop based on multi-objective Bayesian optimization. From an initial set of measured cocktails, we train probabilistic surrogate models to predict concentration and viability and quantify uncertainty across candidate formulations. We then iteratively select the next experiments by prioritizing cocktails expected to improve the Pareto front, maximizing expected Pareto improvement under uncertainty, and update the models as new assay results are collected. Wet-lab validation shows that our approach efficiently discovers cocktails that simultaneously achieve high CPA concentrations and high post-exposure viability. Relative to a naive strategy and a strong baseline, our method improves dominated hypervolume by 9.5\\% and 4.5\\%, respectively, while reducing the number of experiments needed to reach high-quality solutions. In complementary synthetic studies, it recovers a comparably strong set of Pareto-optimal solutions using only 30\\% of the evaluations required by the prior state-of-the-art multi-objective approach, which amounts to saving approximately 10 weeks of experimental time. Because the framework assumes only a suitable assay and defined formulation space, it can be adapted to different CPA libraries, objective definitions, and cell lines to accelerate cryopreservation development."}
{"id": "2602.14328", "pdf": "https://arxiv.org/pdf/2602.14328", "abs": "https://arxiv.org/abs/2602.14328", "authors": ["Slavica Jonic"], "title": "Conformational landscapes in cryo-ET data based on MD simulations", "categories": ["q-bio.BM", "q-bio.QM"], "comment": null, "summary": "Cryo-electron tomography (cryo-ET) provides a unique window into molecular organization in cellular environments (in situ). However, the interpretation of molecular structural information is complicated by several intrinsic properties of cryo-ET data, such as noise, missing wedge, and continuous conformational variability of the molecules. Additionally, in crowded in situ environments, the number of particles extracted is sometimes small and precludes extensive classification into discrete states. These challenges shift the emphasis from high-resolution structure determination toward validation and interpretation of low-resolution density maps, and analysis of conformational flexibility. Molecular Dynamics (MD) simulations are particularly well suited to this task, as they provide a physically grounded way to explore continuous conformation transitions consistent with both experimental data and molecular energetics. This review focuses on the roles of MD simulations in cryo-ET, emphasizing their use in emerging methods for conformational landscape determination and their contribution to gain new biological insight."}
{"id": "2602.14616", "pdf": "https://arxiv.org/pdf/2602.14616", "abs": "https://arxiv.org/abs/2602.14616", "authors": ["Richard D. Paul", "Anton Stratmann", "Johann F. Jadebeck", "Martin Beyß", "Hanno Scharr", "David Rügamer", "Katharina Nöh"], "title": "Higher-Order Hit-&-Run Samplers for Linearly Constrained Densities", "categories": ["stat.CO", "q-bio.QM", "stat.AP"], "comment": null, "summary": "Markov chain Monte Carlo (MCMC) sampling of densities restricted to linearly constrained domains is an important task arising in Bayesian treatment of inverse problems in the natural sciences. While efficient algorithms for uniform polytope sampling exist, much less work has dealt with more complex constrained densities. In particular, gradient information as used in unconstrained MCMC is not necessarily helpful in the constrained case, where the gradient may push the proposal's density out of the polytope. In this work, we propose a novel constrained sampling algorithm, which combines strengths of higher-order information, like the target's log-density's gradients and curvature, with the Hit-&-Run proposal, a simple mechanism which guarantees the generation of feasible proposals, fulfilling the linear constraints. Our extensive experiments demonstrate improved sampling efficiency on complex constrained densities over various constrained and unconstrained samplers."}
