{"id": "2601.20869", "pdf": "https://arxiv.org/pdf/2601.20869", "abs": "https://arxiv.org/abs/2601.20869", "authors": ["M. A. Rasel", "Sameem Abdul Kareem", "Unaizah Obaidellah"], "title": "Integrating Color Histogram Analysis and Convolutional Neural Network for Skin Lesion Classification", "categories": ["q-bio.QM", "cs.AI", "eess.IV"], "comment": null, "summary": "The color of skin lesions is an important diagnostic feature for identifying malignant melanoma and other skin diseases. Typical colors associated with melanocytic lesions include tan, brown, black, red, white, and blue gray. This study introduces a novel feature: the number of colors present in a lesion, which can indicate the severity of disease and help distinguish melanomas from benign lesions. We propose a color histogram analysis method to examine lesion pixel values from three publicly available datasets: PH2, ISIC2016, and Med Node. The PH2 dataset contains ground truth annotations of lesion colors, while ISIC2016 and Med Node do not; our algorithm estimates the ground truth using color histogram analysis based on PH2. We then design and train a 19 layer Convolutional Neural Network (CNN) with residual skip connections to classify lesions into three categories based on the number of colors present. DeepDream visualization is used to interpret features learned by the network, and multiple CNN configurations are tested. The best model achieves a weighted F1 score of 75 percent. LIME is applied to identify important regions influencing model decisions. The results show that the number of colors in a lesion is a significant feature for describing skin conditions, and the proposed CNN with three skip connections demonstrates strong potential for clinical diagnostic support."}
{"id": "2601.20878", "pdf": "https://arxiv.org/pdf/2601.20878", "abs": "https://arxiv.org/abs/2601.20878", "authors": ["Xingjian Zhang", "Claire Leclech", "Louison Blivet-Bailly", "Abdul I. Barakat", "Elsa D. Angelini"], "title": "Log Focal Frequency Loss for Bioimage Restoration", "categories": ["q-bio.QM"], "comment": "This paper has been accepted to IEEE ISBI 2026", "summary": "Image restoration of biological structures in microscopy poses unique challenges for preserving fine textures and sharp edges. While recent GAN-based image restoration formulations have introduced frequency-domain losses for natural images, microscopy images pose distinct challenges with large dynamic ranges and sparse but critical structures with spatially-variable contrast. Inspired by the principle of logarithmic perception in human vision, we propose a log focal frequency loss (LFFL) tailored for microscopy restoration. This loss combines adaptive spectral weighting from log-space differences with log-dampened error measurement, ensuring balanced reconstruction across all frequency bands while preserving both structural coherence and fine details. We tested our GAN-based framework on two use-cases with real ground-truths: deblurring of fluorescence images of cell nuclei on microgroove substrates and denoising of zebrafish embryo images from the FMD dataset. Compared to training with only spatial-domain losses and with existing frequency-domain losses, our method achieves improvements across several quality metrics. Code is available at github.com/xjzhaang/log-focal-frequency-loss."}
{"id": "2601.20891", "pdf": "https://arxiv.org/pdf/2601.20891", "abs": "https://arxiv.org/abs/2601.20891", "authors": ["Hajung Kim", "Eunha Lee", "Sohyun Chung", "Jueon Park", "Seungheun Baek", "Jaewoo Kang"], "title": "ATTNSOM: Learning Cross-Isoform Attention for Cytochrome P450 Site-of-Metabolism", "categories": ["q-bio.QM", "cs.LG"], "comment": "14 pages", "summary": "Identifying metabolic sites where cytochrome P450 enzymes metabolize small-molecule drugs is essential for drug discovery. Although existing computational approaches have been proposed for site-of-metabolism prediction, they typically ignore cytochrome P450 isoform identity or model isoforms independently, thereby failing to fully capture inherent cross-isoform metabolic patterns. In addition, prior evaluations often rely on top-k metrics, where false positive atoms may be included among the top predictions, underscoring the need for complementary metrics that more directly assess binary atom-level discrimination under severe class imbalance. We propose ATTNSOM, an atom-level site-of-metabolism prediction framework that integrates intrinsic molecular reactivity with cross-isoform relationships. The model combines a shared graph encoder, molecule-conditioned atom representations, and a cross-attention mechanism to capture correlated metabolic patterns across cytochrome P450 isoforms. The model is evaluated on two benchmark datasets annotated with site-of-metabolism labels at atom resolution. Across these benchmarks, the model achieves consistently strong top-k performance across multiple cytochrome P450 isoforms. Relative to ablated variants, the model yields higher Matthews correlation coefficient, indicating improved discrimination of true metabolic sites. These results support the importance of explicitly modeling cross-isoform relationships for site-of-metabolism prediction. The code and datasets are available at https://github.com/dmis-lab/ATTNSOM."}
{"id": "2601.22128", "pdf": "https://arxiv.org/pdf/2601.22128", "abs": "https://arxiv.org/abs/2601.22128", "authors": ["Irsyad Adam", "Zekai Chen", "David Laprade", "Shaun Porwal", "David Laub", "Erik Reinertsen", "Arda Pekis", "Kevin Brown"], "title": "The Patient is not a Moving Document: A World Model Training Paradigm for Longitudinal EHR", "categories": ["cs.AI", "cs.CE", "q-bio.QM"], "comment": null, "summary": "Large language models (LLMs) trained with next-word-prediction have achieved success as clinical foundation models. Representations from these language backbones yield strong linear probe performance across biomedical tasks, suggesting that patient semantics emerge from next-token prediction at scale. However, this paradigm treats patients as a document to be summarized rather than a dynamical system to be simulated; a patient's trajectory emerges from their state evolving under interventions and time, requiring models that simulate dynamics rather than predict tokens. To address this, we introduce SMB-Structure, a world model for structured EHR that grounds a joint-embedding prediction architecture (JEPA) with next-token prediction (SFT). SFT grounds our model to reconstruct future patient states in token space, while JEPA predicts those futures in latent space from the initial patient representation alone, forcing trajectory dynamics to be encoded before the next state is observed. We validate across two large-scale cohorts: Memorial Sloan Kettering (23,319 oncology patients; 323,000+ patient-years) and INSPECT (19,402 pulmonary embolism patients). Using a linear probe evaluated at multiple points along the disease trajectory, we demonstrate that our training paradigm learns embeddings that capture disease dynamics not recoverable by autoregressive baselines, enabling SMB-Structure to achieve competitive performance on complex tasks characterized by high patient heterogeneity. Model weights are available at https://huggingface.co/standardmodelbio/SMB-v1-1.7B-Structure."}
