{"id": "2601.02446", "pdf": "https://arxiv.org/pdf/2601.02446", "abs": "https://arxiv.org/abs/2601.02446", "authors": ["Ziyi Cui", "Sarah Marzen"], "title": "Apparent Selection Pressure for Channel Capacity in Bacterial Chemotactic Sensors", "categories": ["q-bio.QM"], "comment": "10 pages, 7 figures, 4 tables", "summary": "Bacterial chemotactic sensing converts noisy chemical signals into running and tumbling. We analyze the static sensing limits of mixed Tar/Tsr chemoreceptor clusters in individual Escherichia coli cells using a heterogeneous Monod-Wyman-Changeux (MWC) model. By sweeping a seven-dimensional parameter space, we compute three sensing performance metrics-channel capacity, effective Hill coefficient, and dynamic range. Across E. coli-like parameter regimes, we consistently observe pronounced local maxima of channel capacity, whereas neither the effective Hill coefficient nor the dynamic range exhibit comparable optimization. The capacity-achieving input distribution is bimodal, which implies that individual cells maximize information by sampling both low- and high concentration regimes. Together, these results suggest that, at the individual-cell level, channel capacity may be selected for in E. coli receptor clusters."}
{"id": "2601.02787", "pdf": "https://arxiv.org/pdf/2601.02787", "abs": "https://arxiv.org/abs/2601.02787", "authors": ["Tomislav Plesa", "Julien Clinton Sprott"], "title": "Simple chemical systems with chaos", "categories": ["nlin.CD", "q-bio.MN"], "comment": null, "summary": "A number of simple chaotic three-dimensional dynamical systems (DSs) with quadratic polynomials on the right-hand sides are reported in the literature, containing exactly 5 or 6 monomials of which only 1 or 2 are quadratic. However, none of these simple systems are chemical dynamical systems (CDSs) - a special subset of polynomial DSs that model the dynamics of mass-action chemical reaction networks (CRNs). In particular, only a small number of three-dimensional quadratic CDSs with chaos are reported, all of which have at least 9 monomials and at least 3 quadratics, with CRNs containing at least 7 reactions and at least 3 quadratic ones. To bridge this gap, in this paper we prove some basic properties of chaotic CDSs, including that those in three dimensions have at least 6 monomials, at least one of which is negative and quadratic. We then use these results to computationally find 20 chaotic three-dimensional CDSs with 6 monomials and as few as 4 quadratics, or 7 monomials and as few as 2 quadratics. At the CRN level, some of these systems have 4 reactions of which only 3 are quadratic, or 5 reactions with only 2 being quadratic. These results quantify structural complexity of chaotic CDSs, and indicate that they are ubiquitous."}
{"id": "2601.02530", "pdf": "https://arxiv.org/pdf/2601.02530", "abs": "https://arxiv.org/abs/2601.02530", "authors": ["Zhuoyang Jiang", "Yaosen Min", "Peiran Jin", "Lei Chen"], "title": "Multi-scale Graph Autoregressive Modeling: Molecular Property Prediction via Next Token Prediction", "categories": ["cs.LG", "q-bio.QM"], "comment": null, "summary": "We present Connection-Aware Motif Sequencing (CamS), a graph-to-sequence representation that enables decoder-only Transformers to learn molecular graphs via standard next-token prediction (NTP). For molecular property prediction, SMILES-based NTP scales well but lacks explicit topology, whereas graph-native masked modeling captures connectivity but risks disrupting the pivotal chemical details (e.g., activity cliffs). CamS bridges this gap by serializing molecular graphs into structure-rich causal sequences. CamS first mines data-driven connection-aware motifs. It then serializes motifs via scaffold-rooted breadth-first search (BFS) to establish a stable core-to-periphery order. Crucially, CamS enables hierarchical modeling by concatenating sequences from fine to coarse motif scales, allowing the model to condition global scaffolds on dense, uncorrupted local structural evidence. We instantiate CamS-LLaMA by pre-training a vanilla LLaMA backbone on CamS sequences. It achieves state-of-the-art performance on MoleculeNet and the activity-cliff benchmark MoleculeACE, outperforming both SMILES-based language models and strong graph baselines. Interpretability analysis confirms that our multi-scale causal serialization effectively drives attention toward cliff-determining differences."}
