{"id": "2601.15886", "pdf": "https://arxiv.org/pdf/2601.15886", "abs": "https://arxiv.org/abs/2601.15886", "authors": ["Yang Shen", "Keming Shi", "Chen Yu", "Rui Zhang", "Yanni Sun", "Jiayu Shang"], "title": "PhageMind: Generalized Strain-level Phage Host Range Prediction via Meta-learning", "categories": ["q-bio.GN"], "comment": "15 pgaes, 9 figures", "summary": "Bacteriophages (phages) are key regulators of bacterial populations and hold great promise for applications such as phage therapy, biocontrol, and industrial fermentation. The success of these applications depends on accurately determining phage host range, which is often specific at the strain level rather than the species level. However, existing computational approaches face major limitations: many rely on genus-specific features that do not generalize across taxa, while others require large amounts of training data that are unavailable for most bacterial lineages. These challenges create a critical need for methods that can accurately predict strain-level phage-host interactions across diverse bacterial genera, particularly under data-limited conditions. We present PhageMind, a learning framework designed to address this challenge by enabling efficient transfer of knowledge across bacterial genera. PhageMind is trained to identify shared principles of phage-bacterium interactions from well-studied systems and to rapidly adapt these principles to new genera using only a small number of known interactions. To reflect the biological basis of infection, we represent phage-host relationships using a knowledge graph that explicitly incorporates phage tail fiber proteins and bacterial O-antigen biosynthesis gene clusters, and we use this representation to guide interaction prediction. Across four bacterial genera (Escherichia, Klebsiella, Vibrio, and Alteromonas), PhageMind achieves high prediction accuracy and shows strong adaptability to new lineages. In particular, in leave-one-genus-out evaluations, the model maintains robust performance when only limited reference data are available, demonstrating its potential as a scalable and practical tool for studying phage-host interactions across the global phageome."}
{"id": "2601.15504", "pdf": "https://arxiv.org/pdf/2601.15504", "abs": "https://arxiv.org/abs/2601.15504", "authors": ["Xianghao Zhan", "Jingyu Xu", "Yuanning Zheng", "Zinaida Good", "Olivier Gevaert"], "title": "SAGE-FM: A lightweight and interpretable spatial transcriptomics foundation model", "categories": ["cs.LG", "q-bio.GN", "q-bio.QM"], "comment": "26 pages, 5 figures", "summary": "Spatial transcriptomics enables spatial gene expression profiling, motivating computational models that capture spatially conditioned regulatory relationships. We introduce SAGE-FM, a lightweight spatial transcriptomics foundation model based on graph convolutional networks (GCNs) trained with a masked central spot prediction objective. Trained on 416 human Visium samples spanning 15 organs, SAGE-FM learns spatially coherent embeddings that robustly recover masked genes, with 91% of masked genes showing significant correlations (p < 0.05). The embeddings generated by SAGE-FM outperform MOFA and existing spatial transcriptomics methods in unsupervised clustering and preservation of biological heterogeneity. SAGE-FM generalizes to downstream tasks, enabling 81% accuracy in pathologist-defined spot annotation in oropharyngeal squamous cell carcinoma and improving glioblastoma subtype prediction relative to MOFA. In silico perturbation experiments further demonstrate that the model captures directional ligand-receptor and upstream-downstream regulatory effects consistent with ground truth. These results demonstrate that simple, parameter-efficient GCNs can serve as biologically interpretable and spatially aware foundation models for large-scale spatial transcriptomics."}
{"id": "2601.16151", "pdf": "https://arxiv.org/pdf/2601.16151", "abs": "https://arxiv.org/abs/2601.16151", "authors": ["Anne Schwager", "Jonas Neipel", "Yahor Savich", "Douglas Diehl", "Frank Jülicher", "Anthony A. Hyman", "Stephan W. Grill"], "title": "In vitro binding energies capture Klf4 occupancy across the human genome", "categories": ["physics.bio-ph", "q-bio.BM", "q-bio.GN"], "comment": "A.S., J.N., and Y.S. contributed equally to this work", "summary": "Transcription factors (TFs) regulate gene expression by binding to specific genomic loci determined by DNA sequence. Their sequence specificity is commonly summarized by a consensus binding motif. However, eukaryotic genomes contain billions of low-affinity DNA sequences to which TFs associate with a sequence-dependent binding energy. We currently lack insight into how the genomic sequence defines this spectrum of binding energies and the resulting pattern of TF localization. Here, we set out to obtain a quantitative understanding of sequence-dependent TF binding to both motif and non-motif sequences. We achieve this by first pursuing accurate measurements of physical binding energies of the human TF Klf4 to a library of short DNA sequences in a fluorescence-anisotropy-based bulk competitive binding assay. Second, we show that the highly non-linear sequence dependence of Klf4 binding energies can be captured by combining a linear model of binding energies with an Ising model of the coupled recognition of nucleotides by a TF. We find that this statistical mechanics model parametrized by our in vitro measurements captures Klf4 binding patterns on individual long DNA molecules stretched in the optical tweezer, and is predictive for Klf4 occupancy across the entire human genome without additional fit parameters."}
{"id": "2601.15326", "pdf": "https://arxiv.org/pdf/2601.15326", "abs": "https://arxiv.org/abs/2601.15326", "authors": ["Deyun Zhang", "Jun Li", "Shijia Geng", "Yue Wang", "Shijie Chen", "Sumei Fan", "Qinghao Zha", "Shenda Hong"], "title": "ECGomics: An Open Platform for AI-ECG Digital Biomarker Discovery", "categories": ["q-bio.QM", "cs.AI"], "comment": null, "summary": "Background: Conventional electrocardiogram (ECG) analysis faces a persistent dichotomy: expert-driven features ensure interpretability but lack sensitivity to latent patterns, while deep learning offers high accuracy but functions as a black box with high data dependency. We introduce ECGomics, a systematic paradigm and open-source platform for the multidimensional deconstruction of cardiac signals into digital biomarker. Methods: Inspired by the taxonomic rigor of genomics, ECGomics deconstructs cardiac activity across four dimensions: Structural, Intensity, Functional, and Comparative. This taxonomy synergizes expert-defined morphological rules with data-driven latent representations, effectively bridging the gap between handcrafted features and deep learning embeddings. Results: We operationalized this framework into a scalable ecosystem consisting of a web-based research platform and a mobile-integrated solution (https://github.com/PKUDigitalHealth/ECGomics). The web platform facilitates high-throughput analysis via precision parameter configuration, high-fidelity data ingestion, and 12-lead visualization, allowing for the systematic extraction of biomarkers across the four ECGomics dimensions. Complementarily, the mobile interface, integrated with portable sensors and a cloud-based engine, enables real-time signal acquisition and near-instantaneous delivery of structured diagnostic reports. This dual-interface architecture successfully transitions ECGomics from theoretical discovery to decentralized, real-world health management, ensuring professional-grade monitoring in diverse clinical and home-based settings. Conclusion: ECGomics harmonizes diagnostic precision, interpretability, and data efficiency. By providing a deployable software ecosystem, this paradigm establishes a robust foundation for digital biomarker discovery and personalized cardiovascular medicine."}
{"id": "2601.15362", "pdf": "https://arxiv.org/pdf/2601.15362", "abs": "https://arxiv.org/abs/2601.15362", "authors": ["Yogesh Kumar KC", "Arshed Nabeel", "Srikanth Iyer", "Vishwesha Guttal"], "title": "Flocking by stopping: a novel mechanism of emergent order in collective movement", "categories": ["q-bio.QM"], "comment": null, "summary": "Collective movement is observed widely in nature, where individuals interact locally to produce globally ordered, coherent motion. In typical models of collective motion, each individual takes the average direction of multiple neighbors, resulting in ordered movement. In small flocks, noise induced order can also emerge with individuals copying only a randomly chosen single neighbor at a time. We propose a new model of collective movement, inspired by how real animals move, where individuals can move in two directions or remain stationary. We demonstrate that when individuals interact with a single neighbor through a novel form of halting interaction -- where an individual may stop upon encountering an oppositely moving neighbor rather than instantly aligning -- persistent collective order can emerge even in large populations. This represents a fundamentally different mechanism from conventional averaging-based or noise-induced ordering. Using deterministic and stochastic mean-field approximations, we characterize the conditions under which such ``flocking by stopping'' behavior can occur, and confirm the mean-field predictions using individual-based simulations. Our results highlight how incorporating a stopped state and halting interactions can generate new routes to order in collective movement."}
{"id": "2601.15333", "pdf": "https://arxiv.org/pdf/2601.15333", "abs": "https://arxiv.org/abs/2601.15333", "authors": ["Xuanning Hu", "Anchen Li", "Qianli Xing", "Jinglong Ji", "Hao Tuo", "Bo Yang"], "title": "Empowering LLMs for Structure-Based Drug Design via Exploration-Augmented Latent Inference", "categories": ["cs.LG", "cs.AI", "q-bio.QM"], "comment": null, "summary": "Large Language Models (LLMs) possess strong representation and reasoning capabilities, but their application to structure-based drug design (SBDD) is limited by insufficient understanding of protein structures and unpredictable molecular generation. To address these challenges, we propose Exploration-Augmented Latent Inference for LLMs (ELILLM), a framework that reinterprets the LLM generation process as an encoding, latent space exploration, and decoding workflow. ELILLM explicitly explores portions of the design problem beyond the model's current knowledge while using a decoding module to handle familiar regions, generating chemically valid and synthetically reasonable molecules. In our implementation, Bayesian optimization guides the systematic exploration of latent embeddings, and a position-aware surrogate model efficiently predicts binding affinity distributions to inform the search. Knowledge-guided decoding further reduces randomness and effectively imposes chemical validity constraints. We demonstrate ELILLM on the CrossDocked2020 benchmark, showing strong controlled exploration and high binding affinity scores compared with seven baseline methods. These results demonstrate that ELILLM can effectively enhance LLMs capabilities for SBDD."}
{"id": "2601.15502", "pdf": "https://arxiv.org/pdf/2601.15502", "abs": "https://arxiv.org/abs/2601.15502", "authors": ["T. Troncoso Enríquez", "J. Staforelli-Vivanco", "I. Bordeu", "M. González-Ortiz"], "title": "Optical Manipulation of Erythrocytes via Evanescent Waves: Assessing Glucose-Induced Mobility Variations", "categories": ["physics.optics", "physics.bio-ph", "q-bio.CB", "q-bio.QM"], "comment": "5 pages, pre-print", "summary": "This study investigates the dynamics of red blood cells (RBCs) under the influence of evanescent waves generated by total internal reflection (TIR). Using a 1064 nm laser system and a dual-chamber prism setup, we quantified the mobility of erythrocytes in different glucose environments. Our methodology integrates automated tracking via TrackMate\\c{opyright} to analyze over 60 trajectory sets. The results reveal a significant decrease in mean velocity, from 11.8 μm/s in 5 mM glucose to 8.8 μm/s in 50 mM glucose (p = 0.019). These findings suggest that evanescent waves can serve as a non-invasive tool to probe the mechanical properties of cell membranes influenced by biochemical changes."}
{"id": "2601.15504", "pdf": "https://arxiv.org/pdf/2601.15504", "abs": "https://arxiv.org/abs/2601.15504", "authors": ["Xianghao Zhan", "Jingyu Xu", "Yuanning Zheng", "Zinaida Good", "Olivier Gevaert"], "title": "SAGE-FM: A lightweight and interpretable spatial transcriptomics foundation model", "categories": ["cs.LG", "q-bio.GN", "q-bio.QM"], "comment": "26 pages, 5 figures", "summary": "Spatial transcriptomics enables spatial gene expression profiling, motivating computational models that capture spatially conditioned regulatory relationships. We introduce SAGE-FM, a lightweight spatial transcriptomics foundation model based on graph convolutional networks (GCNs) trained with a masked central spot prediction objective. Trained on 416 human Visium samples spanning 15 organs, SAGE-FM learns spatially coherent embeddings that robustly recover masked genes, with 91% of masked genes showing significant correlations (p < 0.05). The embeddings generated by SAGE-FM outperform MOFA and existing spatial transcriptomics methods in unsupervised clustering and preservation of biological heterogeneity. SAGE-FM generalizes to downstream tasks, enabling 81% accuracy in pathologist-defined spot annotation in oropharyngeal squamous cell carcinoma and improving glioblastoma subtype prediction relative to MOFA. In silico perturbation experiments further demonstrate that the model captures directional ligand-receptor and upstream-downstream regulatory effects consistent with ground truth. These results demonstrate that simple, parameter-efficient GCNs can serve as biologically interpretable and spatially aware foundation models for large-scale spatial transcriptomics."}
{"id": "2601.15530", "pdf": "https://arxiv.org/pdf/2601.15530", "abs": "https://arxiv.org/abs/2601.15530", "authors": ["Megan A. Witherow", "Michael L. Evans", "Ahmed Temtam", "Hamid Okhravi", "Khan M. Iftekharuddin"], "title": "Machine learning-enhanced non-amnestic Alzheimer's disease diagnosis from MRI and clinical features", "categories": ["cs.LG", "q-bio.NC", "q-bio.QM"], "comment": "Preprint of a manuscript submitted to Brain", "summary": "Alzheimer's disease (AD), defined as an abnormal buildup of amyloid plaques and tau tangles in the brain can be diagnosed with high accuracy based on protein biomarkers via PET or CSF analysis. However, due to the invasive nature of biomarker collection, most AD diagnoses are made in memory clinics using cognitive tests and evaluation of hippocampal atrophy based on MRI. While clinical assessment and hippocampal volume show high diagnostic accuracy for amnestic or typical AD (tAD), a substantial subgroup of AD patients with atypical presentation (atAD) are routinely misdiagnosed. To improve diagnosis of atAD patients, we propose a machine learning approach to distinguish between atAD and non-AD cognitive impairment using clinical testing battery and MRI data collected as standard-of-care. We develop and evaluate our approach using 1410 subjects across four groups (273 tAD, 184 atAD, 235 non-AD, and 685 cognitively normal) collected from one private data set and two public data sets from the National Alzheimer's Coordinating Center (NACC) and the Alzheimer's Disease Neuroimaging Initiative (ADNI). We perform multiple atAD vs. non-AD classification experiments using clinical features and hippocampal volume as well as a comprehensive set of MRI features from across the brain. The best performance is achieved by incorporating additional important MRI features, which outperforms using hippocampal volume alone. Furthermore, we use the Boruta statistical approach to identify and visualize significant brain regions distinguishing between diagnostic groups. Our ML approach improves the percentage of correctly diagnosed atAD cases (the recall) from 52% to 69% for NACC and from 34% to 77% for ADNI, while achieving high precision. The proposed approach has important implications for improving diagnostic accuracy for non-amnestic atAD in clinical settings using only clinical testing battery and MRI."}
{"id": "2601.15952", "pdf": "https://arxiv.org/pdf/2601.15952", "abs": "https://arxiv.org/abs/2601.15952", "authors": ["Philip Groult", "Julia D. Sistermanns", "Ellen Emken", "Oliver Hayden", "Wolfgang Utschick"], "title": "Reconstructing Patched or Partial Holograms to allow for Whole Slide Imaging with a Self-Referencing Holographic Microscope", "categories": ["eess.SP", "q-bio.QM"], "comment": "\\c{opyright} 2026 IEEE. Personal use of this material is permitted. Permission from IEEE must be obtained for all other uses, in any current or future media, including reprinting/republishing this material for advertising or promotional purposes, creating new collective works, for resale or redistribution to servers or lists, or reuse of any copyrighted component of this work in other works", "summary": "The last decade has seen significant advances in computer-aided diagnostics for cytological screening, mainly through the improvement and integration of scanning techniques such as whole slide imaging (WSI) and the combination with deep learning. Simultaneously, new imaging techniques such as quantitative phase imaging (QPI) are being developed to capture richer cell information with less sample preparation. So far, the two worlds of WSI and QPI have not been combined. In this work, we present a reconstruction algorithm which makes whole slide imaging of cervical smears possible by using a self-referencing three-wave digital holographic microscope. Since a WSI is constructed by combining multiple patches, the algorithm is adaptive and can be used on partial holograms and patched holograms. We present the algorithm for a single shot hologram, the adaptations to make it flexible to various inputs and show that the algorithm performs well for the tested epithelial cells. This is a preprint of our paper, which has been accepted for publication in 2026 IEEE International Symposium on Biomedical Imaging (ISBI)."}
