{"id": "2601.20343", "pdf": "https://arxiv.org/pdf/2601.20343", "abs": "https://arxiv.org/abs/2601.20343", "authors": ["Yunbei Pan", "Christian Hofmann", "Barbara Banbury", "Harsh Patel", "Stephanie A. Bien", "Tom Chou", "Otto O. Yang"], "title": "CEI: A Clonal Expansion Identifier for T-cell receptor clones following SARS-CoV-2 vaccination", "categories": ["q-bio.QM"], "comment": null, "summary": "Each T cell typically carries a specific T-cell receptor (TCR) that determines its specificity against an epitope presented by the HLA complex on a target cell. Antigenic challenge triggers the expansion of reactive cells within a diverse pool of T cells with randomly generated receptors, a process that results in epitope-driven shifts of TCR frequencies over time. Here, we analyze the effects of SARS-CoV-2 vaccination on the TCR populations in peripheral blood drawn from seven COVID-naive individuals, before vaccines were widely available. To identify SARS-CoV-2 vaccine-associated TCR sequences among the $\\sim 10^{5}-10^{6}$ TCR sequences sampled before and after vaccination, we develop statistical criteria to detect significant increases in abundance of positive TCR clones. Application of our statistical methods shows a robust identification of TCR sequences that respond to SARS-CoV-2 vaccination in vivo, illustrating the feasibility of quantifying the clone-specific dynamics of T-cell abundance changes following immunological perturbations."}
{"id": "2601.20236", "pdf": "https://arxiv.org/pdf/2601.20236", "abs": "https://arxiv.org/abs/2601.20236", "authors": ["Jakub Czuchnowski", "Jerome Mertz"], "title": "Implications of temporal sampling in voltage imaging microscopy", "categories": ["physics.optics", "q-bio.NC", "q-bio.QM"], "comment": "9 pages, 3 figures", "summary": "Significance: Voltage imaging microscopy has emerged as a powerful tool to investigate neural activity both in vivo and in vitro. Various imaging approaches have been developed, including point-scanning, line-scanning and wide-field microscopes, however the effects of their different temporal sampling methods on signal fidelity have not yet been fully investigated. Aim: To provide an analysis of the inherent advantages and disadvantages of temporal sampling in scanning and wide-field microscopes and their effect on the fidelity of voltage spike detection. Approach: We develop a mathematical framework based on a mixture of analytical modeling and computer simulations with Monte-Carlo approaches. Results: Scanning microscopes outperform wide-field microscopes in low signal-to-noise conditions and when only a small subset of spikes needs to be detected. Wide-field microscopes outperform scanning microscopes when the measurement is temporally undersampled and a large fraction of the spikes needs to be detected. Both modalities converge in performance as sampling increases and the frame rate reaches the decay rate of the voltage indicator. Conclusions: Our work provides guidance for the selection of optimal temporal sampling parameters for voltage imaging. Most importantly it advises against using scanning voltage imaging microscopes at frame rates below 500 Hz."}
