{"id": "2602.11609", "pdf": "https://arxiv.org/pdf/2602.11609", "abs": "https://arxiv.org/abs/2602.11609", "authors": ["Yiming Gao", "Zhen Wang", "Jefferson Chen", "Mark Antkowiak", "Mengzhou Hu", "JungHo Kong", "Dexter Pratt", "Jieyuan Liu", "Enze Ma", "Zhiting Hu", "Eric P. Xing"], "title": "scPilot: Large Language Model Reasoning Toward Automated Single-Cell Analysis and Discovery", "categories": ["cs.AI", "q-bio.GN"], "comment": "Accepted at NeurIPS 2025 Main Conference", "summary": "We present scPilot, the first systematic framework to practice omics-native reasoning: a large language model (LLM) converses in natural language while directly inspecting single-cell RNA-seq data and on-demand bioinformatics tools. scPilot converts core single-cell analyses, i.e., cell-type annotation, developmental-trajectory reconstruction, and transcription-factor targeting, into step-by-step reasoning problems that the model must solve, justify, and, when needed, revise with new evidence.\n  To measure progress, we release scBench, a suite of 9 expertly curated datasets and graders that faithfully evaluate the omics-native reasoning capability of scPilot w.r.t various LLMs. Experiments with o1 show that iterative omics-native reasoning lifts average accuracy by 11% for cell-type annotation and Gemini-2.5-Pro cuts trajectory graph-edit distance by 30% versus one-shot prompting, while generating transparent reasoning traces explain marker gene ambiguity and regulatory logic. By grounding LLMs in raw omics data, scPilot enables auditable, interpretable, and diagnostically informative single-cell analyses.\n  Code, data, and package are available at https://github.com/maitrix-org/scPilot"}
{"id": "2602.11618", "pdf": "https://arxiv.org/pdf/2602.11618", "abs": "https://arxiv.org/abs/2602.11618", "authors": ["Tatsuya Sagawa", "Ryosuke Kojima"], "title": "How Well Do Large-Scale Chemical Language Models Transfer to Downstream Tasks?", "categories": ["cs.LG", "q-bio.QM"], "comment": null, "summary": "Chemical Language Models (CLMs) pre-trained on large scale molecular data are widely used for molecular property prediction. However, the common belief that increasing training resources such as model size, dataset size, and training compute improves both pretraining loss and downstream task performance has not been systematically validated in the chemical domain. In this work, we evaluate this assumption by pretraining CLMs while scaling training resources and measuring transfer performance across diverse molecular property prediction (MPP) tasks. We find that while pretraining loss consistently decreases with increased training resources, downstream task performance shows limited improvement. Moreover, alternative metrics based on the Hessian or loss landscape also fail to estimate downstream performance in CLMs. We further identify conditions under which downstream performance saturates or degrades despite continued improvements in pretraining metrics, and analyze the underlying task dependent failure modes through parameter space visualizations. These results expose a gap between pretraining based evaluation and downstream performance, and emphasize the need for model selection and evaluation strategies that explicitly account for downstream task characteristics."}
{"id": "2602.12026", "pdf": "https://arxiv.org/pdf/2602.12026", "abs": "https://arxiv.org/abs/2602.12026", "authors": ["Darin Tsui", "Kunal Talreja", "Daniel Saeedi", "Amirali Aghazadeh"], "title": "Protein Circuit Tracing via Cross-layer Transcoders", "categories": ["cs.LG", "q-bio.QM"], "comment": "29 pages, 15 figures", "summary": "Protein language models (pLMs) have emerged as powerful predictors of protein structure and function. However, the computational circuits underlying their predictions remain poorly understood. Recent mechanistic interpretability methods decompose pLM representations into interpretable features, but they treat each layer independently and thus fail to capture cross-layer computation, limiting their ability to approximate the full model. We introduce ProtoMech, a framework for discovering computational circuits in pLMs using cross-layer transcoders that learn sparse latent representations jointly across layers to capture the model's full computational circuitry. Applied to the pLM ESM2, ProtoMech recovers 82-89% of the original performance on protein family classification and function prediction tasks. ProtoMech then identifies compressed circuits that use <1% of the latent space while retaining up to 79% of model accuracy, revealing correspondence with structural and functional motifs, including binding, signaling, and stability. Steering along these circuits enables high-fitness protein design, surpassing baseline methods in more than 70% of cases. These results establish ProtoMech as a principled framework for protein circuit tracing."}
