{"id": "2601.04375", "pdf": "https://arxiv.org/pdf/2601.04375", "abs": "https://arxiv.org/abs/2601.04375", "authors": ["Mohsen Nakhaei", "Alison Pouch", "Silvani Amin", "Matthew Daemer", "Christian Herz", "Natalie Yushkevich", "Lourdes Al Ghofaily", "Nimesh Desai", "Joseph Bavaria", "Matthew Jolley", "Wensi Wu"], "title": "Biomechanically Informed Image Registration for Patient-Specific Aortic Valve Strain Analysis", "categories": ["q-bio.QM", "physics.app-ph"], "comment": null, "summary": "Aortic valve (AV) biomechanics play a critical role in maintaining normal cardiac function. Pathological variations, particularly in bicuspid aortic valves (BAVs), alter leaflet loading, increase strain, and accelerate disease progression. Accurate, patient-specific characterization of valve geometry and deformation is essential for predicting disease progression and guiding durable repair. Current imaging and computational methods often fail to capture rapid valve motion and complex patient-specific features. To address these challenges, we combined image registration with finite element method (FEM) to enhance AV tracking and biomechanical assessment. Patient-specific valve geometries from 4D transesophageal echocardiography (TEE) and CT were used in FEM to model AV closure and generate intermediate deformation states. The FEM-generated states facilitated leaflet tracking, while the registration algorithm corrected mismatches between simulation and image. Across 20 patients, FEM-augmented registration improved accuracy by 40% compared with direct registration (33% for TEE, 46% for CT). This improvement enabled more reliable strain estimation directly from imaging and reducing uncertainties from boundary conditions and material assumptions. Areal and Green-Lagrange strains, as well as effective strain, were quantified in adult trileaflet/bicuspid, and pediatric patients. Trileaflet adults showed uniform deformation, BAVs exhibited asymmetric strain, and pediatric valves had low mean areal strain with high variability. Convergence between trileaflet adult and pediatric valves in mean effective strain suggests volumetric deformation drives age- and size-related differences. The FEM-augmented registration framework enhances geometric tracking and provides clinically relevant insights into patient-specific AV deformation, supporting individualized intervention planning."}
{"id": "2601.04536", "pdf": "https://arxiv.org/pdf/2601.04536", "abs": "https://arxiv.org/abs/2601.04536", "authors": ["David Swanson", "Alexander Sherry", "Cara Haymaker", "Alexandre Reuben", "Chad Tang"], "title": "Identifying expanding TCR clonotypes with a longitudinal Bayesian mixture model and their associations with cancer patient prognosis, metastasis-directed therapy, and VJ gene enrichment", "categories": ["q-bio.QM", "stat.ME"], "comment": null, "summary": "Examination of T-cell receptor (TCR) clonality has become a way of understanding immunologic response to cancer and its interventions in recent years. An aspect of these analyses is determining which receptors expand or contract statistically significantly as a function of an exogenous perturbation such as therapeutic intervention. We characterize the commonly used Fisher's exact test approach for such analyses and propose an alternative formulation that does not necessitate pairwise, within-patient comparisons. We develop this flexible Bayesian longitudinal mixture model that accommodates variable length patient followup and handles missingness where present, not omitting data in estimation because of structural practicalities. Once clones are partitioned by the model into dynamic (expanding or contracting) and static categories, one can associate their counts or other characteristics with disease state, interventions, baseline biomarkers, and patient prognosis. We apply these developments to a cohort of prostate cancer patients who underwent randomized metastasis-directed therapy or not. Our analyses reveal a significant increase in clonal expansions among MDT patients and their association with later progressions both independent and within strata of MDT. Analysis of receptor motifs and VJ gene enrichment combinations using a high-dimensional penalized log-linear model we develop also suggests distinct biological characteristics of expanding clones, with and without inducement by MDT."}
{"id": "2601.04299", "pdf": "https://arxiv.org/pdf/2601.04299", "abs": "https://arxiv.org/abs/2601.04299", "authors": ["Pir Bakhsh Khokhar", "Carmine Gravino", "Fabio Palomba", "Sule Yildrim Yayilgan", "Sarang Shaikh"], "title": "Transformer-Based Multi-Modal Temporal Embeddings for Explainable Metabolic Phenotyping in Type 1 Diabetes", "categories": ["cs.LG", "q-bio.QM"], "comment": null, "summary": "Type 1 diabetes (T1D) is a highly metabolically heterogeneous disease that cannot be adequately characterized by conventional biomarkers such as glycated hemoglobin (HbA1c). This study proposes an explainable deep learning framework that integrates continuous glucose monitoring (CGM) data with laboratory profiles to learn multimodal temporal embeddings of individual metabolic status. Temporal dependencies across modalities are modeled using a transformer encoder, while latent metabolic phenotypes are identified via Gaussian mixture modeling. Model interpretability is achieved through transformer attention visualization and SHAP-based feature attribution. Five latent metabolic phenotypes, ranging from metabolic stability to elevated cardiometabolic risk, were identified among 577 individuals with T1D. These phenotypes exhibit distinct biochemical profiles, including differences in glycemic control, lipid metabolism, renal markers, and thyrotropin (TSH) levels. Attention analysis highlights glucose variability as a dominant temporal factor, while SHAP analysis identifies HbA1c, triglycerides, cholesterol, creatinine, and TSH as key contributors to phenotype differentiation. Phenotype membership shows statistically significant, albeit modest, associations with hypertension, myocardial infarction, and heart failure. Overall, this explainable multimodal temporal embedding framework reveals physiologically coherent metabolic subgroups in T1D and supports risk stratification beyond single biomarkers."}
{"id": "2601.04926", "pdf": "https://arxiv.org/pdf/2601.04926", "abs": "https://arxiv.org/abs/2601.04926", "authors": ["Jinshan Xu", "Changgui Gu", "Alain Pumir", "Nicolas Garnier", "Zonghua Liu"], "title": "Entrainment of the suprachiasmatic nucleus network by a light-dark cycle", "categories": ["nlin.AO", "q-bio.QM"], "comment": null, "summary": "The synchronization of biological activity with the alternation of day and night (circadian rhythm) is performed in the brain by a group of neurons, constituting the suprachiasmatic nucleus (SCN). The SCN is divided into two subgroups of oscillating cells: the ventro-lateral (VL) neurons, which are exposed to light (photic signal) and the dorso-medial (DM) neurons which are coupled to the VL cells. When the coupling between these neurons is strong enough, the system synchronizes with the photic period. Upon increasing the cell coupling, the entrainment of the DM cells has been recently shown to occur via a very sharp (jumping) transition when the period of the photic input is larger than the intrinsic period of the cells. Here, we characterize this transition with a simple realistic model. We show that two bifurcations possibly lead to the disappearance of the endogenous mode. Using a mean field model, we show that the jumping transition results from a supercritical Hopf-like bifurcation. This finding implies that both the period and strength of the stimulating photic signal, and the relative fraction of cells in the VL and DM compartments are crucial in determining the synchronization of the system."}
