{"id": "2512.23754", "pdf": "https://arxiv.org/pdf/2512.23754", "abs": "https://arxiv.org/abs/2512.23754", "authors": ["Eran Agmon", "Ryan K Spangler"], "title": "Process Bigraphs and the Architecture of Compositional Systems Biology", "categories": ["q-bio.QM"], "comment": "16 pages, 7 figures, Supplementary Materials available", "summary": "Building multiscale biological models requires integrating independently developed submodels, which involves sharing variables and coordinating execution. Most existing tools focus on isolated mechanisms and numerical methods, but rarely specify model interfaces: which variables are read or written, how they are translated, or how updates are synchronized. We present Process Bigraphs, a framework for composing and simulating multiscale biological models. Process Bigraphs generalize architectural principles from the Vivarium software into a shared specification that defines process interfaces, hierarchical data structures, composition patterns, and orchestration patterns. The paper describes the organization of the framework and explains how it improves model clarity, reuse, and extensibility; formal definitions are provided in the Supplementary Materials. We introduce Vivarium 2.0 as an open-source implementation of the Process Bigraph framework and demonstrate its utility with Spatio-Flux, a standalone library for microbial ecosystem simulations that integrate kinetic ODEs, dynamic flux balance analysis, and spatial processes. We conclude by discussing implications for emerging standards in multiscale modeling. Availability and implementation: Vivarium 2.0 is an open-source suite of libraries including: (1) bigraph-schema for hierarchical, JSON-based data typing; (2) process-bigraph for defining process interfaces and executing composite simulations; (3) bigraph-viz for interactive visualization of system structure and data flow; and (4) spatio-flux, the reference application used in this work. Detailed descriptions are provided in the Supplementary Materials. All software is available at https://github.com/vivarium-collective"}
{"id": "2512.23861", "pdf": "https://arxiv.org/pdf/2512.23861", "abs": "https://arxiv.org/abs/2512.23861", "authors": ["Sayeh Rezaee", "Cesar Nieto", "Abhyudai Singh"], "title": "Stochastic multi-step cell size homeostasis model for cycling human cells", "categories": ["q-bio.QM", "q-bio.CB"], "comment": null, "summary": "Measurements of cell size dynamics have established the adder principle as a robust mechanism of cell size homeostasis. In this framework, cells add a nearly constant amount of size during each cell cycle, independent of their size at birth. Theoretical studies have shown that the adder principle can be achieved when cell-cycle progression is coupled to cell size. Here, we extend this framework by considering a general growth law modeled as a Hill-type function of cell size. This assumption introduces growth saturation to the model, such that very large cells grow approximately linearly rather than exponentially. Additionally, to capture the sequential nature of division, we implement a stochastic multi-step adder model in which cells progress through internal regulatory stages before dividing. From this model, we derive exact analytical expressions for the moments of cell size distributions. Our results show that stronger growth saturation increases the mean cell size in steady state, while slightly reducing fluctuations compared to exponential growth. Importantly, despite these changes, the adder property is preserved. This emphasizes that the reduction in size variability is a consequence of~the growth law rather than simple scaling with mean size. Finally, we analyze stochastic clonal proliferation and find that growth saturation influences both single-cell size statistics and variability across populations. Our results provide a generalized framework for connecting multi-step adder mechanisms with proliferation dynamics, extending size control theory beyond exponential growth."}
{"id": "2512.23877", "pdf": "https://arxiv.org/pdf/2512.23877", "abs": "https://arxiv.org/abs/2512.23877", "authors": ["Vincent Beguin", "Jean Grétillat", "Kornelija Kaminskaitė", "Simonas Juzenas", "Dainius Kirsnauskas", "Pierre-Yves Burgi", "Samuel Wenger", "Valentin Remonnay", "Silvia Angeloni", "Bart van der Schoot", "Augustin Cerveaux", "Thomas Heinis", "Renaldas Raisutis", "Martin Jost", "Lukas Zemaitis", "Ignas Galminas", "Jérôme Charmet"], "title": "High-fidelity robotic PCR amplification for DNA data storage", "categories": ["q-bio.QM"], "comment": "28 pages total (manuscript: 18 pages, including 10 figures and references) (supplementary materials: 10 pages, including 9 figures)", "summary": "Polymerase chain reaction (PCR) is fundamental to molecular biology, yet conventional thermocyclers pose significant challenges for emerging applications such as DNA data storage, where full automation, contamination control, and cost-effectiveness are critical. Here, we introduce a disruptive approach that revisits the original water bath-based PCR method and integrates it with modern robotic liquid-handling technology. Our system performs amplification entirely within sealed pipette tips using automated immersion and withdrawal in a single temperature-controlled oil bath, eliminating the need for sophisticated thermal management while enabling precise temperature control across denaturation, annealing, and extension steps. We demonstrate that this approach achieves amplification efficiency and sequencing fidelity comparable to high-performance thermocyclers when applied to DNA-encoded datasets. The platform minimizes reagent waste, reduces contamination risks through complete tip isolation, and enables full sample recovery. This modular, automation-ready design provides a scalable and cost-effective solution for PCR workflows in DNA data storage, high-throughput diagnostics, and distributed laboratory settings."}
{"id": "2512.24654", "pdf": "https://arxiv.org/pdf/2512.24654", "abs": "https://arxiv.org/abs/2512.24654", "authors": ["Ye Ma", "Shixin Lin", "Shengxing Fu", "Yuwei Liu", "Chenyi Guo", "Dongwei Liu", "Meijin Hou"], "title": "Muscle Synergy Patterns During Running: Coordinative Mechanisms From a Neuromechanical Perspective", "categories": ["q-bio.QM", "q-bio.NC"], "comment": "18 pages, 1 figure, 2 tables, Chinese", "summary": "Running is a fundamental form of human locomotion and a key task for evaluating neuromuscular control and lower-limb coordination. In recent years, muscle synergy analysis based on surface electromyography (sEMG) has become an important approach in this area. This review focuses on muscle synergies during running, outlining core neural control theories and biomechanical optimization hypotheses, summarizing commonly used decomposition methods (e.g., PCA, ICA, FA, NMF) and emerging autoencoder-based approaches. We synthesize findings on the development and evolution of running-related synergies across the lifespan, examine how running surface, speed, foot-strike pattern, fatigue, and performance level modulate synergy patterns, and describe characteristic alterations in populations with knee osteoarthritis, patellofemoral pain, and stroke. Current evidence suggests that the number and basic structure of lower-limb synergies during running are relatively stable, whereas spatial muscle weightings and motor primitives are highly plastic and sensitive to task demands, fatigue, and pathology. However, substantial methodological variability remains in EMG channel selection, preprocessing pipelines, and decomposition algorithms, and direct neurophysiological validation and translational application are still limited. Future work should prioritize standardized processing protocols, integration of multi-source neuromusculoskeletal data, nonlinear modeling, and longitudinal intervention studies to better exploit muscle synergy analysis in sports biomechanics, athletic training, and rehabilitation medicine."}
{"id": "2512.24843", "pdf": "https://arxiv.org/pdf/2512.24843", "abs": "https://arxiv.org/abs/2512.24843", "authors": ["Alexandra Suvorikova", "Alexey Kroshnin", "Dmirijs Lvovs", "Vera Mukhina", "Andrey Mironov", "Elana J. Fertig", "Ludmila Danilova", "Alexander Favorov"], "title": "friends.test: rank-based method for feature selection in interaction matrices", "categories": ["q-bio.QM"], "comment": "12 pages, 3 figures. The first two listed authors contributed equally to this work", "summary": "The analysis of the interaction matrix between two distinct sets is essential across diverse fields, from pharmacovigilance to transcriptomics. Not all interactions are equally informative: a marker gene associated with a few specific biological processes is more informative than a highly expressed non-specific gene associated with most observed processes. Identifying these interactions is challenging due to background connections. Furthermore, data heterogeneity across sources precludes universal identification criteria.\n  To address this challenge, we introduce \\textsf{friends.test}, a method for identifying specificity by detecting structural breaks in entity interactions. Rank-based representation of the interaction matrix ensures invariance to heterogeneous data and allows for integrating data from diverse sources. To automatically locate the boundary between specific interactions and background activity, we employ model fitting. We demonstrate the applicability of \\textsf{friends.test} on the GSE112026 -- transnational data from head and neck cancer. A computationally efficient \\textsf{R} implementation is available at https://github.com/favorov/friends.test."}
{"id": "2512.24945", "pdf": "https://arxiv.org/pdf/2512.24945", "abs": "https://arxiv.org/abs/2512.24945", "authors": ["Eduardo D. Sontag"], "title": "Dynamic response phenotypes and model discrimination in systems and synthetic biology", "categories": ["q-bio.QM", "math.OC"], "comment": null, "summary": "Biological systems encode function not primarily in steady states, but in the structure of transient responses elicited by time-varying stimuli. Overshoots, biphasic dynamics, adaptation kinetics, fold-change detection, entrainment, and cumulative exposure effects often determine phenotypic outcomes, yet are poorly captured by classical steady-state or dose-response analyses. This paper develops an input-output perspective on such \"dynamic phenotypes,\" emphasizing how qualitative features of transient behavior constrain underlying network architectures independently of detailed parameter values. A central theme is the role of sign structure and interconnection logic, particularly the contrast between monotone systems and architectures containing antagonistic pathways. We show how incoherent feedforward (IFF) motifs provide a simple and recurrent mechanism for generating non-monotonic and adaptive responses across multiple levels of biological organization, from molecular signaling to immune regulation and population dynamics. Conversely, monotonicity imposes sharp impossibility results that can be used to falsify entire classes of models from transient data alone. Beyond step inputs, we highlight how periodic forcing, ramps, and integral-type readouts such as cumulative dose responses offer powerful experimental probes that reveal otherwise hidden structure, separate competing motifs, and expose invariances such as fold-change detection. Throughout, we illustrate how control-theoretic concepts, including monotonicity, equivariance, and input-output analysis, can be used not as engineering metaphors, but as precise mathematical tools for biological model discrimination. Thus we argue for a shift in emphasis from asymptotic behavior to transient and input-driven dynamics as a primary lens for understanding, testing, and reverse-engineering biological networks."}
{"id": "2512.24401", "pdf": "https://arxiv.org/pdf/2512.24401", "abs": "https://arxiv.org/abs/2512.24401", "authors": ["Shani Martinez-Weissberg", "Will Pazner", "Zohar Yosibash"], "title": "Finite element analysis of very large bone models based on micro-CT scans", "categories": ["physics.med-ph", "math.NA", "q-bio.QM"], "comment": "23 pages, 21 figures", "summary": "High-resolution voxel-based micro-finite element ($μ$FE) models derived from $μ$CT imaging enable detailed investigation of bone mechanics but remain computationally challenging at anatomically relevant scales. This study presents a comprehensive $μ$FE framework for large-scale biomechanical analysis of an intact New Zealand White (NZW) rabbit femur, integrating advanced segmentation, scalable finite element solvers, and experimental validation using predominantly open-source libraries. Bone geometries were segmented from $μ$CT data using the MIA clustering algorithm and converted into voxel-based $μ$FE meshes, which were solved using the open-source MFEM library with algorithms designed for large-scale linear elasticity systems.\n  The numerical solutions were verified by comparing with a commercial finite element solver, and by evaluating the performance of full assembly and element-by-element formulations within MFEM. Models containing over $8\\times10^{8}$ DOFs were solved using moderate HPC resources, demonstrating the feasibility of anatomically realistic $μ$FE simulations at this scale. Resolution effects were investigated by comparing models with voxel sizes of 20, 40, and 80 $μ$m, revealing that 40 $μ$m preserves boundary displacement and principal strain distributions with minimal bias while significantly reducing computational cost. Sensitivity analyses further showed that segmentation parameters influence the global mechanical response.\n  Finally, $μ$FE predictions were coupled with Digital Image Correlation measurements on an NZW rabbit femur under compression to calibrate effective bone material properties at the micron scale. The results demonstrate that large-scale, experimentally informed $μ$FE modeling can be achieved using open-source tools, providing a robust foundation for preclinical assessment of bone mechanics and treatment-related risks."}
{"id": "2512.24427", "pdf": "https://arxiv.org/pdf/2512.24427", "abs": "https://arxiv.org/abs/2512.24427", "authors": ["Sascha H. Hauck", "Sandip Saha", "Narsis A. Kiani", "Jesper N. Tegner"], "title": "Epigenetic Control and Reprogramming-Induced Potential Landscapes of Gene Regulatory Networks: A Quantitative Theoretical Approach", "categories": ["q-bio.MN", "nlin.AO", "nlin.CD", "physics.bio-ph", "q-bio.QM"], "comment": "18 pages, 7 figures", "summary": "We develop an extended Dynamical Mean Field Theory framework to analyze gene regulatory networks (GRNs) incorporating epigenetic modifications. Building on the Hopfield network model analogy to spin glass systems, our approach introduces dynamic terms representing DNA methylation and histone modification to capture their regulatory influence on gene expression. The resulting formulation reduces high-dimensional GRN dynamics to effective stochastic equations, enabling the characterization of both stable and oscillatory states in epigenetically regulated systems. This framework provides a tractable and quantitative method for linking gene regulatory dynamics with epigenetic control, offering new theoretical insights into developmental processes and cell fate decisions."}
