{"id": "2601.10959", "pdf": "https://arxiv.org/pdf/2601.10959", "abs": "https://arxiv.org/abs/2601.10959", "authors": ["Mohammad Reza Yousefi", "Hajar Ismail Al-Tamimi", "Amin Dehghani"], "title": "Depression Detection Based on Electroencephalography Using a Hybrid Deep Neural Network CNN-GRU and MRMR Feature Selection", "categories": ["q-bio.QM", "cs.LG"], "comment": "20 pages, 8 figures", "summary": "This study investigates the detection and classification of depressive and non-depressive states using deep learning approaches. Depression is a prevalent mental health disorder that substantially affects quality of life, and early diagnosis can greatly enhance treatment effectiveness and patient care. However, conventional diagnostic methods rely heavily on self-reported assessments, which are often subjective and may lack reliability. Consequently, there is a strong need for objective and accurate techniques to identify depressive states. In this work, a deep learning based framework is proposed for the early detection of depression using EEG signals. EEG data, which capture underlying brain activity and are not influenced by external behavioral factors, can reveal subtle neural changes associated with depression. The proposed approach combines convolutional neural networks (CNNs) and gated recurrent units (GRUs) to jointly extract spatial and temporal features from EEG recordings. The minimum redundancy maximum relevance (MRMR) algorithm is then applied to select the most informative features, followed by classification using a fully connected neural network. The results demonstrate that the proposed model achieves high performance in accurately identifying depressive states, with an overall accuracy of 98.74%. By effectively integrating temporal and spatial information and employing optimized feature selection, this method shows strong potential as a reliable tool for clinical applications. Overall, the proposed framework not only enables accurate early detection of depression but also has the potential to support improved treatment strategies and patient outcomes."}
{"id": "2601.11148", "pdf": "https://arxiv.org/pdf/2601.11148", "abs": "https://arxiv.org/abs/2601.11148", "authors": ["Ruben Taieb", "René Bruno", "Pascal Chanu", "Jin Yan Jin", "Sébastien Benzekry"], "title": "Mechanistic Learning for Survival Prediction in NSCLC Using Routine Blood Biomarkers and Tumor Kinetics", "categories": ["q-bio.QM"], "comment": null, "summary": "Background Predicting overall survival (OS) in non-small cell lung cancer (NSCLC) is essential for clinical decision-making and drug development. While tumor and blood test markers kinetics are intrinsically linked, their joint dynamics and relationship to OS remain unknown. Methods We developed a mechanistic model capturing the interplay between tumor (T) burden and three key blood markers kinetics: albumin (A), lactate dehydrogenase (L), and neutrophils (N), through coupled differential equations (termed TALN-k). This model was enhanced with a machine learning framework (TALN-kML) for OS prediction. The model was trained and validated on clinical trial data from NSCLC patients treated with atezolizumab in monotherapy (N = 862 patients) or combination therapy (N = 1,115). Model parameters were estimated using nonlinear mixed-effects modelling, and survival predictions were assessed using individual and trial level metrics. Results TALN-k successfully described individual and population-level marker kinetics, revealing complex interactions between tumor and blood markers, and improving corrected BIC and log-likelihood metrics by a significant margin of previous empirical state-of-the-art models. Feature selection methods also highlighted valuable predictive parameters, indicatives of good or poor prognosis. The TALN-kML model outperformed empirical, uncoupled models, achieving improved C-index (0.74 $\\pm$ 0.02 vs 0.72 $\\pm$ 0.03), 12-months AUC (0.83 $\\pm$ 0.004 vs 0.79 $\\pm$ 0.05), and accuracy (0.77 $\\pm$ 0.03 vs 0.76 $\\pm$ 0.05) in OS prediction. Conclusion Our mechanistic learning approach allows for an interpretable model, which improves on longitudinal data description and on survival prediction in NSCLC by jointly integrating tumor and blood markers kinetics. This methodology offers a promising avenue for both personalized treatment strategies and drug development optimization."}
