{"id": "2602.15451", "pdf": "https://arxiv.org/pdf/2602.15451", "abs": "https://arxiv.org/abs/2602.15451", "authors": ["Hayato Kunugi", "Mohsen Rahmani", "Yosuke Iyama", "Yutaro Hirono", "Akira Suma", "Matthew Woolway", "Vladimir Vargas-Calderón", "William Kim", "Kevin Chern", "Mohammad Amin", "Masaru Tateno"], "title": "Molecular Design beyond Training Data with Novel Extended Objective Functionals of Generative AI Models Driven by Quantum Annealing Computer", "categories": ["q-bio.QM", "cs.AI", "cs.LG", "quant-ph"], "comment": "42 pages, 7 figures", "summary": "Deep generative modeling to stochastically design small molecules is an emerging technology for accelerating drug discovery and development. However, one major issue in molecular generative models is their lower frequency of drug-like compounds. To resolve this problem, we developed a novel framework for optimization of deep generative models integrated with a D-Wave quantum annealing computer, where our Neural Hash Function (NHF) presented herein is used both as the regularization and binarization schemes simultaneously, of which the latter is for transformation between continuous and discrete signals of the classical and quantum neural networks, respectively, in the error evaluation (i.e., objective) function. The compounds generated via the quantum-annealing generative models exhibited higher quality in both validity and drug-likeness than those generated via the fully-classical models, and was further indicated to exceed even the training data in terms of drug-likeness features, without any restraints and conditions to deliberately induce such an optimization. These results indicated an advantage of quantum annealing to aim at a stochastic generator integrated with our novel neural network architectures, for the extended performance of feature space sampling and extraction of characteristic features in drug design."}
{"id": "2602.15677", "pdf": "https://arxiv.org/pdf/2602.15677", "abs": "https://arxiv.org/abs/2602.15677", "authors": ["Neelay Velingker", "Alaia Solko-Breslin", "Mayank Keoliya", "Seewon Choi", "Jiayi Xin", "Anika Marathe", "Alireza Oraii", "Rajat Deo", "Sameed Khatana", "Rajeev Alur", "Mayur Naik", "Eric Wong"], "title": "CAMEL: An ECG Language Model for Forecasting Cardiac Events", "categories": ["cs.LG", "q-bio.QM"], "comment": "24 pages, 6 figures", "summary": "Electrocardiograms (ECG) are electrical recordings of the heart that are critical for diagnosing cardiovascular conditions. ECG language models (ELMs) have recently emerged as a promising framework for ECG classification accompanied by report generation. However, current models cannot forecast future cardiac events despite the immense clinical value for planning earlier intervention. To address this gap, we propose CAMEL, the first ELM that is capable of inference over longer signal durations which enables its forecasting capability. Our key insight is a specialized ECG encoder which enables cross-understanding of ECG signals with text. We train CAMEL using established LLM training procedures, combining LoRA adaptation with a curriculum learning pipeline. Our curriculum includes ECG classification, metrics calculations, and multi-turn conversations to elicit reasoning. CAMEL demonstrates strong zero-shot performance across 6 tasks and 9 datasets, including ECGForecastBench, a new benchmark that we introduce for forecasting arrhythmias. CAMEL is on par with or surpasses ELMs and fully supervised baselines both in- and out-of-distribution, achieving SOTA results on ECGBench (+7.0% absolute average gain) as well as ECGForecastBench (+12.4% over fully supervised models and +21.1% over zero-shot ELMs)."}
{"id": "2602.15740", "pdf": "https://arxiv.org/pdf/2602.15740", "abs": "https://arxiv.org/abs/2602.15740", "authors": ["Fatemeh Khalvandi", "Saadat Izadi", "Abdolah Chalechale"], "title": "MRC-GAT: A Meta-Relational Copula-Based Graph Attention Network for Interpretable Multimodal Alzheimer's Disease Diagnosis", "categories": ["cs.LG", "cs.AI", "q-bio.QM"], "comment": "27 pages, 10 figures, 10 table", "summary": "Alzheimer's disease (AD) is a progressive neurodegenerative condition necessitating early and precise diagnosis to provide prompt clinical management. Given the paramount importance of early diagnosis, recent studies have increasingly focused on computer-aided diagnostic models to enhance precision and reliability. However, most graph-based approaches still rely on fixed structural designs, which restrict their flexibility and limit generalization across heterogeneous patient data. To overcome these limitations, the Meta-Relational Copula-Based Graph Attention Network (MRC-GAT) is proposed as an efficient multimodal model for AD classification tasks. The proposed architecture, copula-based similarity alignment, relational attention, and node fusion are integrated as the core components of episodic meta-learning, such that the multimodal features, including risk factors (RF), Cognitive test scores, and MRI attributes, are first aligned via a copula-based transformation in a common statistical space and then combined by a multi-relational attention mechanism. According to evaluations performed on the TADPOLE and NACC datasets, the MRC-GAT model achieved accuracies of 96.87% and 92.31%, respectively, demonstrating state-of-the-art performance compared to existing diagnostic models. Finally, the proposed model confirms the robustness and applicability of the proposed method by providing interpretability at various stages of disease diagnosis."}
